#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AreaReport

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AreaReport.AreaReport_C
// 0x0038 (0x04F8 - 0x04C0)
class UAreaReport_C final : public UEndWorldReportAreaPage
{
public:
	class UWidgetAnimation*                       Info_Out;                                          // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Info_in;                                           // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FromBattleSimulator;                               // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToBattleSimulator;                                 // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAreaReport_Info2_C*                    AreaReport_Info;                                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AreaReport_C">();
	}
	static class UAreaReport_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAreaReport_C>();
	}
};
static_assert(alignof(UAreaReport_C) == 0x000008, "Wrong alignment on UAreaReport_C");
static_assert(sizeof(UAreaReport_C) == 0x0004F8, "Wrong size on UAreaReport_C");
static_assert(offsetof(UAreaReport_C, Info_Out) == 0x0004C0, "Member 'UAreaReport_C::Info_Out' has a wrong offset!");
static_assert(offsetof(UAreaReport_C, Info_in) == 0x0004C8, "Member 'UAreaReport_C::Info_in' has a wrong offset!");
static_assert(offsetof(UAreaReport_C, FromBattleSimulator) == 0x0004D0, "Member 'UAreaReport_C::FromBattleSimulator' has a wrong offset!");
static_assert(offsetof(UAreaReport_C, Out) == 0x0004D8, "Member 'UAreaReport_C::Out' has a wrong offset!");
static_assert(offsetof(UAreaReport_C, In) == 0x0004E0, "Member 'UAreaReport_C::In' has a wrong offset!");
static_assert(offsetof(UAreaReport_C, ToBattleSimulator) == 0x0004E8, "Member 'UAreaReport_C::ToBattleSimulator' has a wrong offset!");
static_assert(offsetof(UAreaReport_C, AreaReport_Info) == 0x0004F0, "Member 'UAreaReport_C::AreaReport_Info' has a wrong offset!");

}

