#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AreaMap_TopMenu_Cell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AreaMap_TopMenu_Cell.AreaMap_TopMenu_Cell_C
// 0x0100 (0x04C8 - 0x03C8)
class UAreaMap_TopMenu_Cell_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Color_Chadley;                                     // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Color_Report;                                      // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Color_Story;                                       // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Color_Quest;                                       // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Color_Map;                                         // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Off;                                               // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       On;                                                // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseLight;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterPoint;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterPoint_1;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterPoint_2;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterPoint_3;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterPoint_4;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_New2_C*                           Icon_New;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1;                                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_1;                                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_2;                                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_3;                                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_4;                                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_5;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_6;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_7;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_8;                                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_9;                                           // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2;                                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2_1;                                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2_2;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2_3;                                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2_4;                                           // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AreaMap_TopMenu_Cell(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AreaMap_TopMenu_Cell_C">();
	}
	static class UAreaMap_TopMenu_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAreaMap_TopMenu_Cell_C>();
	}
};
static_assert(alignof(UAreaMap_TopMenu_Cell_C) == 0x000008, "Wrong alignment on UAreaMap_TopMenu_Cell_C");
static_assert(sizeof(UAreaMap_TopMenu_Cell_C) == 0x0004C8, "Wrong size on UAreaMap_TopMenu_Cell_C");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, UberGraphFrame) == 0x0003C8, "Member 'UAreaMap_TopMenu_Cell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Loop) == 0x0003D0, "Member 'UAreaMap_TopMenu_Cell_C::Loop' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Color_Chadley) == 0x0003D8, "Member 'UAreaMap_TopMenu_Cell_C::Color_Chadley' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Color_Report) == 0x0003E0, "Member 'UAreaMap_TopMenu_Cell_C::Color_Report' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Color_Story) == 0x0003E8, "Member 'UAreaMap_TopMenu_Cell_C::Color_Story' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Color_Quest) == 0x0003F0, "Member 'UAreaMap_TopMenu_Cell_C::Color_Quest' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Color_Map) == 0x0003F8, "Member 'UAreaMap_TopMenu_Cell_C::Color_Map' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Off) == 0x000400, "Member 'UAreaMap_TopMenu_Cell_C::Off' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, On) == 0x000408, "Member 'UAreaMap_TopMenu_Cell_C::On' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Base) == 0x000410, "Member 'UAreaMap_TopMenu_Cell_C::Base' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, BaseLight) == 0x000418, "Member 'UAreaMap_TopMenu_Cell_C::BaseLight' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, CenterPoint) == 0x000420, "Member 'UAreaMap_TopMenu_Cell_C::CenterPoint' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, CenterPoint_1) == 0x000428, "Member 'UAreaMap_TopMenu_Cell_C::CenterPoint_1' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, CenterPoint_2) == 0x000430, "Member 'UAreaMap_TopMenu_Cell_C::CenterPoint_2' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, CenterPoint_3) == 0x000438, "Member 'UAreaMap_TopMenu_Cell_C::CenterPoint_3' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, CenterPoint_4) == 0x000440, "Member 'UAreaMap_TopMenu_Cell_C::CenterPoint_4' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Icon_New) == 0x000448, "Member 'UAreaMap_TopMenu_Cell_C::Icon_New' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Line1) == 0x000450, "Member 'UAreaMap_TopMenu_Cell_C::Line1' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Line1_1) == 0x000458, "Member 'UAreaMap_TopMenu_Cell_C::Line1_1' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Line1_2) == 0x000460, "Member 'UAreaMap_TopMenu_Cell_C::Line1_2' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Line1_3) == 0x000468, "Member 'UAreaMap_TopMenu_Cell_C::Line1_3' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Line1_4) == 0x000470, "Member 'UAreaMap_TopMenu_Cell_C::Line1_4' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Line1_5) == 0x000478, "Member 'UAreaMap_TopMenu_Cell_C::Line1_5' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Line1_6) == 0x000480, "Member 'UAreaMap_TopMenu_Cell_C::Line1_6' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Line1_7) == 0x000488, "Member 'UAreaMap_TopMenu_Cell_C::Line1_7' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Line1_8) == 0x000490, "Member 'UAreaMap_TopMenu_Cell_C::Line1_8' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Line1_9) == 0x000498, "Member 'UAreaMap_TopMenu_Cell_C::Line1_9' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Line2) == 0x0004A0, "Member 'UAreaMap_TopMenu_Cell_C::Line2' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Line2_1) == 0x0004A8, "Member 'UAreaMap_TopMenu_Cell_C::Line2_1' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Line2_2) == 0x0004B0, "Member 'UAreaMap_TopMenu_Cell_C::Line2_2' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Line2_3) == 0x0004B8, "Member 'UAreaMap_TopMenu_Cell_C::Line2_3' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopMenu_Cell_C, Line2_4) == 0x0004C0, "Member 'UAreaMap_TopMenu_Cell_C::Line2_4' has a wrong offset!");

}

