#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AreaReport_Info2

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AreaReport_Info2.AreaReport_Info2_C
// 0x00D0 (0x0498 - 0x03C8)
class UAreaReport_Info2_C final : public UEndUserWidget
{
public:
	class UShop_Bg3_C*                            Bg2_4;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_5;                                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg2;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_ReportImg;                               // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_58;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_63;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame1;                                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame3;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame4;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame4_1;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame5;                                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame5_1;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame6;                                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon;                                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ImgBg;                                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_InfoWindowBg_C*               InfoWindowBg;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_1;                                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_3;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_4;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_5;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_6;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_7;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_8;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuest_RecommendLevel_C*                RecommendLevel;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ReportTitle;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AreaReport_Info2_C">();
	}
	static class UAreaReport_Info2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAreaReport_Info2_C>();
	}
};
static_assert(alignof(UAreaReport_Info2_C) == 0x000008, "Wrong alignment on UAreaReport_Info2_C");
static_assert(sizeof(UAreaReport_Info2_C) == 0x000498, "Wrong size on UAreaReport_Info2_C");
static_assert(offsetof(UAreaReport_Info2_C, Bg2_4) == 0x0003C8, "Member 'UAreaReport_Info2_C::Bg2_4' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, Bg2_5) == 0x0003D0, "Member 'UAreaReport_Info2_C::Bg2_5' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, Billboard_Bg) == 0x0003D8, "Member 'UAreaReport_Info2_C::Billboard_Bg' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, Billboard_Bg2) == 0x0003E0, "Member 'UAreaReport_Info2_C::Billboard_Bg2' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, Billboard_ReportImg) == 0x0003E8, "Member 'UAreaReport_Info2_C::Billboard_ReportImg' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, EndImage_58) == 0x0003F0, "Member 'UAreaReport_Info2_C::EndImage_58' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, EndImage_63) == 0x0003F8, "Member 'UAreaReport_Info2_C::EndImage_63' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, Frame1) == 0x000400, "Member 'UAreaReport_Info2_C::Frame1' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, Frame3) == 0x000408, "Member 'UAreaReport_Info2_C::Frame3' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, Frame4) == 0x000410, "Member 'UAreaReport_Info2_C::Frame4' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, Frame4_1) == 0x000418, "Member 'UAreaReport_Info2_C::Frame4_1' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, Frame5) == 0x000420, "Member 'UAreaReport_Info2_C::Frame5' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, Frame5_1) == 0x000428, "Member 'UAreaReport_Info2_C::Frame5_1' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, Frame6) == 0x000430, "Member 'UAreaReport_Info2_C::Frame6' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, Icon) == 0x000438, "Member 'UAreaReport_Info2_C::Icon' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, ImgBg) == 0x000440, "Member 'UAreaReport_Info2_C::ImgBg' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, InfoWindowBg) == 0x000448, "Member 'UAreaReport_Info2_C::InfoWindowBg' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, Line_1) == 0x000450, "Member 'UAreaReport_Info2_C::Line_1' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, ListPoint_3) == 0x000458, "Member 'UAreaReport_Info2_C::ListPoint_3' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, ListPoint_4) == 0x000460, "Member 'UAreaReport_Info2_C::ListPoint_4' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, ListPoint_5) == 0x000468, "Member 'UAreaReport_Info2_C::ListPoint_5' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, ListPoint_6) == 0x000470, "Member 'UAreaReport_Info2_C::ListPoint_6' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, ListPoint_7) == 0x000478, "Member 'UAreaReport_Info2_C::ListPoint_7' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, ListPoint_8) == 0x000480, "Member 'UAreaReport_Info2_C::ListPoint_8' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, RecommendLevel) == 0x000488, "Member 'UAreaReport_Info2_C::RecommendLevel' has a wrong offset!");
static_assert(offsetof(UAreaReport_Info2_C, Txt_ReportTitle) == 0x000490, "Member 'UAreaReport_Info2_C::Txt_ReportTitle' has a wrong offset!");

}

