#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AreaMap_TopBase

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AreaMap_TopBase.AreaMap_TopBase_C
// 0x0048 (0x04C0 - 0x0478)
class UAreaMap_TopBase_C final : public UEndMapJournalMenu
{
public:
	class UWidgetAnimation*                       Menu_In;                                           // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot1;                                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot2;                                              // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              GrayBg;                                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              GrayBg_1;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMap_PlayerLevel_C*                     Map_PlayerLevel;                                   // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Shop_Bg3;                                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AreaMap_TopBase_C">();
	}
	static class UAreaMap_TopBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAreaMap_TopBase_C>();
	}
};
static_assert(alignof(UAreaMap_TopBase_C) == 0x000008, "Wrong alignment on UAreaMap_TopBase_C");
static_assert(sizeof(UAreaMap_TopBase_C) == 0x0004C0, "Wrong size on UAreaMap_TopBase_C");
static_assert(offsetof(UAreaMap_TopBase_C, Menu_In) == 0x000478, "Member 'UAreaMap_TopBase_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopBase_C, Base) == 0x000480, "Member 'UAreaMap_TopBase_C::Base' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopBase_C, Dot1) == 0x000488, "Member 'UAreaMap_TopBase_C::Dot1' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopBase_C, Dot2) == 0x000490, "Member 'UAreaMap_TopBase_C::Dot2' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopBase_C, GrayBg) == 0x000498, "Member 'UAreaMap_TopBase_C::GrayBg' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopBase_C, GrayBg_1) == 0x0004A0, "Member 'UAreaMap_TopBase_C::GrayBg_1' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopBase_C, Line) == 0x0004A8, "Member 'UAreaMap_TopBase_C::Line' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopBase_C, Map_PlayerLevel) == 0x0004B0, "Member 'UAreaMap_TopBase_C::Map_PlayerLevel' has a wrong offset!");
static_assert(offsetof(UAreaMap_TopBase_C, Shop_Bg3) == 0x0004B8, "Member 'UAreaMap_TopBase_C::Shop_Bg3' has a wrong offset!");

}

