#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleSimulator_Ex

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleSimulator_Ex.BattleSimulator_Ex_C
// 0x0018 (0x0788 - 0x0770)
class UBattleSimulator_Ex_C final : public UEndWorldReportVrExPage
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0770(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0778(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBattleSimulator_Info_C*                BattleSimulator_Info;                              // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleSimulator_Ex_C">();
	}
	static class UBattleSimulator_Ex_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleSimulator_Ex_C>();
	}
};
static_assert(alignof(UBattleSimulator_Ex_C) == 0x000008, "Wrong alignment on UBattleSimulator_Ex_C");
static_assert(sizeof(UBattleSimulator_Ex_C) == 0x000788, "Wrong size on UBattleSimulator_Ex_C");
static_assert(offsetof(UBattleSimulator_Ex_C, Out) == 0x000770, "Member 'UBattleSimulator_Ex_C::Out' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Ex_C, In) == 0x000778, "Member 'UBattleSimulator_Ex_C::In' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Ex_C, BattleSimulator_Info) == 0x000780, "Member 'UBattleSimulator_Ex_C::BattleSimulator_Info' has a wrong offset!");

}

