#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleText_Sub

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleText_Sub.BattleText_Sub_C
// 0x0048 (0x04A0 - 0x0458)
class UBattleText_Sub_C final : public UEndDamageSubText
{
public:
	class UWidgetAnimation*                       Linkage_In;                                        // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal_Out;                                        // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal_In;                                         // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_BattleText_Sub;                                // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             All_Nut_BattleText_Sub;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_03;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_BattleText_Sub;                                // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Sub;                                           // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleText_Sub_C">();
	}
	static class UBattleText_Sub_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleText_Sub_C>();
	}
};
static_assert(alignof(UBattleText_Sub_C) == 0x000008, "Wrong alignment on UBattleText_Sub_C");
static_assert(sizeof(UBattleText_Sub_C) == 0x0004A0, "Wrong size on UBattleText_Sub_C");
static_assert(offsetof(UBattleText_Sub_C, Linkage_In) == 0x000458, "Member 'UBattleText_Sub_C::Linkage_In' has a wrong offset!");
static_assert(offsetof(UBattleText_Sub_C, Loop) == 0x000460, "Member 'UBattleText_Sub_C::Loop' has a wrong offset!");
static_assert(offsetof(UBattleText_Sub_C, Normal_Out) == 0x000468, "Member 'UBattleText_Sub_C::Normal_Out' has a wrong offset!");
static_assert(offsetof(UBattleText_Sub_C, Normal_In) == 0x000470, "Member 'UBattleText_Sub_C::Normal_In' has a wrong offset!");
static_assert(offsetof(UBattleText_Sub_C, All_BattleText_Sub) == 0x000478, "Member 'UBattleText_Sub_C::All_BattleText_Sub' has a wrong offset!");
static_assert(offsetof(UBattleText_Sub_C, All_Nut_BattleText_Sub) == 0x000480, "Member 'UBattleText_Sub_C::All_Nut_BattleText_Sub' has a wrong offset!");
static_assert(offsetof(UBattleText_Sub_C, Img_Effect_03) == 0x000488, "Member 'UBattleText_Sub_C::Img_Effect_03' has a wrong offset!");
static_assert(offsetof(UBattleText_Sub_C, Pnl_BattleText_Sub) == 0x000490, "Member 'UBattleText_Sub_C::Pnl_BattleText_Sub' has a wrong offset!");
static_assert(offsetof(UBattleText_Sub_C, Txt_Sub) == 0x000498, "Member 'UBattleText_Sub_C::Txt_Sub' has a wrong offset!");

}

