#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleSetting_List2

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleSetting_List2.BattleSetting_List2_C
// 0x0048 (0x0460 - 0x0418)
class UBattleSetting_List2_C final : public UEndBattleSettingLimitList
{
public:
	class UWidgetAnimation*                       Type;                                              // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Limit;                                             // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_1;                                              // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_01;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow2;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TipsBase;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleSetting_List2_C">();
	}
	static class UBattleSetting_List2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleSetting_List2_C>();
	}
};
static_assert(alignof(UBattleSetting_List2_C) == 0x000008, "Wrong alignment on UBattleSetting_List2_C");
static_assert(sizeof(UBattleSetting_List2_C) == 0x000460, "Wrong size on UBattleSetting_List2_C");
static_assert(offsetof(UBattleSetting_List2_C, Type) == 0x000418, "Member 'UBattleSetting_List2_C::Type' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List2_C, Limit) == 0x000420, "Member 'UBattleSetting_List2_C::Limit' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List2_C, Bg) == 0x000428, "Member 'UBattleSetting_List2_C::Bg' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List2_C, Bg_1) == 0x000430, "Member 'UBattleSetting_List2_C::Bg_1' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List2_C, EndImage) == 0x000438, "Member 'UBattleSetting_List2_C::EndImage' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List2_C, Line_01) == 0x000440, "Member 'UBattleSetting_List2_C::Line_01' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List2_C, ListBg2) == 0x000448, "Member 'UBattleSetting_List2_C::ListBg2' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List2_C, Shadow2) == 0x000450, "Member 'UBattleSetting_List2_C::Shadow2' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List2_C, TipsBase) == 0x000458, "Member 'UBattleSetting_List2_C::TipsBase' has a wrong offset!");

}

