#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleTalk_Cloud

#include "Basic.hpp"

#include "EndDataObject_structs.hpp"


namespace SDK::Params
{

// Function BattleTalk_Cloud.BattleTalk_Cloud_C.OnNotifyWithAbility
// 0x0058 (0x0058 - 0x0000)
struct BattleTalk_Cloud_C_OnNotifyWithAbility final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SoundName;                                         // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          OwnerChara;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          targetChara;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AbilityId;                                         // 0x0020(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndDataObjectBattleAbilityAccessor    dataObjectBattleAbility;                           // 0x0028(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          bFinishBlow;                                       // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0049(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnNotifyWithAbility_ReturnValue;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetCommandType_ReturnValue;               // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTalk_Cloud_C_OnNotifyWithAbility) == 0x000008, "Wrong alignment on BattleTalk_Cloud_C_OnNotifyWithAbility");
static_assert(sizeof(BattleTalk_Cloud_C_OnNotifyWithAbility) == 0x000058, "Wrong size on BattleTalk_Cloud_C_OnNotifyWithAbility");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotifyWithAbility, AnimName) == 0x000000, "Member 'BattleTalk_Cloud_C_OnNotifyWithAbility::AnimName' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotifyWithAbility, SoundName) == 0x000008, "Member 'BattleTalk_Cloud_C_OnNotifyWithAbility::SoundName' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotifyWithAbility, OwnerChara) == 0x000010, "Member 'BattleTalk_Cloud_C_OnNotifyWithAbility::OwnerChara' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotifyWithAbility, targetChara) == 0x000018, "Member 'BattleTalk_Cloud_C_OnNotifyWithAbility::targetChara' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotifyWithAbility, AbilityId) == 0x000020, "Member 'BattleTalk_Cloud_C_OnNotifyWithAbility::AbilityId' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotifyWithAbility, dataObjectBattleAbility) == 0x000028, "Member 'BattleTalk_Cloud_C_OnNotifyWithAbility::dataObjectBattleAbility' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotifyWithAbility, bFinishBlow) == 0x000048, "Member 'BattleTalk_Cloud_C_OnNotifyWithAbility::bFinishBlow' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotifyWithAbility, ReturnValue) == 0x000049, "Member 'BattleTalk_Cloud_C_OnNotifyWithAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotifyWithAbility, CallFunc_OnNotifyWithAbility_ReturnValue) == 0x00004A, "Member 'BattleTalk_Cloud_C_OnNotifyWithAbility::CallFunc_OnNotifyWithAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotifyWithAbility, CallFunc_GetCommandType_ReturnValue) == 0x00004B, "Member 'BattleTalk_Cloud_C_OnNotifyWithAbility::CallFunc_GetCommandType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotifyWithAbility, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00004C, "Member 'BattleTalk_Cloud_C_OnNotifyWithAbility::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotifyWithAbility, K2Node_SwitchName_CmpSuccess) == 0x000050, "Member 'BattleTalk_Cloud_C_OnNotifyWithAbility::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotifyWithAbility, K2Node_SwitchInteger_CmpSuccess) == 0x000051, "Member 'BattleTalk_Cloud_C_OnNotifyWithAbility::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BattleTalk_Cloud.BattleTalk_Cloud_C.OnNotify
// 0x0020 (0x0020 - 0x0000)
struct BattleTalk_Cloud_C_OnNotify final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SoundName;                                         // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          OwnerChara;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnNotify_ReturnValue;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDodgeResetUniqueAbility_ReturnValue;    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTalk_Cloud_C_OnNotify) == 0x000008, "Wrong alignment on BattleTalk_Cloud_C_OnNotify");
static_assert(sizeof(BattleTalk_Cloud_C_OnNotify) == 0x000020, "Wrong size on BattleTalk_Cloud_C_OnNotify");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotify, AnimName) == 0x000000, "Member 'BattleTalk_Cloud_C_OnNotify::AnimName' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotify, SoundName) == 0x000008, "Member 'BattleTalk_Cloud_C_OnNotify::SoundName' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotify, OwnerChara) == 0x000010, "Member 'BattleTalk_Cloud_C_OnNotify::OwnerChara' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotify, ReturnValue) == 0x000018, "Member 'BattleTalk_Cloud_C_OnNotify::ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotify, CallFunc_OnNotify_ReturnValue) == 0x000019, "Member 'BattleTalk_Cloud_C_OnNotify::CallFunc_OnNotify_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotify, CallFunc_IsDodgeResetUniqueAbility_ReturnValue) == 0x00001A, "Member 'BattleTalk_Cloud_C_OnNotify::CallFunc_IsDodgeResetUniqueAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Cloud_C_OnNotify, K2Node_SwitchName_CmpSuccess) == 0x00001B, "Member 'BattleTalk_Cloud_C_OnNotify::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

}

