#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleText_01

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleText_01.BattleText_01_C
// 0x00B0 (0x0818 - 0x0768)
class UBattleText_01_C final : public UEndPopupMessage
{
public:
	class UWidgetAnimation*                       Learning_In;                                       // 0x0768(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Materia_In;                                        // 0x0770(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Weapon_In;                                         // 0x0778(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0780(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_BattleText_01;                                 // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Base;                                          // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Base_Shadow;                                   // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Add;                                    // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Learning;                               // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Learning_1;                             // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Level;                                  // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Level_1;                                // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Materia;                                // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Materia_1;                              // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Effect_Particle;                               // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Weapon;                                 // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Weapon_1;                               // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Light_00;                                      // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Light_01;                                      // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             Nut_Txt;                                           // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_LevelUp;                                       // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleText_01_C">();
	}
	static class UBattleText_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleText_01_C>();
	}
};
static_assert(alignof(UBattleText_01_C) == 0x000008, "Wrong alignment on UBattleText_01_C");
static_assert(sizeof(UBattleText_01_C) == 0x000818, "Wrong size on UBattleText_01_C");
static_assert(offsetof(UBattleText_01_C, Learning_In) == 0x000768, "Member 'UBattleText_01_C::Learning_In' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Materia_In) == 0x000770, "Member 'UBattleText_01_C::Materia_In' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Weapon_In) == 0x000778, "Member 'UBattleText_01_C::Weapon_In' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, In) == 0x000780, "Member 'UBattleText_01_C::In' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, All_BattleText_01) == 0x000788, "Member 'UBattleText_01_C::All_BattleText_01' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Img_Base) == 0x000790, "Member 'UBattleText_01_C::Img_Base' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Img_Base_Shadow) == 0x000798, "Member 'UBattleText_01_C::Img_Base_Shadow' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Img_Effect_01) == 0x0007A0, "Member 'UBattleText_01_C::Img_Effect_01' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Img_Effect_Add) == 0x0007A8, "Member 'UBattleText_01_C::Img_Effect_Add' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Img_Effect_Learning) == 0x0007B0, "Member 'UBattleText_01_C::Img_Effect_Learning' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Img_Effect_Learning_1) == 0x0007B8, "Member 'UBattleText_01_C::Img_Effect_Learning_1' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Img_Effect_Level) == 0x0007C0, "Member 'UBattleText_01_C::Img_Effect_Level' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Img_Effect_Level_1) == 0x0007C8, "Member 'UBattleText_01_C::Img_Effect_Level_1' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Img_Effect_Materia) == 0x0007D0, "Member 'UBattleText_01_C::Img_Effect_Materia' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Img_Effect_Materia_1) == 0x0007D8, "Member 'UBattleText_01_C::Img_Effect_Materia_1' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Img_Effect_Particle) == 0x0007E0, "Member 'UBattleText_01_C::Img_Effect_Particle' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Img_Effect_Weapon) == 0x0007E8, "Member 'UBattleText_01_C::Img_Effect_Weapon' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Img_Effect_Weapon_1) == 0x0007F0, "Member 'UBattleText_01_C::Img_Effect_Weapon_1' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Img_Light_00) == 0x0007F8, "Member 'UBattleText_01_C::Img_Light_00' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Img_Light_01) == 0x000800, "Member 'UBattleText_01_C::Img_Light_01' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Nut_Txt) == 0x000808, "Member 'UBattleText_01_C::Nut_Txt' has a wrong offset!");
static_assert(offsetof(UBattleText_01_C, Txt_LevelUp) == 0x000810, "Member 'UBattleText_01_C::Txt_LevelUp' has a wrong offset!");

}

