#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleTutorial

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleTutorial.BattleTutorial_C
// 0x0038 (0x0400 - 0x03C8)
class UBattleTutorial_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_BattleTutorial;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             Nut_Guidline;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_BattleTutorial;                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Guidline;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleTutorial_C">();
	}
	static class UBattleTutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleTutorial_C>();
	}
};
static_assert(alignof(UBattleTutorial_C) == 0x000008, "Wrong alignment on UBattleTutorial_C");
static_assert(sizeof(UBattleTutorial_C) == 0x000400, "Wrong size on UBattleTutorial_C");
static_assert(offsetof(UBattleTutorial_C, Out) == 0x0003C8, "Member 'UBattleTutorial_C::Out' has a wrong offset!");
static_assert(offsetof(UBattleTutorial_C, In) == 0x0003D0, "Member 'UBattleTutorial_C::In' has a wrong offset!");
static_assert(offsetof(UBattleTutorial_C, All_BattleTutorial) == 0x0003D8, "Member 'UBattleTutorial_C::All_BattleTutorial' has a wrong offset!");
static_assert(offsetof(UBattleTutorial_C, Img_Line) == 0x0003E0, "Member 'UBattleTutorial_C::Img_Line' has a wrong offset!");
static_assert(offsetof(UBattleTutorial_C, Nut_Guidline) == 0x0003E8, "Member 'UBattleTutorial_C::Nut_Guidline' has a wrong offset!");
static_assert(offsetof(UBattleTutorial_C, Pnl_BattleTutorial) == 0x0003F0, "Member 'UBattleTutorial_C::Pnl_BattleTutorial' has a wrong offset!");
static_assert(offsetof(UBattleTutorial_C, Txt_Guidline) == 0x0003F8, "Member 'UBattleTutorial_C::Txt_Guidline' has a wrong offset!");

}

