#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleSetting_List1

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleSetting_List1.BattleSetting_List1_C
// 0x00A8 (0x04B8 - 0x0410)
class UBattleSetting_List1_C final : public UEndBattleSettingItemList
{
public:
	class UWidgetAnimation*                       List;                                              // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Category;                                          // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_1;                                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_4;                                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_5;                                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_6;                                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_7;                                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2;                                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2_1;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_9;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_10;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_11;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_12;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_13;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_14;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_15;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_16;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_17;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow2;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleSetting_List1_C">();
	}
	static class UBattleSetting_List1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleSetting_List1_C>();
	}
};
static_assert(alignof(UBattleSetting_List1_C) == 0x000008, "Wrong alignment on UBattleSetting_List1_C");
static_assert(sizeof(UBattleSetting_List1_C) == 0x0004B8, "Wrong size on UBattleSetting_List1_C");
static_assert(offsetof(UBattleSetting_List1_C, List) == 0x000410, "Member 'UBattleSetting_List1_C::List' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, Category) == 0x000418, "Member 'UBattleSetting_List1_C::Category' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, Bg) == 0x000420, "Member 'UBattleSetting_List1_C::Bg' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, Bg_1) == 0x000428, "Member 'UBattleSetting_List1_C::Bg_1' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, Bg2_4) == 0x000430, "Member 'UBattleSetting_List1_C::Bg2_4' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, Bg2_5) == 0x000438, "Member 'UBattleSetting_List1_C::Bg2_5' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, Bg2_6) == 0x000440, "Member 'UBattleSetting_List1_C::Bg2_6' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, Bg2_7) == 0x000448, "Member 'UBattleSetting_List1_C::Bg2_7' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, EndImage) == 0x000450, "Member 'UBattleSetting_List1_C::EndImage' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, ListBg2) == 0x000458, "Member 'UBattleSetting_List1_C::ListBg2' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, ListBg2_1) == 0x000460, "Member 'UBattleSetting_List1_C::ListBg2_1' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, ListPoint_9) == 0x000468, "Member 'UBattleSetting_List1_C::ListPoint_9' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, ListPoint_10) == 0x000470, "Member 'UBattleSetting_List1_C::ListPoint_10' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, ListPoint_11) == 0x000478, "Member 'UBattleSetting_List1_C::ListPoint_11' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, ListPoint_12) == 0x000480, "Member 'UBattleSetting_List1_C::ListPoint_12' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, ListPoint_13) == 0x000488, "Member 'UBattleSetting_List1_C::ListPoint_13' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, ListPoint_14) == 0x000490, "Member 'UBattleSetting_List1_C::ListPoint_14' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, ListPoint_15) == 0x000498, "Member 'UBattleSetting_List1_C::ListPoint_15' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, ListPoint_16) == 0x0004A0, "Member 'UBattleSetting_List1_C::ListPoint_16' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, ListPoint_17) == 0x0004A8, "Member 'UBattleSetting_List1_C::ListPoint_17' has a wrong offset!");
static_assert(offsetof(UBattleSetting_List1_C, Shadow2) == 0x0004B0, "Member 'UBattleSetting_List1_C::Shadow2' has a wrong offset!");

}

