#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleSetting

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleSetting.BattleSetting_C
// 0x0098 (0x07C0 - 0x0728)
class UBattleSetting_C final : public UEndBattleSettingWindow
{
public:
	class UWidgetAnimation*                       ChainAction_In;                                    // 0x0728(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Limit_Decide;                                      // 0x0730(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       List_Decide;                                       // 0x0738(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       List_In2;                                          // 0x0740(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LimitType_In;                                      // 0x0748(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Category_In;                                       // 0x0750(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus_Change;                                      // 0x0758(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       List_In;                                           // 0x0760(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0768(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light_Circle;                                  // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light_Cross;                                   // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light_L1;                                      // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light_R1;                                      // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light_Square;                                  // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light_Triangle;                                // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            CategoryTitle_Member_Bg;                           // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Controller;                                    // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgLeft_C*              System_BgLeft;                                     // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgRight_C*             System_BgRight;                                    // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleSetting_C">();
	}
	static class UBattleSetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleSetting_C>();
	}
};
static_assert(alignof(UBattleSetting_C) == 0x000008, "Wrong alignment on UBattleSetting_C");
static_assert(sizeof(UBattleSetting_C) == 0x0007C0, "Wrong size on UBattleSetting_C");
static_assert(offsetof(UBattleSetting_C, ChainAction_In) == 0x000728, "Member 'UBattleSetting_C::ChainAction_In' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, Limit_Decide) == 0x000730, "Member 'UBattleSetting_C::Limit_Decide' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, List_Decide) == 0x000738, "Member 'UBattleSetting_C::List_Decide' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, List_In2) == 0x000740, "Member 'UBattleSetting_C::List_In2' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, LimitType_In) == 0x000748, "Member 'UBattleSetting_C::LimitType_In' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, Category_In) == 0x000750, "Member 'UBattleSetting_C::Category_In' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, Focus_Change) == 0x000758, "Member 'UBattleSetting_C::Focus_Change' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, List_In) == 0x000760, "Member 'UBattleSetting_C::List_In' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, In) == 0x000768, "Member 'UBattleSetting_C::In' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, Btn_Light_Circle) == 0x000770, "Member 'UBattleSetting_C::Btn_Light_Circle' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, Btn_Light_Cross) == 0x000778, "Member 'UBattleSetting_C::Btn_Light_Cross' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, Btn_Light_L1) == 0x000780, "Member 'UBattleSetting_C::Btn_Light_L1' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, Btn_Light_R1) == 0x000788, "Member 'UBattleSetting_C::Btn_Light_R1' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, Btn_Light_Square) == 0x000790, "Member 'UBattleSetting_C::Btn_Light_Square' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, Btn_Light_Triangle) == 0x000798, "Member 'UBattleSetting_C::Btn_Light_Triangle' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, CategoryTitle_Member_Bg) == 0x0007A0, "Member 'UBattleSetting_C::CategoryTitle_Member_Bg' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, Img_Controller) == 0x0007A8, "Member 'UBattleSetting_C::Img_Controller' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, System_BgLeft) == 0x0007B0, "Member 'UBattleSetting_C::System_BgLeft' has a wrong offset!");
static_assert(offsetof(UBattleSetting_C, System_BgRight) == 0x0007B8, "Member 'UBattleSetting_C::System_BgRight' has a wrong offset!");

}

