#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleSimulator_Prize

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleSimulator_Prize.BattleSimulator_Prize_C
// 0x0020 (0x03E8 - 0x03C8)
class UBattleSimulator_Prize_C final : public UEndUserWidget
{
public:
	class UIcon_Item_C*                           Icon_Item;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_X_G1;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ItemName_G1;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ItemNum_G1;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleSimulator_Prize_C">();
	}
	static class UBattleSimulator_Prize_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleSimulator_Prize_C>();
	}
};
static_assert(alignof(UBattleSimulator_Prize_C) == 0x000008, "Wrong alignment on UBattleSimulator_Prize_C");
static_assert(sizeof(UBattleSimulator_Prize_C) == 0x0003E8, "Wrong size on UBattleSimulator_Prize_C");
static_assert(offsetof(UBattleSimulator_Prize_C, Icon_Item) == 0x0003C8, "Member 'UBattleSimulator_Prize_C::Icon_Item' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Prize_C, Icon_X_G1) == 0x0003D0, "Member 'UBattleSimulator_Prize_C::Icon_X_G1' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Prize_C, Txt_ItemName_G1) == 0x0003D8, "Member 'UBattleSimulator_Prize_C::Txt_ItemName_G1' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Prize_C, Txt_ItemNum_G1) == 0x0003E0, "Member 'UBattleSimulator_Prize_C::Txt_ItemNum_G1' has a wrong offset!");

}

