#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleSimulator_Btn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleSimulator_Btn.BattleSimulator_Btn_C
// 0x0080 (0x0478 - 0x03F8)
class UBattleSimulator_Btn_C final : public UEndResearchTargetBtn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Clear;                                             // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Locked;                                            // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Released;                                          // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_2;                                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_1;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_L;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_R;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame_1;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame_2;                                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon;                                              // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Lock;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Target_Btn;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BattleSimulator_Btn(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleSimulator_Btn_C">();
	}
	static class UBattleSimulator_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleSimulator_Btn_C>();
	}
};
static_assert(alignof(UBattleSimulator_Btn_C) == 0x000008, "Wrong alignment on UBattleSimulator_Btn_C");
static_assert(sizeof(UBattleSimulator_Btn_C) == 0x000478, "Wrong size on UBattleSimulator_Btn_C");
static_assert(offsetof(UBattleSimulator_Btn_C, UberGraphFrame) == 0x0003F8, "Member 'UBattleSimulator_Btn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Btn_C, Loop) == 0x000400, "Member 'UBattleSimulator_Btn_C::Loop' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Btn_C, Clear) == 0x000408, "Member 'UBattleSimulator_Btn_C::Clear' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Btn_C, Locked) == 0x000410, "Member 'UBattleSimulator_Btn_C::Locked' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Btn_C, Released) == 0x000418, "Member 'UBattleSimulator_Btn_C::Released' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Btn_C, BtnHover) == 0x000420, "Member 'UBattleSimulator_Btn_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Btn_C, Base) == 0x000428, "Member 'UBattleSimulator_Btn_C::Base' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Btn_C, Base_2) == 0x000430, "Member 'UBattleSimulator_Btn_C::Base_2' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Btn_C, Cursor_1) == 0x000438, "Member 'UBattleSimulator_Btn_C::Cursor_1' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Btn_C, Cursor_L) == 0x000440, "Member 'UBattleSimulator_Btn_C::Cursor_L' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Btn_C, Cursor_R) == 0x000448, "Member 'UBattleSimulator_Btn_C::Cursor_R' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Btn_C, Frame_1) == 0x000450, "Member 'UBattleSimulator_Btn_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Btn_C, Frame_2) == 0x000458, "Member 'UBattleSimulator_Btn_C::Frame_2' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Btn_C, Icon) == 0x000460, "Member 'UBattleSimulator_Btn_C::Icon' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Btn_C, Icon_Lock) == 0x000468, "Member 'UBattleSimulator_Btn_C::Icon_Lock' has a wrong offset!");
static_assert(offsetof(UBattleSimulator_Btn_C, Target_Btn) == 0x000470, "Member 'UBattleSimulator_Btn_C::Target_Btn' has a wrong offset!");

}

