#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleText_Number

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleText_Number.BattleText_Number_C
// 0x0038 (0x0400 - 0x03C8)
class UBattleText_Number_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Summon_Loop;                                       // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Continued_In;                                      // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Burst_In;                                          // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal_Out;                                        // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal_In;                                         // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndNumberLabel*                        Number;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleText_Number_C">();
	}
	static class UBattleText_Number_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleText_Number_C>();
	}
};
static_assert(alignof(UBattleText_Number_C) == 0x000008, "Wrong alignment on UBattleText_Number_C");
static_assert(sizeof(UBattleText_Number_C) == 0x000400, "Wrong size on UBattleText_Number_C");
static_assert(offsetof(UBattleText_Number_C, Summon_Loop) == 0x0003C8, "Member 'UBattleText_Number_C::Summon_Loop' has a wrong offset!");
static_assert(offsetof(UBattleText_Number_C, Continued_In) == 0x0003D0, "Member 'UBattleText_Number_C::Continued_In' has a wrong offset!");
static_assert(offsetof(UBattleText_Number_C, Burst_In) == 0x0003D8, "Member 'UBattleText_Number_C::Burst_In' has a wrong offset!");
static_assert(offsetof(UBattleText_Number_C, Normal_Out) == 0x0003E0, "Member 'UBattleText_Number_C::Normal_Out' has a wrong offset!");
static_assert(offsetof(UBattleText_Number_C, Loop) == 0x0003E8, "Member 'UBattleText_Number_C::Loop' has a wrong offset!");
static_assert(offsetof(UBattleText_Number_C, Normal_In) == 0x0003F0, "Member 'UBattleText_Number_C::Normal_In' has a wrong offset!");
static_assert(offsetof(UBattleText_Number_C, Number) == 0x0003F8, "Member 'UBattleText_Number_C::Number' has a wrong offset!");

}

