#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BG1106_00_Bridge_NIBLM_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BG1106_00_Bridge_NIBLM_Animation.BG1106_00_Bridge_NIBLM_Animation_C
// 0x03C0 (0x0BB0 - 0x07F0)
class UBG1106_00_Bridge_NIBLM_Animation_C final : public UEndSkeletalMeshActorAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x07F8(0x0030)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x0828(0x0368)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0B90(0x0018)()

public:
	void ExecuteUbergraph_BG1106_00_Bridge_NIBLM_Animation(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BG1106_00_Bridge_NIBLM_Animation_C">();
	}
	static class UBG1106_00_Bridge_NIBLM_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBG1106_00_Bridge_NIBLM_Animation_C>();
	}
};
static_assert(alignof(UBG1106_00_Bridge_NIBLM_Animation_C) == 0x000010, "Wrong alignment on UBG1106_00_Bridge_NIBLM_Animation_C");
static_assert(sizeof(UBG1106_00_Bridge_NIBLM_Animation_C) == 0x000BB0, "Wrong size on UBG1106_00_Bridge_NIBLM_Animation_C");
static_assert(offsetof(UBG1106_00_Bridge_NIBLM_Animation_C, UberGraphFrame) == 0x0007F0, "Member 'UBG1106_00_Bridge_NIBLM_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBG1106_00_Bridge_NIBLM_Animation_C, AnimGraphNode_Root) == 0x0007F8, "Member 'UBG1106_00_Bridge_NIBLM_Animation_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBG1106_00_Bridge_NIBLM_Animation_C, AnimGraphNode_ControlRig) == 0x000828, "Member 'UBG1106_00_Bridge_NIBLM_Animation_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UBG1106_00_Bridge_NIBLM_Animation_C, AnimGraphNode_LocalRefPose) == 0x000B90, "Member 'UBG1106_00_Bridge_NIBLM_Animation_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

