#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BinkMediaPlayer

#include "Basic.hpp"

#include "BinkMediaPlayer_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class BinkMediaPlayer.BinkFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBinkFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void Bink_DrawOverlays();
	static struct FTimespan BinkLoadingMovie_GetDuration();
	static struct FTimespan BinkLoadingMovie_GetTime();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BinkFunctionLibrary">();
	}
	static class UBinkFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkFunctionLibrary>();
	}
};
static_assert(alignof(UBinkFunctionLibrary) == 0x000008, "Wrong alignment on UBinkFunctionLibrary");
static_assert(sizeof(UBinkFunctionLibrary) == 0x000028, "Wrong size on UBinkFunctionLibrary");

// Class BinkMediaPlayer.BinkMediaPlayer
// 0x0128 (0x0150 - 0x0028)
class UBinkMediaPlayer final : public UObject
{
public:
	uint8                                         Pad_28[0x60];                                      // 0x0028(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         Looping : 1;                                       // 0x0088(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         StartImmediately : 1;                              // 0x0088(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         DelayedOpen : 1;                                   // 0x0088(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              BinkDestinationUpperLeft;                          // 0x008C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BinkDestinationLowerRight;                         // 0x0094(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 URL;                                               // 0x00A0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMediaPlayerBinkBufferModes               BinkBufferMode;                                    // 0x00B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMediaPlayerBinkSoundTrack                BinkSoundTrack;                                    // 0x00B1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BinkSoundTrackStart;                               // 0x00B4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMediaPlayerBinkDrawStyle                 BinkDrawStyle;                                     // 0x00B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BinkLayerDepth;                                    // 0x00BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaPlaylist*                         Playlist;                                          // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x88];                                      // 0x00C8(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseUrl();
	void Draw(class UTexture* Texture, bool tonemap, int32 out_nits, float Alpha, bool srgb_decode, bool hdr);
	bool OpenUrl(const class FString& NewUrl);
	bool Pause();
	bool Play();
	bool Rewind();
	bool Seek(const struct FTimespan& InTime);
	bool SetLooping(bool InLooping);
	bool SetRate(float Rate);
	void SetVolume(float Rate);
	void Stop();

	bool CanPause() const;
	bool CanPlay() const;
	struct FTimespan GetDuration() const;
	float GetRate() const;
	struct FTimespan GetTime() const;
	class FString GetUrl() const;
	bool IsInitialized() const;
	bool IsLooping() const;
	bool IsPaused() const;
	bool IsPlaying() const;
	bool IsStopped() const;
	bool SupportsRate(float Rate, bool Unthinned) const;
	bool SupportsScrubbing() const;
	bool SupportsSeeking() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BinkMediaPlayer">();
	}
	static class UBinkMediaPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkMediaPlayer>();
	}
};
static_assert(alignof(UBinkMediaPlayer) == 0x000008, "Wrong alignment on UBinkMediaPlayer");
static_assert(sizeof(UBinkMediaPlayer) == 0x000150, "Wrong size on UBinkMediaPlayer");
static_assert(offsetof(UBinkMediaPlayer, BinkDestinationUpperLeft) == 0x00008C, "Member 'UBinkMediaPlayer::BinkDestinationUpperLeft' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, BinkDestinationLowerRight) == 0x000094, "Member 'UBinkMediaPlayer::BinkDestinationLowerRight' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, URL) == 0x0000A0, "Member 'UBinkMediaPlayer::URL' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, BinkBufferMode) == 0x0000B0, "Member 'UBinkMediaPlayer::BinkBufferMode' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, BinkSoundTrack) == 0x0000B1, "Member 'UBinkMediaPlayer::BinkSoundTrack' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, BinkSoundTrackStart) == 0x0000B4, "Member 'UBinkMediaPlayer::BinkSoundTrackStart' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, BinkDrawStyle) == 0x0000B8, "Member 'UBinkMediaPlayer::BinkDrawStyle' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, BinkLayerDepth) == 0x0000BC, "Member 'UBinkMediaPlayer::BinkLayerDepth' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, Playlist) == 0x0000C0, "Member 'UBinkMediaPlayer::Playlist' has a wrong offset!");

// Class BinkMediaPlayer.MediaTextureBinkImpl
// 0x0048 (0x0070 - 0x0028)
class UMediaTextureBinkImpl final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ETextureAddress                               AddressX;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressY;                                          // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBinkMediaPlayer*                       MediaPlayer;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          tonemap;                                           // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutputNits;                                        // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DecodeSRGB;                                        // 0x004C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x23];                                      // 0x004D(0x0023)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MediaTextureBinkImpl">();
	}
	static class UMediaTextureBinkImpl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaTextureBinkImpl>();
	}
};
static_assert(alignof(UMediaTextureBinkImpl) == 0x000008, "Wrong alignment on UMediaTextureBinkImpl");
static_assert(sizeof(UMediaTextureBinkImpl) == 0x000070, "Wrong size on UMediaTextureBinkImpl");
static_assert(offsetof(UMediaTextureBinkImpl, AddressX) == 0x000030, "Member 'UMediaTextureBinkImpl::AddressX' has a wrong offset!");
static_assert(offsetof(UMediaTextureBinkImpl, AddressY) == 0x000031, "Member 'UMediaTextureBinkImpl::AddressY' has a wrong offset!");
static_assert(offsetof(UMediaTextureBinkImpl, MediaPlayer) == 0x000038, "Member 'UMediaTextureBinkImpl::MediaPlayer' has a wrong offset!");
static_assert(offsetof(UMediaTextureBinkImpl, tonemap) == 0x000040, "Member 'UMediaTextureBinkImpl::tonemap' has a wrong offset!");
static_assert(offsetof(UMediaTextureBinkImpl, OutputNits) == 0x000044, "Member 'UMediaTextureBinkImpl::OutputNits' has a wrong offset!");
static_assert(offsetof(UMediaTextureBinkImpl, Alpha) == 0x000048, "Member 'UMediaTextureBinkImpl::Alpha' has a wrong offset!");
static_assert(offsetof(UMediaTextureBinkImpl, DecodeSRGB) == 0x00004C, "Member 'UMediaTextureBinkImpl::DecodeSRGB' has a wrong offset!");

// Class BinkMediaPlayer.BinkMoviePlayerSettings
// 0x0020 (0x0048 - 0x0028)
class UBinkMoviePlayerSettings final : public UObject
{
public:
	EBinkMoviePlayerBinkBufferModes               BinkBufferMode;                                    // 0x0028(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMoviePlayerBinkSoundTrack                BinkSoundTrack;                                    // 0x0029(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BinkSoundTrackStart;                               // 0x002C(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BinkDestinationUpperLeft;                          // 0x0030(0x0008)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BinkDestinationLowerRight;                         // 0x0038(0x0008)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPixelFormat                                  BinkPixelFormat;                                   // 0x0040(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BinkMoviePlayerSettings">();
	}
	static class UBinkMoviePlayerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkMoviePlayerSettings>();
	}
};
static_assert(alignof(UBinkMoviePlayerSettings) == 0x000008, "Wrong alignment on UBinkMoviePlayerSettings");
static_assert(sizeof(UBinkMoviePlayerSettings) == 0x000048, "Wrong size on UBinkMoviePlayerSettings");
static_assert(offsetof(UBinkMoviePlayerSettings, BinkBufferMode) == 0x000028, "Member 'UBinkMoviePlayerSettings::BinkBufferMode' has a wrong offset!");
static_assert(offsetof(UBinkMoviePlayerSettings, BinkSoundTrack) == 0x000029, "Member 'UBinkMoviePlayerSettings::BinkSoundTrack' has a wrong offset!");
static_assert(offsetof(UBinkMoviePlayerSettings, BinkSoundTrackStart) == 0x00002C, "Member 'UBinkMoviePlayerSettings::BinkSoundTrackStart' has a wrong offset!");
static_assert(offsetof(UBinkMoviePlayerSettings, BinkDestinationUpperLeft) == 0x000030, "Member 'UBinkMoviePlayerSettings::BinkDestinationUpperLeft' has a wrong offset!");
static_assert(offsetof(UBinkMoviePlayerSettings, BinkDestinationLowerRight) == 0x000038, "Member 'UBinkMoviePlayerSettings::BinkDestinationLowerRight' has a wrong offset!");
static_assert(offsetof(UBinkMoviePlayerSettings, BinkPixelFormat) == 0x000040, "Member 'UBinkMoviePlayerSettings::BinkPixelFormat' has a wrong offset!");

}

