#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BonamikRt

#include "Basic.hpp"

#include "BonamikRt_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_AddReference
// 0x0010 (0x0010 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_AddReference final
{
public:
	class USQEX_Bonamik_Component*                OtherComponent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReferenceGroupName;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_AddReference) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_AddReference");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_AddReference) == 0x000010, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_AddReference");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_AddReference, OtherComponent) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_AddReference::OtherComponent' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_AddReference, ReferenceGroupName) == 0x000008, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_AddReference::ReferenceGroupName' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_AddReferenceCommon
// 0x0008 (0x0008 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_AddReferenceCommon final
{
public:
	class USQEX_Bonamik_Component*                OtherComponent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_AddReferenceCommon) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_AddReferenceCommon");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_AddReferenceCommon) == 0x000008, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_AddReferenceCommon");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_AddReferenceCommon, OtherComponent) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_AddReferenceCommon::OtherComponent' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_Freeze
// 0x0020 (0x0020 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_Freeze final
{
public:
	bool                                          FreezeState;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Groups;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendWeight;                                       // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_Freeze) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_Freeze");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_Freeze) == 0x000020, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_Freeze");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_Freeze, FreezeState) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_Freeze::FreezeState' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_Freeze, Groups) == 0x000008, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_Freeze::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_Freeze, BlendTime) == 0x000018, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_Freeze::BlendTime' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_Freeze, BlendWeight) == 0x00001C, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_Freeze::BlendWeight' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_GetTeleportDistance
// 0x0004 (0x0004 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_GetTeleportDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_GetTeleportDistance) == 0x000004, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_GetTeleportDistance");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_GetTeleportDistance) == 0x000004, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_GetTeleportDistance");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_GetTeleportDistance, ReturnValue) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_GetTeleportDistance::ReturnValue' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_GetWeight
// 0x0004 (0x0004 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_GetWeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_GetWeight) == 0x000004, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_GetWeight");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_GetWeight) == 0x000004, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_GetWeight");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_GetWeight, ReturnValue) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_GetWeight::ReturnValue' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_IsAutoDisable
// 0x0001 (0x0001 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_IsAutoDisable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_IsAutoDisable) == 0x000001, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_IsAutoDisable");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_IsAutoDisable) == 0x000001, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_IsAutoDisable");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_IsAutoDisable, ReturnValue) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_IsAutoDisable::ReturnValue' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_IsEnable
// 0x0001 (0x0001 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_IsEnable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_IsEnable) == 0x000001, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_IsEnable");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_IsEnable) == 0x000001, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_IsEnable");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_IsEnable, ReturnValue) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_IsEnable::ReturnValue' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_IsSetup
// 0x0001 (0x0001 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_IsSetup final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_IsSetup) == 0x000001, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_IsSetup");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_IsSetup) == 0x000001, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_IsSetup");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_IsSetup, ReturnValue) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_IsSetup::ReturnValue' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_RemoveReference
// 0x0010 (0x0010 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReference final
{
public:
	class USQEX_Bonamik_Component*                OtherComponent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReferenceGroupName;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReference) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReference");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReference) == 0x000010, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReference");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReference, OtherComponent) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReference::OtherComponent' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReference, ReferenceGroupName) == 0x000008, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReference::ReferenceGroupName' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_RemoveReferenceCommon
// 0x0008 (0x0008 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReferenceCommon final
{
public:
	class USQEX_Bonamik_Component*                OtherComponent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReferenceCommon) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReferenceCommon");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReferenceCommon) == 0x000008, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReferenceCommon");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReferenceCommon, OtherComponent) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_RemoveReferenceCommon::OtherComponent' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_ReplaceAsset
// 0x0010 (0x0010 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_ReplaceAsset final
{
public:
	class USQEX_BonamikAsset*                     originalAsset;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USQEX_BonamikAsset*                     NewAsset;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_ReplaceAsset) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_ReplaceAsset");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_ReplaceAsset) == 0x000010, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_ReplaceAsset");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_ReplaceAsset, originalAsset) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_ReplaceAsset::originalAsset' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_ReplaceAsset, NewAsset) == 0x000008, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_ReplaceAsset::NewAsset' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_Reset
// 0x0002 (0x0002 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_Reset final
{
public:
	bool                                          bResetPose;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_Reset) == 0x000001, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_Reset");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_Reset) == 0x000002, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_Reset");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_Reset, bResetPose) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_Reset::bResetPose' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_Reset, PropagationMode) == 0x000001, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_Reset::PropagationMode' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetAccurateGroundCollisionAll
// 0x0001 (0x0001 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetAccurateGroundCollisionAll final
{
public:
	bool                                          V;                                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetAccurateGroundCollisionAll) == 0x000001, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetAccurateGroundCollisionAll");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetAccurateGroundCollisionAll) == 0x000001, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetAccurateGroundCollisionAll");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetAccurateGroundCollisionAll, V) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetAccurateGroundCollisionAll::V' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetActorCentrifugalScale
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetActorCentrifugalScale final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorCentrifugalScale) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetActorCentrifugalScale");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorCentrifugalScale) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetActorCentrifugalScale");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorCentrifugalScale, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetActorCentrifugalScale::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorCentrifugalScale, Scale) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetActorCentrifugalScale::Scale' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorCentrifugalScale, PropagationMode) == 0x000014, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetActorCentrifugalScale::PropagationMode' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetActorImpulseScale
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetActorImpulseScale final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorImpulseScale) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetActorImpulseScale");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorImpulseScale) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetActorImpulseScale");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorImpulseScale, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetActorImpulseScale::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorImpulseScale, Scale) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetActorImpulseScale::Scale' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorImpulseScale, PropagationMode) == 0x000014, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetActorImpulseScale::PropagationMode' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetActorRotDragScale
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetActorRotDragScale final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorRotDragScale) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetActorRotDragScale");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorRotDragScale) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetActorRotDragScale");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorRotDragScale, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetActorRotDragScale::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorRotDragScale, Scale) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetActorRotDragScale::Scale' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorRotDragScale, PropagationMode) == 0x000014, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetActorRotDragScale::PropagationMode' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetActorTransDragScale
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetActorTransDragScale final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorTransDragScale) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetActorTransDragScale");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorTransDragScale) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetActorTransDragScale");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorTransDragScale, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetActorTransDragScale::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorTransDragScale, Scale) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetActorTransDragScale::Scale' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetActorTransDragScale, PropagationMode) == 0x000014, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetActorTransDragScale::PropagationMode' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetAnimPos
// 0x0008 (0x0008 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetAnimPos final
{
public:
	int32                                         BoneIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceSet;                                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetAnimPos) == 0x000004, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetAnimPos");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetAnimPos) == 0x000008, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetAnimPos");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetAnimPos, BoneIndex) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetAnimPos::BoneIndex' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetAnimPos, bForceSet) == 0x000004, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetAnimPos::bForceSet' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetAutoDisable
// 0x0001 (0x0001 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetAutoDisable final
{
public:
	bool                                          AutoDisable;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetAutoDisable) == 0x000001, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetAutoDisable");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetAutoDisable) == 0x000001, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetAutoDisable");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetAutoDisable, AutoDisable) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetAutoDisable::AutoDisable' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetBodyDragScale
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyDragScale final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyDragScale) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyDragScale");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyDragScale) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyDragScale");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyDragScale, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyDragScale::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyDragScale, Scale) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyDragScale::Scale' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyDragScale, PropagationMode) == 0x000014, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyDragScale::PropagationMode' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetBodyLiftScale
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyLiftScale final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyLiftScale) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyLiftScale");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyLiftScale) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyLiftScale");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyLiftScale, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyLiftScale::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyLiftScale, Scale) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyLiftScale::Scale' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyLiftScale, PropagationMode) == 0x000014, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetBodyLiftScale::PropagationMode' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetChainRootCentrifugalScale
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootCentrifugalScale final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootCentrifugalScale) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootCentrifugalScale");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootCentrifugalScale) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootCentrifugalScale");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootCentrifugalScale, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootCentrifugalScale::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootCentrifugalScale, Scale) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootCentrifugalScale::Scale' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootCentrifugalScale, PropagationMode) == 0x000014, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootCentrifugalScale::PropagationMode' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetChainRootImpulseScale
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootImpulseScale final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootImpulseScale) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootImpulseScale");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootImpulseScale) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootImpulseScale");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootImpulseScale, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootImpulseScale::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootImpulseScale, Scale) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootImpulseScale::Scale' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootImpulseScale, PropagationMode) == 0x000014, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootImpulseScale::PropagationMode' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetChainRootRotDragScale
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootRotDragScale final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootRotDragScale) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootRotDragScale");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootRotDragScale) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootRotDragScale");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootRotDragScale, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootRotDragScale::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootRotDragScale, Scale) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootRotDragScale::Scale' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootRotDragScale, PropagationMode) == 0x000014, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootRotDragScale::PropagationMode' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetChainRootTransDragScale
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootTransDragScale final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootTransDragScale) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootTransDragScale");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootTransDragScale) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootTransDragScale");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootTransDragScale, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootTransDragScale::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootTransDragScale, Scale) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootTransDragScale::Scale' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootTransDragScale, PropagationMode) == 0x000014, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetChainRootTransDragScale::PropagationMode' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetEnable
// 0x0001 (0x0001 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetEnable final
{
public:
	bool                                          NewEnable;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnable) == 0x000001, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetEnable");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnable) == 0x000001, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetEnable");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnable, NewEnable) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetEnable::NewEnable' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetEnableExternalColliders
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableExternalColliders final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          V;                                                 // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableExternalColliders) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableExternalColliders");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableExternalColliders) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableExternalColliders");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableExternalColliders, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableExternalColliders::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableExternalColliders, V) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableExternalColliders::V' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetEnableGameWind
// 0x0001 (0x0001 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGameWind final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGameWind) == 0x000001, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGameWind");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGameWind) == 0x000001, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGameWind");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGameWind, Enable) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGameWind::Enable' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetEnableGroundCollision
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollision final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bNewEnable;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollision) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollision");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollision) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollision");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollision, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollision::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollision, bNewEnable) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollision::bNewEnable' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetEnableGroundCollisionAll
// 0x0001 (0x0001 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollisionAll final
{
public:
	bool                                          bNewEnable;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollisionAll) == 0x000001, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollisionAll");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollisionAll) == 0x000001, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollisionAll");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollisionAll, bNewEnable) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableGroundCollisionAll::bNewEnable' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetEnableTimestepSmoother
// 0x0001 (0x0001 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableTimestepSmoother final
{
public:
	bool                                          V;                                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableTimestepSmoother) == 0x000001, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableTimestepSmoother");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableTimestepSmoother) == 0x000001, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableTimestepSmoother");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableTimestepSmoother, V) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetEnableTimestepSmoother::V' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetEnsemble
// 0x0008 (0x0008 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetEnsemble final
{
public:
	class FName                                   NewEnsemble;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnsemble) == 0x000004, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetEnsemble");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnsemble) == 0x000008, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetEnsemble");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetEnsemble, NewEnsemble) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetEnsemble::NewEnsemble' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetFrozenState
// 0x0001 (0x0001 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetFrozenState final
{
public:
	bool                                          IsFrozen;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetFrozenState) == 0x000001, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetFrozenState");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetFrozenState) == 0x000001, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetFrozenState");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetFrozenState, IsFrozen) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetFrozenState::IsFrozen' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetGravity
// 0x000C (0x000C - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetGravity final
{
public:
	struct FVector                                Gravity;                                           // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetGravity) == 0x000004, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetGravity");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetGravity) == 0x00000C, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetGravity");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetGravity, Gravity) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetGravity::Gravity' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetGroupFrozenState
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupFrozenState final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          IsFrozen;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupFrozenState) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupFrozenState");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupFrozenState) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupFrozenState");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupFrozenState, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupFrozenState::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupFrozenState, IsFrozen) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupFrozenState::IsFrozen' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetGroupWeight
// 0x0020 (0x0020 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupWeight final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WeightChangeTime;                                  // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ResetWhenNonZeroWeight;                            // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupWeight) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupWeight");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupWeight) == 0x000020, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupWeight");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupWeight, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupWeight::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupWeight, Weight) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupWeight::Weight' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupWeight, WeightChangeTime) == 0x000014, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupWeight::WeightChangeTime' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupWeight, ResetWhenNonZeroWeight) == 0x000018, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetGroupWeight::ResetWhenNonZeroWeight' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetInnerConeScale
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetInnerConeScale final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetInnerConeScale) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetInnerConeScale");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetInnerConeScale) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetInnerConeScale");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetInnerConeScale, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetInnerConeScale::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetInnerConeScale, Scale) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetInnerConeScale::Scale' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetInnerConeScale, PropagationMode) == 0x000014, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetInnerConeScale::PropagationMode' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetLocalForceScale
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetLocalForceScale final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetLocalForceScale) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetLocalForceScale");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetLocalForceScale) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetLocalForceScale");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetLocalForceScale, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetLocalForceScale::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetLocalForceScale, Scale) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetLocalForceScale::Scale' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetLocalForceScale, PropagationMode) == 0x000014, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetLocalForceScale::PropagationMode' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetMassScale
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetMassScale final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetMassScale) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetMassScale");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetMassScale) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetMassScale");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetMassScale, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetMassScale::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetMassScale, Scale) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetMassScale::Scale' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetMassScale, PropagationMode) == 0x000014, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetMassScale::PropagationMode' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetOuterConeScale
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetOuterConeScale final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetOuterConeScale) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetOuterConeScale");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetOuterConeScale) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetOuterConeScale");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetOuterConeScale, Groups) == 0x000000, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetOuterConeScale::Groups' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetOuterConeScale, Scale) == 0x000010, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetOuterConeScale::Scale' has a wrong offset!");
static_assert(offsetof(SQEX_Bonamik_Component_SQEX_Bonamik_SetOuterConeScale, PropagationMode) == 0x000014, "Member 'SQEX_Bonamik_Component_SQEX_Bonamik_SetOuterConeScale::PropagationMode' has a wrong offset!");

// Function BonamikRt.SQEX_Bonamik_Component.SQEX_Bonamik_SetParkRateScale
// 0x0018 (0x0018 - 0x0000)
struct SQEX_Bonamik_Component_SQEX_Bonamik_SetParkRateScale final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PropagationMode                 PropagationMode;                                   // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEX_Bonamik_Component_SQEX_Bonamik_SetParkRateScale) == 0x000008, "Wrong alignment on SQEX_Bonamik_Component_SQEX_Bonamik_SetParkRateScale");
static_assert(sizeof(SQEX_Bonamik_Component_SQEX_Bonamik_SetParkRateScale) == 0x000018, "Wrong size on SQEX_Bonamik_Component_SQEX_Bonamik_SetParkRateScale");
