#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BonamikRt

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum BonamikRt.ESQEX_Bonamik_ControlType
// NumValues: 0x0004
enum class ESQEX_Bonamik_ControlType : uint8
{
	ESQEX_Bonamik_ControlType_DoNothing      = 0,
	ESQEX_Bonamik_ControlType_On             = 1,
	ESQEX_Bonamik_ControlType_Off            = 2,
	ESQEX_Bonamik_ControlType_MAX            = 3,
};

// Enum BonamikRt.ESQEX_Bonamik_PropagationMode
// NumValues: 0x0004
enum class ESQEX_Bonamik_PropagationMode : uint8
{
	ESQEX_Bonamik_PropagationMode_SelfAndChildren = 0,
	ESQEX_Bonamik_PropagationMode_SelfOnly   = 1,
	ESQEX_Bonamik_PropagationMode_ChildrenOnly = 2,
	ESQEX_Bonamik_PropagationMode_MAX        = 3,
};

// Enum BonamikRt.ESQEX_Bonamik_PossessionMode
// NumValues: 0x0004
enum class ESQEX_Bonamik_PossessionMode : uint8
{
	ESQEX_Bonamik_PSSMODE_SWING_Y            = 0,
	ESQEX_Bonamik_PSSMODE_SWING_Z            = 1,
	ESQEX_Bonamik_PSSMODE_RANDOM_ROLL        = 2,
	ESQEX_Bonamik_PSSMODE_MAX                = 3,
};

// Enum BonamikRt.SHAPEMATCHING_MODE
// NumValues: 0x0004
enum class ESHAPEMATCHING_MODE : uint8
{
	ESQEX_Bonamik_SMMODE_CHAINSHAPEMATCH     = 0,
	ESQEX_Bonamik_SMMODE_SEQCHAINMATCH       = 1,
	ESQEX_Bonamik_SMMODE_VOLUMEMATCH         = 2,
	ESQEX_Bonamik_SMMODE_MAX                 = 3,
};

// Enum BonamikRt.ESQEX_Bonamik_FastMotionHandling
// NumValues: 0x0004
enum class ESQEX_Bonamik_FastMotionHandling : uint8
{
	ESQEX_Bonamik_FMH_NONE                   = 0,
	ESQEX_Bonamik_FMH_LOCAL_FORCE            = 1,
	ESQEX_Bonamik_FMH_LSS                    = 2,
	ESQEX_Bonamik_FMH_MAX                    = 3,
};

// Enum BonamikRt.ESQEX_Bonamik_JointLinkSimulationMode
// NumValues: 0x0003
enum class ESQEX_Bonamik_JointLinkSimulationMode : uint8
{
	ESQEX_Bonamik_JOINTLINK_MODE_SEQ         = 0,
	ESQEX_Bonamik_JOINTLINK_MODE_BATCH       = 1,
	ESQEX_Bonamik_JOINTLINK_MODE_MAX         = 2,
};

// Enum BonamikRt.ESQEX_Bonamik_ConstraintType
// NumValues: 0x0006
enum class ESQEX_Bonamik_ConstraintType : uint8
{
	ESQEX_Bonamik_ConstraintType_None        = 0,
	ESQEX_Bonamik_ConstraintType_Sphere      = 1,
	ESQEX_Bonamik_ConstraintType_Spring      = 2,
	ESQEX_Bonamik_ConstraintType_GroundAttach = 3,
	ESQEX_Bonamik_ConstraintType_SecondOrder_Sphere = 4,
	ESQEX_Bonamik_ConstraintType_MAX         = 5,
};

// Enum BonamikRt.ESQEX_Bonamik_CollisionShape
// NumValues: 0x000B
enum class ESQEX_Bonamik_CollisionShape : uint8
{
	ESQEX_Bonamik_CollisionShape_None        = 0,
	ESQEX_Bonamik_CollisionShape_Sphere      = 1,
	ESQEX_Bonamik_CollisionShape_Capsule     = 2,
	ESQEX_Bonamik_CollisionShape_Inverse_Sphere = 3,
	ESQEX_Bonamik_CollisionShape_Inverse_Capsule = 4,
	ESQEX_Bonamik_CollisionShape_ReservedA   = 5,
	ESQEX_Bonamik_CollisionShape_Plane       = 6,
	ESQEX_Bonamik_CollisionShape_ReservedB   = 7,
	ESQEX_Bonamik_CollisionShape_Box         = 8,
	ESQEX_Bonamik_CollisionShape_Self_Collision = 9,
	ESQEX_Bonamik_CollisionShape_MAX         = 10,
};

// Enum BonamikRt.ESQEX_Bonamik_LinkType
// NumValues: 0x0008
enum class ESQEX_Bonamik_LinkType : uint8
{
	ESQEX_Bonamik_LinkType_Lateral           = 0,
	ESQEX_Bonamik_LinkType_ParentChild       = 1,
	ESQEX_Bonamik_LinkType_Bending           = 2,
	ESQEX_Bonamik_LinkType_PinConstraint     = 3,
	ESQEX_Bonamik_LinkType_KdiConstraint     = 4,
	ESQEX_Bonamik_LinkType_ReactionTransfer  = 5,
	ESQEX_Bonamik_LinkType_InverseFreeConstraint = 6,
	ESQEX_Bonamik_LinkType_MAX               = 7,
};

// Enum BonamikRt.ESQEX_Bonamik_PossessionMode_v2
// NumValues: 0x0004
enum class ESQEX_Bonamik_PossessionMode_v2 : uint8
{
	ESQEX_Bonamik_PSSMODE_v2_SWING_Y         = 0,
	ESQEX_Bonamik_PSSMODE_v2_SWING_Z         = 1,
	ESQEX_Bonamik_PSSMODE_v2_RANDOM_ROLL     = 2,
	ESQEX_Bonamik_PSSMODE_v2_MAX             = 3,
};

// Enum BonamikRt.SHAPEMATCHING_MODE_v2
// NumValues: 0x0004
enum class ESHAPEMATCHING_MODE_v2 : uint8
{
	ESQEX_Bonamik_SMMODE_v2_CHAINSHAPEMATCH  = 0,
	ESQEX_Bonamik_SMMODE_v2_SEQCHAINMATCH    = 1,
	ESQEX_Bonamik_SMMODE_v2_VOLUMEMATCH      = 2,
	ESQEX_Bonamik_SMMODE_v2_MAX              = 3,
};

// Enum BonamikRt.ESQEX_Bonamik_FastMotionHandling_v2
// NumValues: 0x0004
enum class ESQEX_Bonamik_FastMotionHandling_v2 : uint8
{
	ESQEX_Bonamik_FMH_v2_NONE                = 0,
	ESQEX_Bonamik_FMH_v2_LOCAL_FORCE         = 1,
	ESQEX_Bonamik_FMH_v2_LSS                 = 2,
	ESQEX_Bonamik_FMH_v2_MAX                 = 3,
};

// Enum BonamikRt.ESQEX_Bonamik_JointLinkSimulationMode_v2
// NumValues: 0x0003
enum class ESQEX_Bonamik_JointLinkSimulationMode_v2 : uint8
{
	ESQEX_Bonamik_JOINTLINK_MODE_v2_SEQ      = 0,
	ESQEX_Bonamik_JOINTLINK_MODE_v2_BATCH    = 1,
	ESQEX_Bonamik_JOINTLINK_MODE_v2_MAX      = 2,
};

// Enum BonamikRt.ESQEX_Bonamik_ConstraintType_v2
// NumValues: 0x0006
enum class ESQEX_Bonamik_ConstraintType_v2 : uint8
{
	ESQEX_Bonamik_ConstraintType_v2_None     = 0,
	ESQEX_Bonamik_ConstraintType_v2_Sphere   = 1,
	ESQEX_Bonamik_ConstraintType_v2_Spring   = 2,
	ESQEX_Bonamik_ConstraintType_v2_GroundAttach = 3,
	ESQEX_Bonamik_ConstraintType_v2_SecondOrder_Sphere = 4,
	ESQEX_Bonamik_ConstraintType_v2_MAX      = 5,
};

// Enum BonamikRt.ESQEX_Bonamik_CollisionShape_v2
// NumValues: 0x000B
enum class ESQEX_Bonamik_CollisionShape_v2 : uint8
{
	ESQEX_Bonamik_CollisionShape_v2_None     = 0,
	ESQEX_Bonamik_CollisionShape_v2_Sphere   = 1,
	ESQEX_Bonamik_CollisionShape_v2_Capsule  = 2,
	ESQEX_Bonamik_CollisionShape_v2_Inverse_Sphere = 3,
	ESQEX_Bonamik_CollisionShape_v2_Inverse_Capsule = 4,
	ESQEX_Bonamik_CollisionShape_v2_ReservedA = 5,
	ESQEX_Bonamik_CollisionShape_v2_Plane    = 6,
	ESQEX_Bonamik_CollisionShape_v2_ReservedB = 7,
	ESQEX_Bonamik_CollisionShape_v2_Box      = 8,
	ESQEX_Bonamik_CollisionShape_v2_Self_Collision = 9,
	ESQEX_Bonamik_CollisionShape_v2_MAX      = 10,
};

// Enum BonamikRt.ESQEX_Bonamik_LinkType_v2
// NumValues: 0x0008
enum class ESQEX_Bonamik_LinkType_v2 : uint8
{
	ESQEX_Bonamik_LinkType_v2_Lateral        = 0,
	ESQEX_Bonamik_LinkType_v2_ParentChild    = 1,
	ESQEX_Bonamik_LinkType_v2_Bending        = 2,
	ESQEX_Bonamik_LinkType_v2_PinConstraint  = 3,
	ESQEX_Bonamik_LinkType_v2_KdiConstraint  = 4,
	ESQEX_Bonamik_LinkType_v2_ReactionTransfer = 5,
	ESQEX_Bonamik_LinkType_v2_InverseFreeConstraint = 6,
	ESQEX_Bonamik_LinkType_v2_MAX            = 7,
};

// Enum BonamikRt.ESQEX_BonamikTempCollisionShape
// NumValues: 0x0004
enum class ESQEX_BonamikTempCollisionShape : uint8
{
	None                                     = 0,
	Sphere                                   = 1,
	Box                                      = 8,
	ESQEX_MAX                                = 9,
};

// Enum BonamikRt.ESQEX_BonamikTempCollisionConstant
// NumValues: 0x0002
enum class ESQEX_BonamikTempCollisionConstant : uint8
{
	BodyMaximumNum                           = 10,
	ESQEX_MAX                                = 11,
};

// Enum BonamikRt.ESQEX_Bonamik_Parameters
// NumValues: 0x0013
enum class ESQEX_Bonamik_Parameters : uint8
{
	ESQEX_Bonamik_Parameters_Mass            = 0,
	ESQEX_Bonamik_Parameters_Friction        = 1,
	ESQEX_Bonamik_Parameters_Damping         = 2,
	ESQEX_Bonamik_Parameters_Bounciness      = 3,
	ESQEX_Bonamik_Parameters_WindDrag        = 4,
	ESQEX_Bonamik_Parameters_WindLift        = 5,
	ESQEX_Bonamik_Parameters_LFCoeff         = 6,
	ESQEX_Bonamik_Parameters_ParkRate        = 7,
	ESQEX_Bonamik_Parameters_MaxLF           = 8,
	ESQEX_Bonamik_Parameters_LFDrag          = 9,
	ESQEX_Bonamik_Parameters_LFLift          = 10,
	ESQEX_Bonamik_Parameters_InnerConeStr    = 11,
	ESQEX_Bonamik_Parameters_OuterConeStr    = 12,
	ESQEX_Bonamik_Parameters_LinkStr         = 13,
	ESQEX_Bonamik_Parameters_ConeLimit       = 14,
	ESQEX_Bonamik_Parameters_ConeOffset      = 15,
	ESQEX_Bonamik_Parameters_ConeLimitOffset = 16,
	ESQEX_Bonamik_Parameters_ShapeSize       = 17,
	ESQEX_Bonamik_Parameters_MAX             = 18,
};

// Enum BonamikRt.ESQEX_Bonamik_GlobalOutOfCamera
// NumValues: 0x0003
enum class ESQEX_Bonamik_GlobalOutOfCamera : uint8
{
	Default                                  = 0,
	Override                                 = 1,
	ESQEX_Bonamik_MAX                        = 2,
};

// Enum BonamikRt.ESQEX_Bonamik_EmissiveDirection_v2
// NumValues: 0x0004
enum class ESQEX_Bonamik_EmissiveDirection_v2 : uint8
{
	ESQEX_Bonamik_EmissiveDirection_v2_UpVec = 0,
	ESQEX_Bonamik_EmissiveDirection_v2_ModelSpace = 1,
	ESQEX_Bonamik_EmissiveDirection_v2_WorldSpace = 2,
	ESQEX_Bonamik_EmissiveDirection_v2_MAX   = 3,
};

// Enum BonamikRt.ESQEX_BonamikWind_SourceType
// NumValues: 0x0003
enum class ESQEX_BonamikWind_SourceType : uint8
{
	ESQEX_BonamikWind_DirectionalSource      = 0,
	ESQEX_BonamikWind_PointSource            = 1,
	ESQEX_BonamikWind_MAX                    = 2,
};

// Enum BonamikRt.ESQEX_Bonamik_WindOwnerType
// NumValues: 0x0006
enum class ESQEX_Bonamik_WindOwnerType : uint8
{
	ESQEX_Bonamik_WindOwnerType_Actor        = 0,
	ESQEX_Bonamik_WindOwnerType_Preset       = 1,
	ESQEX_Bonamik_WindOwnerType_AnimNotify   = 2,
	ESQEX_Bonamik_WindOwnerType_Matinee      = 3,
	ESQEX_Bonamik_WindOwnerType_AllTypes     = 4,
	ESQEX_Bonamik_WindOwnerType_MAX          = 5,
};

// Enum BonamikRt.ESQEX_Bonamik_WindAreaType
// NumValues: 0x0004
enum class ESQEX_Bonamik_WindAreaType : uint8
{
	ESQEX_Bonamik_WindAreaType_Global        = 0,
	ESQEX_Bonamik_WindAreaType_Box           = 1,
	ESQEX_Bonamik_WindAreaType_Sphere        = 2,
	ESQEX_Bonamik_WindAreaType_MAX           = 3,
};

// Enum BonamikRt.ESQEX_Bonamik_WindType_Notify
// NumValues: 0x0003
enum class ESQEX_Bonamik_WindType_Notify : uint8
{
	ESQEX_Bonamik_WindType_Notify_Directional = 0,
	ESQEX_Bonamik_WindType_Notify_PointBlast = 1,
	ESQEX_Bonamik_WindType_Notify_MAX        = 2,
};

// Enum BonamikRt.ESQEX_Bonamik_CustomWindType
// NumValues: 0x0004
enum class ESQEX_Bonamik_CustomWindType : uint8
{
	ESQEX_Bonamik_CustomWindType_Directional = 0,
	ESQEX_Bonamik_CustomWindType_Wave        = 1,
	ESQEX_Bonamik_CustomWindType_PointBlast  = 2,
	ESQEX_Bonamik_CustomWindType_MAX         = 3,
};

// Enum BonamikRt.ESQEX_Bonamik_WindType
// NumValues: 0x0005
enum class ESQEX_Bonamik_WindType : uint8
{
	ESQEX_Bonamik_WindType_Directional       = 0,
	ESQEX_Bonamik_WindType_Wave              = 1,
	ESQEX_Bonamik_WindType_CustomWave        = 2,
	ESQEX_Bonamik_WindType_PointBlast        = 3,
	ESQEX_Bonamik_WindType_MAX               = 4,
};

// ScriptStruct BonamikRt.BonamikWindAttributeAccess
// 0x0001 (0x0001 - 0x0000)
struct FBonamikWindAttributeAccess final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBonamikWindAttributeAccess) == 0x000001, "Wrong alignment on FBonamikWindAttributeAccess");
static_assert(sizeof(FBonamikWindAttributeAccess) == 0x000001, "Wrong size on FBonamikWindAttributeAccess");

// ScriptStruct BonamikRt.InterpTrackBonamikCharaWindKey
// 0x0004 (0x0004 - 0x0000)
struct FInterpTrackBonamikCharaWindKey final
{
public:
	float                                         m_Time;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FInterpTrackBonamikCharaWindKey) == 0x000004, "Wrong alignment on FInterpTrackBonamikCharaWindKey");
static_assert(sizeof(FInterpTrackBonamikCharaWindKey) == 0x000004, "Wrong size on FInterpTrackBonamikCharaWindKey");
static_assert(offsetof(FInterpTrackBonamikCharaWindKey, m_Time) == 0x000000, "Member 'FInterpTrackBonamikCharaWindKey::m_Time' has a wrong offset!");

// ScriptStruct BonamikRt.InterpTrackBonamikControlKey
// 0x0040 (0x0040 - 0x0000)
struct FInterpTrackBonamikControlKey final
{
public:
	float                                         m_Time;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_Reset;                                           // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ResetPose;                                       // 0x0005(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ReinitializeSimulationPose;                      // 0x0006(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_RestoreDefaultParams;                            // 0x0007(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_PreRoll;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_PreRollForAttachment;                            // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           m_Groups;                                          // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_ControlType                     m_SimulationOnOff;                                 // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_ControlType                     m_GroundOnOff;                                     // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeInnerCone;                                 // 0x0022(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_InnerConeScale;                                  // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeOuterCone;                                 // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_OuterConeScale;                                  // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeLocalForce;                                // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_LocalForceScale;                                 // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeWindScale;                                 // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupWindScale;                                  // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FInterpTrackBonamikControlKey) == 0x000008, "Wrong alignment on FInterpTrackBonamikControlKey");
static_assert(sizeof(FInterpTrackBonamikControlKey) == 0x000040, "Wrong size on FInterpTrackBonamikControlKey");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_Time) == 0x000000, "Member 'FInterpTrackBonamikControlKey::m_Time' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_Reset) == 0x000004, "Member 'FInterpTrackBonamikControlKey::m_Reset' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_ResetPose) == 0x000005, "Member 'FInterpTrackBonamikControlKey::m_ResetPose' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_ReinitializeSimulationPose) == 0x000006, "Member 'FInterpTrackBonamikControlKey::m_ReinitializeSimulationPose' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_RestoreDefaultParams) == 0x000007, "Member 'FInterpTrackBonamikControlKey::m_RestoreDefaultParams' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_PreRoll) == 0x000008, "Member 'FInterpTrackBonamikControlKey::m_PreRoll' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_PreRollForAttachment) == 0x00000C, "Member 'FInterpTrackBonamikControlKey::m_PreRollForAttachment' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_Groups) == 0x000010, "Member 'FInterpTrackBonamikControlKey::m_Groups' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_SimulationOnOff) == 0x000020, "Member 'FInterpTrackBonamikControlKey::m_SimulationOnOff' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_GroundOnOff) == 0x000021, "Member 'FInterpTrackBonamikControlKey::m_GroundOnOff' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_ChangeInnerCone) == 0x000022, "Member 'FInterpTrackBonamikControlKey::m_ChangeInnerCone' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_InnerConeScale) == 0x000024, "Member 'FInterpTrackBonamikControlKey::m_InnerConeScale' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_ChangeOuterCone) == 0x000028, "Member 'FInterpTrackBonamikControlKey::m_ChangeOuterCone' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_OuterConeScale) == 0x00002C, "Member 'FInterpTrackBonamikControlKey::m_OuterConeScale' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_ChangeLocalForce) == 0x000030, "Member 'FInterpTrackBonamikControlKey::m_ChangeLocalForce' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_LocalForceScale) == 0x000034, "Member 'FInterpTrackBonamikControlKey::m_LocalForceScale' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_ChangeWindScale) == 0x000038, "Member 'FInterpTrackBonamikControlKey::m_ChangeWindScale' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikControlKey, m_GroupWindScale) == 0x00003C, "Member 'FInterpTrackBonamikControlKey::m_GroupWindScale' has a wrong offset!");

// ScriptStruct BonamikRt.InterpTrackBonamikTeleportKey
// 0x000C (0x000C - 0x0000)
struct FInterpTrackBonamikTeleportKey final
{
public:
	float                                         m_Time;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_Distance;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_PreRoll;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FInterpTrackBonamikTeleportKey) == 0x000004, "Wrong alignment on FInterpTrackBonamikTeleportKey");
static_assert(sizeof(FInterpTrackBonamikTeleportKey) == 0x00000C, "Wrong size on FInterpTrackBonamikTeleportKey");
static_assert(offsetof(FInterpTrackBonamikTeleportKey, m_Time) == 0x000000, "Member 'FInterpTrackBonamikTeleportKey::m_Time' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikTeleportKey, m_Distance) == 0x000004, "Member 'FInterpTrackBonamikTeleportKey::m_Distance' has a wrong offset!");
static_assert(offsetof(FInterpTrackBonamikTeleportKey, m_PreRoll) == 0x000008, "Member 'FInterpTrackBonamikTeleportKey::m_PreRoll' has a wrong offset!");

// ScriptStruct BonamikRt.InterpTrackBonamikWindControlKey
// 0x0004 (0x0004 - 0x0000)
struct FInterpTrackBonamikWindControlKey final
{
public:
	float                                         m_Time;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FInterpTrackBonamikWindControlKey) == 0x000004, "Wrong alignment on FInterpTrackBonamikWindControlKey");
static_assert(sizeof(FInterpTrackBonamikWindControlKey) == 0x000004, "Wrong size on FInterpTrackBonamikWindControlKey");
static_assert(offsetof(FInterpTrackBonamikWindControlKey, m_Time) == 0x000000, "Member 'FInterpTrackBonamikWindControlKey::m_Time' has a wrong offset!");

// ScriptStruct BonamikRt.InterpTrackBonamikWorldWindKey
// 0x0004 (0x0004 - 0x0000)
struct FInterpTrackBonamikWorldWindKey final
{
public:
	float                                         m_Time;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FInterpTrackBonamikWorldWindKey) == 0x000004, "Wrong alignment on FInterpTrackBonamikWorldWindKey");
static_assert(sizeof(FInterpTrackBonamikWorldWindKey) == 0x000004, "Wrong size on FInterpTrackBonamikWorldWindKey");
static_assert(offsetof(FInterpTrackBonamikWorldWindKey, m_Time) == 0x000000, "Member 'FInterpTrackBonamikWorldWindKey::m_Time' has a wrong offset!");

// ScriptStruct BonamikRt.SQEX_BonamikPossessionDesc
// 0x0040 (0x0040 - 0x0000)
struct FSQEX_BonamikPossessionDesc final
{
public:
	class FString                                 m_BodyName;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_BodyId;                                          // 0x0010(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_Time;                                            // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_PossessionMode                  m_Mode;                                            // 0x0018(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m_SubMode;                                         // 0x001C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_IsFlow;                                          // 0x0020(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_DrawingRadius;                                   // 0x0024(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_TimeToActivateNext;                              // 0x0028(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_Magnitude;                                       // 0x002C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_IncrementalMagnitude;                            // 0x0030(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_MaxMagnitude;                                    // 0x0034(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_DelayTime;                                       // 0x0038(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mRootTwist;                                        // 0x003C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSQEX_BonamikPossessionDesc) == 0x000008, "Wrong alignment on FSQEX_BonamikPossessionDesc");
static_assert(sizeof(FSQEX_BonamikPossessionDesc) == 0x000040, "Wrong size on FSQEX_BonamikPossessionDesc");
static_assert(offsetof(FSQEX_BonamikPossessionDesc, m_BodyName) == 0x000000, "Member 'FSQEX_BonamikPossessionDesc::m_BodyName' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPossessionDesc, m_BodyId) == 0x000010, "Member 'FSQEX_BonamikPossessionDesc::m_BodyId' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPossessionDesc, m_Time) == 0x000014, "Member 'FSQEX_BonamikPossessionDesc::m_Time' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPossessionDesc, m_Mode) == 0x000018, "Member 'FSQEX_BonamikPossessionDesc::m_Mode' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPossessionDesc, m_SubMode) == 0x00001C, "Member 'FSQEX_BonamikPossessionDesc::m_SubMode' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPossessionDesc, m_IsFlow) == 0x000020, "Member 'FSQEX_BonamikPossessionDesc::m_IsFlow' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPossessionDesc, m_DrawingRadius) == 0x000024, "Member 'FSQEX_BonamikPossessionDesc::m_DrawingRadius' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPossessionDesc, m_TimeToActivateNext) == 0x000028, "Member 'FSQEX_BonamikPossessionDesc::m_TimeToActivateNext' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPossessionDesc, m_Magnitude) == 0x00002C, "Member 'FSQEX_BonamikPossessionDesc::m_Magnitude' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPossessionDesc, m_IncrementalMagnitude) == 0x000030, "Member 'FSQEX_BonamikPossessionDesc::m_IncrementalMagnitude' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPossessionDesc, m_MaxMagnitude) == 0x000034, "Member 'FSQEX_BonamikPossessionDesc::m_MaxMagnitude' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPossessionDesc, m_DelayTime) == 0x000038, "Member 'FSQEX_BonamikPossessionDesc::m_DelayTime' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPossessionDesc, mRootTwist) == 0x00003C, "Member 'FSQEX_BonamikPossessionDesc::mRootTwist' has a wrong offset!");

// ScriptStruct BonamikRt.SQEX_BonamikShapeMatchingDesc
// 0x00D4 (0x00D4 - 0x0000)
struct FSQEX_BonamikShapeMatchingDesc final
{
public:
	int32                                         m_TotalParticle;                                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_RegionSize;                                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_Stiffness;                                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        m_ParticleIds[0x32];                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSQEX_BonamikShapeMatchingDesc) == 0x000004, "Wrong alignment on FSQEX_BonamikShapeMatchingDesc");
static_assert(sizeof(FSQEX_BonamikShapeMatchingDesc) == 0x0000D4, "Wrong size on FSQEX_BonamikShapeMatchingDesc");
static_assert(offsetof(FSQEX_BonamikShapeMatchingDesc, m_TotalParticle) == 0x000000, "Member 'FSQEX_BonamikShapeMatchingDesc::m_TotalParticle' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikShapeMatchingDesc, m_RegionSize) == 0x000004, "Member 'FSQEX_BonamikShapeMatchingDesc::m_RegionSize' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikShapeMatchingDesc, m_Stiffness) == 0x000008, "Member 'FSQEX_BonamikShapeMatchingDesc::m_Stiffness' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikShapeMatchingDesc, m_ParticleIds) == 0x00000C, "Member 'FSQEX_BonamikShapeMatchingDesc::m_ParticleIds' has a wrong offset!");

// ScriptStruct BonamikRt.SQEX_BonamikPlaneDesc
// 0x0078 (0x0078 - 0x0000)
struct FSQEX_BonamikPlaneDesc final
{
public:
	uint32                                        m_GroupId;                                         // 0x0000(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 m_ParticleAName;                                   // 0x0008(0x0010)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 m_ParticleBName;                                   // 0x0018(0x0010)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 m_ParticleCName;                                   // 0x0028(0x0010)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_ParticleA;                                       // 0x0038(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_ParticleB;                                       // 0x003C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_ParticleC;                                       // 0x0040(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        m_Index;                                           // 0x0044(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_Thickness;                                       // 0x0048(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_Offset;                                          // 0x004C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_IsCollision;                                     // 0x0050(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m_CollisionBatchNo;                                // 0x0054(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_ColId[0x8];                                      // 0x0058(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSQEX_BonamikPlaneDesc) == 0x000008, "Wrong alignment on FSQEX_BonamikPlaneDesc");
static_assert(sizeof(FSQEX_BonamikPlaneDesc) == 0x000078, "Wrong size on FSQEX_BonamikPlaneDesc");
static_assert(offsetof(FSQEX_BonamikPlaneDesc, m_GroupId) == 0x000000, "Member 'FSQEX_BonamikPlaneDesc::m_GroupId' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPlaneDesc, m_ParticleAName) == 0x000008, "Member 'FSQEX_BonamikPlaneDesc::m_ParticleAName' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPlaneDesc, m_ParticleBName) == 0x000018, "Member 'FSQEX_BonamikPlaneDesc::m_ParticleBName' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPlaneDesc, m_ParticleCName) == 0x000028, "Member 'FSQEX_BonamikPlaneDesc::m_ParticleCName' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPlaneDesc, m_ParticleA) == 0x000038, "Member 'FSQEX_BonamikPlaneDesc::m_ParticleA' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPlaneDesc, m_ParticleB) == 0x00003C, "Member 'FSQEX_BonamikPlaneDesc::m_ParticleB' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPlaneDesc, m_ParticleC) == 0x000040, "Member 'FSQEX_BonamikPlaneDesc::m_ParticleC' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPlaneDesc, m_Index) == 0x000044, "Member 'FSQEX_BonamikPlaneDesc::m_Index' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPlaneDesc, m_Thickness) == 0x000048, "Member 'FSQEX_BonamikPlaneDesc::m_Thickness' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPlaneDesc, m_Offset) == 0x00004C, "Member 'FSQEX_BonamikPlaneDesc::m_Offset' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPlaneDesc, m_IsCollision) == 0x000050, "Member 'FSQEX_BonamikPlaneDesc::m_IsCollision' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPlaneDesc, m_CollisionBatchNo) == 0x000054, "Member 'FSQEX_BonamikPlaneDesc::m_CollisionBatchNo' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikPlaneDesc, m_ColId) == 0x000058, "Member 'FSQEX_BonamikPlaneDesc::m_ColId' has a wrong offset!");

// ScriptStruct BonamikRt.SQEX_BonamikCollisionCliqueDesc
// 0x0010 (0x0010 - 0x0000)
struct FSQEX_BonamikCollisionCliqueDesc final
{
public:
	TArray<uint32>                                mShapeIds;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSQEX_BonamikCollisionCliqueDesc) == 0x000008, "Wrong alignment on FSQEX_BonamikCollisionCliqueDesc");
static_assert(sizeof(FSQEX_BonamikCollisionCliqueDesc) == 0x000010, "Wrong size on FSQEX_BonamikCollisionCliqueDesc");
static_assert(offsetof(FSQEX_BonamikCollisionCliqueDesc, mShapeIds) == 0x000000, "Member 'FSQEX_BonamikCollisionCliqueDesc::mShapeIds' has a wrong offset!");

// ScriptStruct BonamikRt.SQEX_BonamikShapeDesc
// 0x0058 (0x0058 - 0x0000)
struct FSQEX_BonamikShapeDesc final
{
public:
	uint32                                        mShapeId;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 mType;                                             // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         mBodies;                                           // 0x0018(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	float                                         mPlaneThickness;                                   // 0x0028(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mPlaneOffset;                                      // 0x002C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mCapsuleConcaveRatio;                              // 0x0030(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInverse;                                        // 0x0034(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInfinity;                                       // 0x0035(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResampleStart;                                    // 0x0036(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         mReceiverGroups;                                   // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         mRepulsorGroups;                                   // 0x0048(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSQEX_BonamikShapeDesc) == 0x000008, "Wrong alignment on FSQEX_BonamikShapeDesc");
static_assert(sizeof(FSQEX_BonamikShapeDesc) == 0x000058, "Wrong size on FSQEX_BonamikShapeDesc");
static_assert(offsetof(FSQEX_BonamikShapeDesc, mShapeId) == 0x000000, "Member 'FSQEX_BonamikShapeDesc::mShapeId' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikShapeDesc, mType) == 0x000008, "Member 'FSQEX_BonamikShapeDesc::mType' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikShapeDesc, mBodies) == 0x000018, "Member 'FSQEX_BonamikShapeDesc::mBodies' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikShapeDesc, mPlaneThickness) == 0x000028, "Member 'FSQEX_BonamikShapeDesc::mPlaneThickness' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikShapeDesc, mPlaneOffset) == 0x00002C, "Member 'FSQEX_BonamikShapeDesc::mPlaneOffset' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikShapeDesc, mCapsuleConcaveRatio) == 0x000030, "Member 'FSQEX_BonamikShapeDesc::mCapsuleConcaveRatio' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikShapeDesc, bIsInverse) == 0x000034, "Member 'FSQEX_BonamikShapeDesc::bIsInverse' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikShapeDesc, bIsInfinity) == 0x000035, "Member 'FSQEX_BonamikShapeDesc::bIsInfinity' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikShapeDesc, bResampleStart) == 0x000036, "Member 'FSQEX_BonamikShapeDesc::bResampleStart' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikShapeDesc, mReceiverGroups) == 0x000038, "Member 'FSQEX_BonamikShapeDesc::mReceiverGroups' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikShapeDesc, mRepulsorGroups) == 0x000048, "Member 'FSQEX_BonamikShapeDesc::mRepulsorGroups' has a wrong offset!");

// ScriptStruct BonamikRt.SQEX_BonamikLinkDesc
// 0x0090 (0x0090 - 0x0000)
struct FSQEX_BonamikLinkDesc final
{
public:
	class FString                                 m_ParentBodyName;                                  // 0x0000(0x0010)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 m_ChildBodyName;                                   // 0x0010(0x0010)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        m_ParentId;                                        // 0x0020(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        m_ChildId;                                         // 0x0024(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEX_Bonamik_LinkType                        m_LinkType;                                        // 0x0028(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_IsSelfCollision;                                 // 0x0029(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_EnableJointTwist;                                // 0x002A(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_EnableCone;                                      // 0x002B(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_EnableConeAnimation;                             // 0x002C(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_LinkStr;                                         // 0x0030(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_LinkCompressedStr;                               // 0x0034(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_LinkParentStr;                                   // 0x0038(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_ConeInnerStr;                                    // 0x003C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_ConeOuterStr;                                    // 0x0040(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_ConeParentStr;                                   // 0x0044(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_LimitY;                                          // 0x0048(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_LimitZ;                                          // 0x004C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_ConeOffsetY;                                     // 0x0050(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_ConeOffsetZ;                                     // 0x0054(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_LimitOffsetY;                                    // 0x0058(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_LimitOffsetZ;                                    // 0x005C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_IsCollisionReceiver;                             // 0x0060(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_IsCollisionRepulsor;                             // 0x0061(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_IsLRA;                                           // 0x0062(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_LRAstr;                                          // 0x0064(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_LRAdamping;                                      // 0x0068(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        m_LinkBatchNo;                                     // 0x006C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        m_ConeBatchNo;                                     // 0x0070(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        m_CollisionBatchNo;                                // 0x0074(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_PinRadius;                                       // 0x0078(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_PinStr;                                          // 0x007C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_KdiTrans;                                        // 0x0080(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_KdiRot;                                          // 0x0084(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_ConcaveRatio;                                    // 0x0088(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSQEX_BonamikLinkDesc) == 0x000008, "Wrong alignment on FSQEX_BonamikLinkDesc");
static_assert(sizeof(FSQEX_BonamikLinkDesc) == 0x000090, "Wrong size on FSQEX_BonamikLinkDesc");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_ParentBodyName) == 0x000000, "Member 'FSQEX_BonamikLinkDesc::m_ParentBodyName' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_ChildBodyName) == 0x000010, "Member 'FSQEX_BonamikLinkDesc::m_ChildBodyName' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_ParentId) == 0x000020, "Member 'FSQEX_BonamikLinkDesc::m_ParentId' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_ChildId) == 0x000024, "Member 'FSQEX_BonamikLinkDesc::m_ChildId' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_LinkType) == 0x000028, "Member 'FSQEX_BonamikLinkDesc::m_LinkType' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_IsSelfCollision) == 0x000029, "Member 'FSQEX_BonamikLinkDesc::m_IsSelfCollision' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_EnableJointTwist) == 0x00002A, "Member 'FSQEX_BonamikLinkDesc::m_EnableJointTwist' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_EnableCone) == 0x00002B, "Member 'FSQEX_BonamikLinkDesc::m_EnableCone' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_EnableConeAnimation) == 0x00002C, "Member 'FSQEX_BonamikLinkDesc::m_EnableConeAnimation' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_LinkStr) == 0x000030, "Member 'FSQEX_BonamikLinkDesc::m_LinkStr' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_LinkCompressedStr) == 0x000034, "Member 'FSQEX_BonamikLinkDesc::m_LinkCompressedStr' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_LinkParentStr) == 0x000038, "Member 'FSQEX_BonamikLinkDesc::m_LinkParentStr' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_ConeInnerStr) == 0x00003C, "Member 'FSQEX_BonamikLinkDesc::m_ConeInnerStr' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_ConeOuterStr) == 0x000040, "Member 'FSQEX_BonamikLinkDesc::m_ConeOuterStr' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_ConeParentStr) == 0x000044, "Member 'FSQEX_BonamikLinkDesc::m_ConeParentStr' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_LimitY) == 0x000048, "Member 'FSQEX_BonamikLinkDesc::m_LimitY' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_LimitZ) == 0x00004C, "Member 'FSQEX_BonamikLinkDesc::m_LimitZ' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_ConeOffsetY) == 0x000050, "Member 'FSQEX_BonamikLinkDesc::m_ConeOffsetY' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_ConeOffsetZ) == 0x000054, "Member 'FSQEX_BonamikLinkDesc::m_ConeOffsetZ' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_LimitOffsetY) == 0x000058, "Member 'FSQEX_BonamikLinkDesc::m_LimitOffsetY' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_LimitOffsetZ) == 0x00005C, "Member 'FSQEX_BonamikLinkDesc::m_LimitOffsetZ' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_IsCollisionReceiver) == 0x000060, "Member 'FSQEX_BonamikLinkDesc::m_IsCollisionReceiver' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_IsCollisionRepulsor) == 0x000061, "Member 'FSQEX_BonamikLinkDesc::m_IsCollisionRepulsor' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_IsLRA) == 0x000062, "Member 'FSQEX_BonamikLinkDesc::m_IsLRA' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_LRAstr) == 0x000064, "Member 'FSQEX_BonamikLinkDesc::m_LRAstr' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_LRAdamping) == 0x000068, "Member 'FSQEX_BonamikLinkDesc::m_LRAdamping' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_LinkBatchNo) == 0x00006C, "Member 'FSQEX_BonamikLinkDesc::m_LinkBatchNo' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_ConeBatchNo) == 0x000070, "Member 'FSQEX_BonamikLinkDesc::m_ConeBatchNo' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_CollisionBatchNo) == 0x000074, "Member 'FSQEX_BonamikLinkDesc::m_CollisionBatchNo' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_PinRadius) == 0x000078, "Member 'FSQEX_BonamikLinkDesc::m_PinRadius' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_PinStr) == 0x00007C, "Member 'FSQEX_BonamikLinkDesc::m_PinStr' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_KdiTrans) == 0x000080, "Member 'FSQEX_BonamikLinkDesc::m_KdiTrans' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_KdiRot) == 0x000084, "Member 'FSQEX_BonamikLinkDesc::m_KdiRot' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikLinkDesc, m_ConcaveRatio) == 0x000088, "Member 'FSQEX_BonamikLinkDesc::m_ConcaveRatio' has a wrong offset!");

// ScriptStruct BonamikRt.SQEX_BonamikTwoBodiesHolderDesc
// 0x0020 (0x0020 - 0x0000)
struct FSQEX_BonamikTwoBodiesHolderDesc
{
public:
	class FString                                 mA;                                                // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 mB;                                                // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSQEX_BonamikTwoBodiesHolderDesc) == 0x000008, "Wrong alignment on FSQEX_BonamikTwoBodiesHolderDesc");
static_assert(sizeof(FSQEX_BonamikTwoBodiesHolderDesc) == 0x000020, "Wrong size on FSQEX_BonamikTwoBodiesHolderDesc");
static_assert(offsetof(FSQEX_BonamikTwoBodiesHolderDesc, mA) == 0x000000, "Member 'FSQEX_BonamikTwoBodiesHolderDesc::mA' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikTwoBodiesHolderDesc, mB) == 0x000010, "Member 'FSQEX_BonamikTwoBodiesHolderDesc::mB' has a wrong offset!");

// ScriptStruct BonamikRt.SQEX_BonamikSimpleLinkDesc
// 0x0010 (0x0030 - 0x0020)
struct FSQEX_BonamikSimpleLinkDesc : public FSQEX_BonamikTwoBodiesHolderDesc
{
public:
	float                                         mStretchedStrength;                                // 0x0020(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mCompressedStrength;                               // 0x0024(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mLinkParentStrength;                               // 0x0028(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBending;                                        // 0x002C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableJointTwist;                                 // 0x002D(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableLengthAnimation;                            // 0x002E(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSQEX_BonamikSimpleLinkDesc) == 0x000008, "Wrong alignment on FSQEX_BonamikSimpleLinkDesc");
static_assert(sizeof(FSQEX_BonamikSimpleLinkDesc) == 0x000030, "Wrong size on FSQEX_BonamikSimpleLinkDesc");
static_assert(offsetof(FSQEX_BonamikSimpleLinkDesc, mStretchedStrength) == 0x000020, "Member 'FSQEX_BonamikSimpleLinkDesc::mStretchedStrength' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikSimpleLinkDesc, mCompressedStrength) == 0x000024, "Member 'FSQEX_BonamikSimpleLinkDesc::mCompressedStrength' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikSimpleLinkDesc, mLinkParentStrength) == 0x000028, "Member 'FSQEX_BonamikSimpleLinkDesc::mLinkParentStrength' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikSimpleLinkDesc, bIsBending) == 0x00002C, "Member 'FSQEX_BonamikSimpleLinkDesc::bIsBending' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikSimpleLinkDesc, bEnableJointTwist) == 0x00002D, "Member 'FSQEX_BonamikSimpleLinkDesc::bEnableJointTwist' has a wrong offset!");
static_assert(offsetof(FSQEX_BonamikSimpleLinkDesc, bEnableLengthAnimation) == 0x00002E, "Member 'FSQEX_BonamikSimpleLinkDesc::bEnableLengthAnimation' has a wrong offset!");

// ScriptStruct BonamikRt.SQEX_BonamikConeLinkDesc
// 0x0030 (0x0060 - 0x0030)
struct FSQEX_BonamikConeLinkDesc final : public FSQEX_BonamikSimpleLinkDesc
{
public:
	bool                                          bEnableConeAnimation;                              // 0x0030(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         mLimitY;                                           // 0x0034(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mLimitZ;                                           // 0x0038(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mInnerConeStr;                                     // 0x003C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mOuterConeStr;                                     // 0x0040(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mConeParentStr;                                    // 0x0044(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
