#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: btsc_2660_NIBLM_EB2000

#include "Basic.hpp"

#include "EndDataBase_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function btsc_2660-NIBLM_EB2000.btsc_2660-NIBLM_EB2000_C.ExecuteUbergraph_btsc_2660-NIBLM_EB2000
// 0x0158 (0x0158 - 0x0000)
struct btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStoryFlag_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndDoOnceCode                                Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndDoOnceOutCode                             CallFunc_DoOnceWithThen_Result;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_1;             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_2;             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_3;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Damage;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CauserCharaName_1;                    // 0x0024(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_DamagedCharaName;                     // 0x002C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AbilityID;                            // 0x0034(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBind;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bGuard;                               // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_HitBoneName;                          // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAttributeHit;                        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bResistHit;                           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_DamageSourceID;                       // 0x004C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAttributeType                       K2Node_Event_appendAttribute;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_JustHitRotYaw;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitPosition;                          // 0x005C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHeal;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBurst;                               // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_block;                                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerType                                   CallFunc_GetPlayerType_ReturnValue;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CauserCharaName;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_TargetCharaName;                      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleCountLogType                        K2Node_Event_Type;                                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ID;                                   // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Count;                                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSyncAction_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_3;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_4;                    // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBattleCountLogIntByBP_ReturnValue;     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetPlayerCharacter_ReturnValue_2;         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue_1;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBattleCountLogIntByBP_ReturnValue_1;   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerType                                   CallFunc_GetPlayerType_ReturnValue_1;              // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E7[0x1];                                       // 0x00E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue_2;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerType                                   CallFunc_GetPlayerType_ReturnValue_2;              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue_3;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event__phase;                               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerType                                   CallFunc_GetPlayerType_ReturnValue_3;              // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x0107(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AEndCharacter*>                  CallFunc_GetBattleMembers_ReturnValue;             // 0x0108(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_1;                              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_TalkID;                               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleTalkInterruptReason                 K2Node_Event_SkipReason;                           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_7;                    // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13B[0x1];                                      // 0x013B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBattleCountLogIntByBP_ReturnValue_2;   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue_4;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerType                                   CallFunc_GetPlayerType_ReturnValue_4;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_8;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000) == 0x000008, "Wrong alignment on btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000");
static_assert(sizeof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000) == 0x000158, "Wrong size on btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, EntryPoint) == 0x000000, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::EntryPoint' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_IsStoryFlag_ReturnValue) == 0x000004, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_IsStoryFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, Temp_int_Array_Index_Variable) == 0x000010, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, Temp_byte_Variable) == 0x000014, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_DoOnceWithThen_Result) == 0x000015, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_DoOnceWithThen_Result' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_SwitchEnum_CmpSuccess) == 0x000016, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, Temp_bool_Variable) == 0x000017, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_InRange_IntInt_ReturnValue) == 0x000018, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_InRange_IntInt_ReturnValue_1) == 0x00001A, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_InRange_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_InRange_IntInt_ReturnValue_2) == 0x00001B, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_InRange_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_InRange_IntInt_ReturnValue_3) == 0x00001C, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_InRange_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_Damage) == 0x000020, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_CauserCharaName_1) == 0x000024, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_CauserCharaName_1' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_DamagedCharaName) == 0x00002C, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_DamagedCharaName' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_AbilityID) == 0x000034, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_AbilityID' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_bBind) == 0x00003C, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_bBind' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_bGuard) == 0x00003D, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_bGuard' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_HitBoneName) == 0x000040, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_HitBoneName' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_bAttributeHit) == 0x000048, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_bAttributeHit' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_bResistHit) == 0x000049, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_bResistHit' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_DamageSourceID) == 0x00004C, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_DamageSourceID' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_appendAttribute) == 0x000054, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_appendAttribute' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_JustHitRotYaw) == 0x000058, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_JustHitRotYaw' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_HitPosition) == 0x00005C, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_HitPosition' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_bHeal) == 0x000068, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_bHeal' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_bBurst) == 0x000069, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_bBurst' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_block) == 0x00006A, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_block' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_SwitchName_CmpSuccess) == 0x00006B, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_SwitchName_CmpSuccess_1) == 0x00006C, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_SwitchName_CmpSuccess_2) == 0x00006D, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_SwitchName_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00006E, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000070, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetPartyLeader_ReturnValue) == 0x000080, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetPartyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetPlayerType_ReturnValue) == 0x000088, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetPlayerType_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_SwitchEnum_CmpSuccess_1) == 0x000089, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000090, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_CauserCharaName) == 0x000098, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_CauserCharaName' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_TargetCharaName) == 0x0000A0, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_TargetCharaName' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_Type) == 0x0000A8, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_ID) == 0x0000AC, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_ID' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_Count) == 0x0000B4, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_Count' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_IsInSyncAction_ReturnValue) == 0x0000B8, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_IsInSyncAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000B9, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000BA, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000BB, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_SwitchName_CmpSuccess_3) == 0x0000BC, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_SwitchName_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_SwitchName_CmpSuccess_4) == 0x0000BD, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_SwitchName_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetBattleCountLogIntByBP_ReturnValue) == 0x0000C0, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetBattleCountLogIntByBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000C4, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetPlayerCharacter_ReturnValue_2) == 0x0000C8, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetPlayerCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetPartyLeader_ReturnValue_1) == 0x0000D8, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetPartyLeader_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetBattleCountLogIntByBP_ReturnValue_1) == 0x0000E0, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetBattleCountLogIntByBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetPlayerType_ReturnValue_1) == 0x0000E4, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetPlayerType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000E5, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_SwitchEnum_CmpSuccess_3) == 0x0000E6, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetPartyLeader_ReturnValue_2) == 0x0000E8, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetPartyLeader_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetPlayerType_ReturnValue_2) == 0x0000F0, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetPlayerType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_SwitchEnum_CmpSuccess_4) == 0x0000F1, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetPartyLeader_ReturnValue_3) == 0x0000F8, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetPartyLeader_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event__phase) == 0x000100, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event__phase' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetPlayerType_ReturnValue_3) == 0x000104, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetPlayerType_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_SwitchInteger_CmpSuccess) == 0x000105, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_SwitchEnum_CmpSuccess_5) == 0x000106, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_SwitchEnum_CmpSuccess_6) == 0x000107, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_SwitchEnum_CmpSuccess_6' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetBattleMembers_ReturnValue) == 0x000108, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetBattleMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, Temp_bool_Variable_1) == 0x000118, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_Array_Get_Item) == 0x000120, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_Not_PreBool_ReturnValue_1) == 0x000128, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_Array_Length_ReturnValue) == 0x00012C, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_TalkID) == 0x000130, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_TalkID' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_Event_SkipReason) == 0x000138, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_Event_SkipReason' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_Less_IntInt_ReturnValue) == 0x000139, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_SwitchEnum_CmpSuccess_7) == 0x00013A, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_SwitchEnum_CmpSuccess_7' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetBattleCountLogIntByBP_ReturnValue_2) == 0x00013C, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetBattleCountLogIntByBP_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_Add_IntInt_ReturnValue_1) == 0x000140, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000144, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetPartyLeader_ReturnValue_4) == 0x000148, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetPartyLeader_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, CallFunc_GetPlayerType_ReturnValue_4) == 0x000150, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::CallFunc_GetPlayerType_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000, K2Node_SwitchEnum_CmpSuccess_8) == 0x000151, "Member 'btsc_2660_NIBLM_EB2000_C_ExecuteUbergraph_btsc_2660_NIBLM_EB2000::K2Node_SwitchEnum_CmpSuccess_8' has a wrong offset!");

// Function btsc_2660-NIBLM_EB2000.btsc_2660-NIBLM_EB2000_C.OnBattleTalkInterrupted
// 0x000C (0x000C - 0x0000)
struct btsc_2660_NIBLM_EB2000_C_OnBattleTalkInterrupted final
{
public:
	class FName                                   TalkID;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleTalkInterruptReason                 SkipReason;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_2660_NIBLM_EB2000_C_OnBattleTalkInterrupted) == 0x000004, "Wrong alignment on btsc_2660_NIBLM_EB2000_C_OnBattleTalkInterrupted");
static_assert(sizeof(btsc_2660_NIBLM_EB2000_C_OnBattleTalkInterrupted) == 0x00000C, "Wrong size on btsc_2660_NIBLM_EB2000_C_OnBattleTalkInterrupted");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_OnBattleTalkInterrupted, TalkID) == 0x000000, "Member 'btsc_2660_NIBLM_EB2000_C_OnBattleTalkInterrupted::TalkID' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_OnBattleTalkInterrupted, SkipReason) == 0x000008, "Member 'btsc_2660_NIBLM_EB2000_C_OnBattleTalkInterrupted::SkipReason' has a wrong offset!");

// Function btsc_2660-NIBLM_EB2000.btsc_2660-NIBLM_EB2000_C.ChangePhase
// 0x0004 (0x0004 - 0x0000)
struct btsc_2660_NIBLM_EB2000_C_ChangePhase final
{
public:
	int32                                         _phase;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_2660_NIBLM_EB2000_C_ChangePhase) == 0x000004, "Wrong alignment on btsc_2660_NIBLM_EB2000_C_ChangePhase");
static_assert(sizeof(btsc_2660_NIBLM_EB2000_C_ChangePhase) == 0x000004, "Wrong size on btsc_2660_NIBLM_EB2000_C_ChangePhase");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_ChangePhase, _phase) == 0x000000, "Member 'btsc_2660_NIBLM_EB2000_C_ChangePhase::_phase' has a wrong offset!");

// Function btsc_2660-NIBLM_EB2000.btsc_2660-NIBLM_EB2000_C.OnIncrementBattleCountPerID
// 0x0020 (0x0020 - 0x0000)
struct btsc_2660_NIBLM_EB2000_C_OnIncrementBattleCountPerID final
{
public:
	class FName                                   CauserCharaName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TargetCharaName;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleCountLogType                        Type;                                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ID;                                                // 0x0014(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_2660_NIBLM_EB2000_C_OnIncrementBattleCountPerID) == 0x000004, "Wrong alignment on btsc_2660_NIBLM_EB2000_C_OnIncrementBattleCountPerID");
static_assert(sizeof(btsc_2660_NIBLM_EB2000_C_OnIncrementBattleCountPerID) == 0x000020, "Wrong size on btsc_2660_NIBLM_EB2000_C_OnIncrementBattleCountPerID");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_OnIncrementBattleCountPerID, CauserCharaName) == 0x000000, "Member 'btsc_2660_NIBLM_EB2000_C_OnIncrementBattleCountPerID::CauserCharaName' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_OnIncrementBattleCountPerID, TargetCharaName) == 0x000008, "Member 'btsc_2660_NIBLM_EB2000_C_OnIncrementBattleCountPerID::TargetCharaName' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_OnIncrementBattleCountPerID, Type) == 0x000010, "Member 'btsc_2660_NIBLM_EB2000_C_OnIncrementBattleCountPerID::Type' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_OnIncrementBattleCountPerID, ID) == 0x000014, "Member 'btsc_2660_NIBLM_EB2000_C_OnIncrementBattleCountPerID::ID' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_OnIncrementBattleCountPerID, Count) == 0x00001C, "Member 'btsc_2660_NIBLM_EB2000_C_OnIncrementBattleCountPerID::Count' has a wrong offset!");

// Function btsc_2660-NIBLM_EB2000.btsc_2660-NIBLM_EB2000_C.OnTakeDamage
// 0x004C (0x004C - 0x0000)
struct btsc_2660_NIBLM_EB2000_C_OnTakeDamage final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CauserCharaName;                                   // 0x0004(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DamagedCharaName;                                  // 0x000C(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AbilityId;                                         // 0x0014(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBind;                                             // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bGuard;                                            // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   hitBoneName;                                       // 0x0020(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAttributeHit;                                     // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bResistHit;                                        // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DamageSourceID;                                    // 0x002C(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAttributeType                       appendAttribute;                                   // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         justHitRotYaw;                                     // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                hitPosition;                                       // 0x003C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHeal;                                             // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bBurst;                                            // 0x0049(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLock;                                             // 0x004A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(btsc_2660_NIBLM_EB2000_C_OnTakeDamage) == 0x000004, "Wrong alignment on btsc_2660_NIBLM_EB2000_C_OnTakeDamage");
static_assert(sizeof(btsc_2660_NIBLM_EB2000_C_OnTakeDamage) == 0x00004C, "Wrong size on btsc_2660_NIBLM_EB2000_C_OnTakeDamage");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_OnTakeDamage, Damage) == 0x000000, "Member 'btsc_2660_NIBLM_EB2000_C_OnTakeDamage::Damage' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_OnTakeDamage, CauserCharaName) == 0x000004, "Member 'btsc_2660_NIBLM_EB2000_C_OnTakeDamage::CauserCharaName' has a wrong offset!");
static_assert(offsetof(btsc_2660_NIBLM_EB2000_C_OnTakeDamage, DamagedCharaName) == 0x00000C, "Member 'btsc_2660_NIBLM_EB2000_C_OnTakeDamage::DamagedCharaName' has a wrong offset!");
