#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: btsc_World_MAI_Talk

#include "Basic.hpp"

#include "EndDataBase_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function btsc_World_MAI_Talk.btsc_World_MAI_Talk_C.ExecuteUbergraph_btsc_World_MAI_Talk
// 0x0140 (0x0140 - 0x0000)
struct btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetResidentParameterFloatBP_ReturnValue;  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEnemyMemberCount_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_1;      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_2;      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_3;      // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_4;      // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_5;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_6;      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_7;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_8;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_9;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_10;     // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_11;     // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_12;     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_13;     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_14;     // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_15;     // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_16;     // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_17;     // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_18;     // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_19;     // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_20;     // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_battleScenenBPName;                   // 0x0060(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_territoryID;                          // 0x0068(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_21;     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_3;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_4;                    // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_5;                    // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_22;     // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_23;     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_24;     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_25;     // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_26;     // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_27;     // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_28;     // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_29;     // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_30;     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_31;     // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_32;     // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_33;     // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_34;     // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_35;     // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_36;     // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_37;     // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_38;     // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_39;     // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_40;     // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF[0x1];                                       // 0x00AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Damage;                               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CauserCharaName;                      // 0x00B4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_DamagedCharaName;                     // 0x00BC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AbilityID;                            // 0x00C4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBind;                                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bGuard;                               // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_HitBoneName;                          // 0x00D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAttributeHit;                        // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bResistHit;                           // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_DamageSourceID;                       // 0x00DC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAttributeType                       K2Node_Event_appendAttribute;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_JustHitRotYaw;                        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitPosition;                          // 0x00EC(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHeal;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBurst;                               // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_block;                                // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharaFromActorName_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayer_ReturnValue;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharaFromActorName_ReturnValue_1;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharaHP_ReturnValue;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharaFromActorName_ReturnValue_2;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHPPercent_ReturnValue;                  // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharaFromActorName_ReturnValue_3;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayer_ReturnValue_1;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlannerEventRunning_ReturnValue_41;     // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk) == 0x000008, "Wrong alignment on btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk");
static_assert(sizeof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk) == 0x000140, "Wrong size on btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, EntryPoint) == 0x000000, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::EntryPoint' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_GetPartyLeader_ReturnValue) == 0x000008, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_GetPartyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_GetResidentParameterFloatBP_ReturnValue) == 0x000010, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_GetResidentParameterFloatBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_GetEnemyMemberCount_ReturnValue) == 0x000014, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_GetEnemyMemberCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_FTrunc_ReturnValue) == 0x000020, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue) == 0x000024, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, Temp_int_Array_Index_Variable) == 0x000028, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_1) == 0x00002C, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_2) == 0x00002D, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_3) == 0x00002E, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_4) == 0x00002F, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_5) == 0x000030, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_6) == 0x000031, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_7) == 0x000038, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_8) == 0x000040, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_9) == 0x000041, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_10) == 0x000042, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_11) == 0x000043, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, Temp_int_Array_Index_Variable_1) == 0x000044, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_12) == 0x000048, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_13) == 0x000049, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_14) == 0x00004A, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_15) == 0x00004B, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_16) == 0x00004C, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_17) == 0x00004D, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_18) == 0x00004E, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, Temp_int_Loop_Counter_Variable_1) == 0x000050, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_19) == 0x000054, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, Temp_bool_Has_Been_Initd_Variable) == 0x00005C, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_20) == 0x00005D, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_battleScenenBPName) == 0x000060, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_battleScenenBPName' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_territoryID) == 0x000068, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_territoryID' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_21) == 0x000070, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_SwitchName_CmpSuccess) == 0x000071, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_SwitchName_CmpSuccess_1) == 0x000072, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_SwitchName_CmpSuccess_2) == 0x000073, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_SwitchName_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_SwitchName_CmpSuccess_3) == 0x000074, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_SwitchName_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_SwitchName_CmpSuccess_4) == 0x000075, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_SwitchName_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_SwitchName_CmpSuccess_5) == 0x000076, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_SwitchName_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_22) == 0x000077, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_23) == 0x000078, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_24) == 0x000079, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_25) == 0x00007A, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_26) == 0x00007B, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, Temp_bool_Has_Been_Initd_Variable_1) == 0x00007C, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_27) == 0x00007D, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_28) == 0x00007E, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_29) == 0x00007F, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_30) == 0x000080, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, Temp_bool_IsClosed_Variable) == 0x000081, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_31) == 0x000082, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_31' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_32) == 0x000083, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_32' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_33) == 0x000084, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_33' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_34) == 0x000085, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_34' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_35) == 0x000086, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_35' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_36) == 0x000087, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_36' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, Temp_bool_IsClosed_Variable_1) == 0x000088, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_Array_Get_Item) == 0x00008C, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_37) == 0x000094, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_37' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_38) == 0x00009D, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_38' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000AC, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_39) == 0x0000AD, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_39' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_40) == 0x0000AE, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_40' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_Damage) == 0x0000B0, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_CauserCharaName) == 0x0000B4, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_CauserCharaName' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_DamagedCharaName) == 0x0000BC, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_DamagedCharaName' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_AbilityID) == 0x0000C4, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_AbilityID' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_bBind) == 0x0000CC, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_bBind' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_bGuard) == 0x0000CD, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_bGuard' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_HitBoneName) == 0x0000D0, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_HitBoneName' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_bAttributeHit) == 0x0000D8, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_bAttributeHit' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_bResistHit) == 0x0000D9, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_bResistHit' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_DamageSourceID) == 0x0000DC, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_DamageSourceID' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_appendAttribute) == 0x0000E4, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_appendAttribute' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_JustHitRotYaw) == 0x0000E8, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_JustHitRotYaw' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_HitPosition) == 0x0000EC, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_HitPosition' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_bHeal) == 0x0000F8, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_bHeal' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_bBurst) == 0x0000F9, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_bBurst' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, K2Node_Event_block) == 0x0000FA, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::K2Node_Event_block' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_BooleanOR_ReturnValue) == 0x0000FB, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_GetCharaFromActorName_ReturnValue) == 0x000100, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_GetCharaFromActorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlayer_ReturnValue) == 0x000108, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_GetCharaFromActorName_ReturnValue_1) == 0x000110, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_GetCharaFromActorName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_GetCharaHP_ReturnValue) == 0x000118, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_GetCharaHP_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_GetCharaFromActorName_ReturnValue_2) == 0x000120, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_GetCharaFromActorName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000128, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000129, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsHPPercent_ReturnValue) == 0x00012A, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsHPPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_GetCharaFromActorName_ReturnValue_3) == 0x000130, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_GetCharaFromActorName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlayer_ReturnValue_1) == 0x000138, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk, CallFunc_IsPlannerEventRunning_ReturnValue_41) == 0x000139, "Member 'btsc_World_MAI_Talk_C_ExecuteUbergraph_btsc_World_MAI_Talk::CallFunc_IsPlannerEventRunning_ReturnValue_41' has a wrong offset!");

// Function btsc_World_MAI_Talk.btsc_World_MAI_Talk_C.OnTakeDamage
// 0x004C (0x004C - 0x0000)
struct btsc_World_MAI_Talk_C_OnTakeDamage final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CauserCharaName;                                   // 0x0004(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DamagedCharaName;                                  // 0x000C(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AbilityId;                                         // 0x0014(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBind;                                             // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bGuard;                                            // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   hitBoneName;                                       // 0x0020(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAttributeHit;                                     // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bResistHit;                                        // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DamageSourceID;                                    // 0x002C(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAttributeType                       appendAttribute;                                   // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         justHitRotYaw;                                     // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                hitPosition;                                       // 0x003C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHeal;                                             // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bBurst;                                            // 0x0049(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLock;                                             // 0x004A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(btsc_World_MAI_Talk_C_OnTakeDamage) == 0x000004, "Wrong alignment on btsc_World_MAI_Talk_C_OnTakeDamage");
static_assert(sizeof(btsc_World_MAI_Talk_C_OnTakeDamage) == 0x00004C, "Wrong size on btsc_World_MAI_Talk_C_OnTakeDamage");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, Damage) == 0x000000, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::Damage' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, CauserCharaName) == 0x000004, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::CauserCharaName' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, DamagedCharaName) == 0x00000C, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::DamagedCharaName' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, AbilityId) == 0x000014, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::AbilityId' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, bBind) == 0x00001C, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::bBind' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, bGuard) == 0x00001D, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::bGuard' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, hitBoneName) == 0x000020, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::hitBoneName' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, bAttributeHit) == 0x000028, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::bAttributeHit' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, bResistHit) == 0x000029, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::bResistHit' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, DamageSourceID) == 0x00002C, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::DamageSourceID' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, appendAttribute) == 0x000034, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::appendAttribute' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, justHitRotYaw) == 0x000038, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::justHitRotYaw' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, hitPosition) == 0x00003C, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::hitPosition' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, bHeal) == 0x000048, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::bHeal' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, bBurst) == 0x000049, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::bBurst' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnTakeDamage, bLock) == 0x00004A, "Member 'btsc_World_MAI_Talk_C_OnTakeDamage::bLock' has a wrong offset!");

// Function btsc_World_MAI_Talk.btsc_World_MAI_Talk_C.OnEntryBattleScene
// 0x0010 (0x0010 - 0x0000)
struct btsc_World_MAI_Talk_C_OnEntryBattleScene final
{
public:
	class FName                                   battleScenenBPName;                                // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   territoryID;                                       // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_World_MAI_Talk_C_OnEntryBattleScene) == 0x000004, "Wrong alignment on btsc_World_MAI_Talk_C_OnEntryBattleScene");
static_assert(sizeof(btsc_World_MAI_Talk_C_OnEntryBattleScene) == 0x000010, "Wrong size on btsc_World_MAI_Talk_C_OnEntryBattleScene");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnEntryBattleScene, battleScenenBPName) == 0x000000, "Member 'btsc_World_MAI_Talk_C_OnEntryBattleScene::battleScenenBPName' has a wrong offset!");
static_assert(offsetof(btsc_World_MAI_Talk_C_OnEntryBattleScene, territoryID) == 0x000008, "Member 'btsc_World_MAI_Talk_C_OnEntryBattleScene::territoryID' has a wrong offset!");

}

