#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: btsc_2200_CORLA_Corla_CactuarMission1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function btsc_2200-CORLA_Corla_CactuarMission1.btsc_2200-CORLA_Corla_CactuarMission1_C.ExecuteUbergraph_btsc_2200-CORLA_Corla_CactuarMission1
// 0x0270 (0x0270 - 0x0000)
struct btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Mid_ReturnValue;                          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Mid_ReturnValue_1;                        // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_2;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Mid_ReturnValue_2;                        // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_3;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_4;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_battleScenenBPName;                   // 0x0100(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_territoryID;                          // 0x0108(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetEndTargetPointTransform_ReturnValue;   // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharaFromActorName_ReturnValue;        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayEffect_ReturnValue;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStoryFlag_ReturnValue;                  // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStoryFlag_ReturnValue_1;                // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E2[0x2];                                      // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBattleSceneCount_ReturnValue;          // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x021D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x021E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21F[0x1];                                      // 0x021F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPreloadedWaveReinforcementLoaded_ReturnValue; // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_233[0x1];                                      // 0x0233(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_StartReinforcementsWave_ReturnValue;      // 0x0238(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_10;                // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1) == 0x000010, "Wrong alignment on btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1");
static_assert(sizeof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1) == 0x000270, "Wrong size on btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, EntryPoint) == 0x000000, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::EntryPoint' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Multiply_IntInt_ReturnValue) == 0x000024, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000028, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Mid_ReturnValue) == 0x000030, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Mid_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Mid_ReturnValue_1) == 0x000048, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Mid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Conv_StringToInt_ReturnValue) == 0x000058, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Clamp_ReturnValue) == 0x00005C, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Multiply_IntInt_ReturnValue_2) == 0x000060, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Multiply_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Mid_ReturnValue_2) == 0x000068, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Mid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Add_IntInt_ReturnValue_1) == 0x000078, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Conv_StringToInt_ReturnValue_1) == 0x00007C, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Conv_StringToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000080, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Multiply_IntInt_ReturnValue_3) == 0x000090, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Multiply_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Concat_StrStr_ReturnValue) == 0x000098, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000A8, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000B0, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000C0, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_SelectInt_ReturnValue) == 0x0000C4, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000C8, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Multiply_IntInt_ReturnValue_4) == 0x0000CC, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Multiply_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Conv_IntToString_ReturnValue_2) == 0x0000D0, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000E0, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000E8, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Conv_StringToName_ReturnValue) == 0x0000F8, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, K2Node_Event_battleScenenBPName) == 0x000100, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::K2Node_Event_battleScenenBPName' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, K2Node_Event_territoryID) == 0x000108, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::K2Node_Event_territoryID' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_GetEndTargetPointTransform_ReturnValue) == 0x000110, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_GetEndTargetPointTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, Temp_int_Array_Index_Variable_1) == 0x000140, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_BreakTransform_Location) == 0x000144, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_BreakTransform_Rotation) == 0x000150, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_BreakTransform_Scale) == 0x00015C, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Multiply_VectorInt_ReturnValue) == 0x000168, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Multiply_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Add_VectorVector_ReturnValue) == 0x000174, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_MakeTransform_ReturnValue) == 0x000180, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001B0, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, Temp_int_Variable) == 0x0001B4, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Array_Length_ReturnValue) == 0x0001B8, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Add_IntInt_ReturnValue_5) == 0x0001BC, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Array_Get_Item) == 0x0001C0, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_GetCharaFromActorName_ReturnValue) == 0x0001C8, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_GetCharaFromActorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_PlayEffect_ReturnValue) == 0x0001D0, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_PlayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Array_Length_ReturnValue_1) == 0x0001D4, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Array_Get_Item_1) == 0x0001D8, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_IsStoryFlag_ReturnValue) == 0x0001E0, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_IsStoryFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_IsStoryFlag_ReturnValue_1) == 0x0001E1, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_IsStoryFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Array_Length_ReturnValue_2) == 0x0001E4, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Add_IntInt_ReturnValue_6) == 0x0001E8, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_SelectInt_ReturnValue_1) == 0x0001EC, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, Temp_int_Loop_Counter_Variable) == 0x0001F0, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Less_IntInt_ReturnValue) == 0x0001F4, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Add_IntInt_ReturnValue_7) == 0x0001F8, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_BooleanAND_ReturnValue) == 0x0001FC, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, Temp_int_Loop_Counter_Variable_1) == 0x000200, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Less_IntInt_ReturnValue_1) == 0x000204, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_SelectInt_ReturnValue_2) == 0x000208, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Add_IntInt_ReturnValue_8) == 0x00020C, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Add_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Add_IntInt_ReturnValue_9) == 0x000210, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Add_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, Temp_int_Variable_1) == 0x000214, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_GetBattleSceneCount_ReturnValue) == 0x000218, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_GetBattleSceneCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00021C, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00021D, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Less_IntInt_ReturnValue_2) == 0x00021E, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, Temp_int_Array_Index_Variable_2) == 0x000220, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000224, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Array_Get_Item_2) == 0x000228, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_IsPreloadedWaveReinforcementLoaded_ReturnValue) == 0x000230, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_IsPreloadedWaveReinforcementLoaded_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Not_PreBool_ReturnValue_1) == 0x000231, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_BooleanAND_ReturnValue_1) == 0x000232, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, Temp_int_Loop_Counter_Variable_2) == 0x000234, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_StartReinforcementsWave_ReturnValue) == 0x000238, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_StartReinforcementsWave_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Less_IntInt_ReturnValue_3) == 0x000248, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Add_IntInt_ReturnValue_10) == 0x00024C, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Add_IntInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000250, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000260, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_ExecuteUbergraph_btsc_2200_CORLA_Corla_CactuarMission1::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");

// Function btsc_2200-CORLA_Corla_CactuarMission1.btsc_2200-CORLA_Corla_CactuarMission1_C.OnEntryBattleScene
// 0x0010 (0x0010 - 0x0000)
struct btsc_2200_CORLA_Corla_CactuarMission1_C_OnEntryBattleScene final
{
public:
	class FName                                   battleScenenBPName;                                // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   territoryID;                                       // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_2200_CORLA_Corla_CactuarMission1_C_OnEntryBattleScene) == 0x000004, "Wrong alignment on btsc_2200_CORLA_Corla_CactuarMission1_C_OnEntryBattleScene");
static_assert(sizeof(btsc_2200_CORLA_Corla_CactuarMission1_C_OnEntryBattleScene) == 0x000010, "Wrong size on btsc_2200_CORLA_Corla_CactuarMission1_C_OnEntryBattleScene");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_OnEntryBattleScene, battleScenenBPName) == 0x000000, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_OnEntryBattleScene::battleScenenBPName' has a wrong offset!");
static_assert(offsetof(btsc_2200_CORLA_Corla_CactuarMission1_C_OnEntryBattleScene, territoryID) == 0x000008, "Member 'btsc_2200_CORLA_Corla_CactuarMission1_C_OnEntryBattleScene::territoryID' has a wrong offset!");

}

