#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: btsc_COMMON_ColosseumExcitement

#include "Basic.hpp"

#include "EndDataBase_structs.hpp"


namespace SDK::Params
{

// Function btsc_COMMON_ColosseumExcitement.btsc_COMMON_ColosseumExcitement_C.ExecuteUbergraph_btsc_COMMON_ColosseumExcitement
// 0x0040 (0x0040 - 0x0000)
struct btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEnemyMemberCount_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_CauserCharaName;                      // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_TargetCharaName;                      // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleCountLogType                        K2Node_Event_Type;                                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ID;                                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Count;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharaFromActorName_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayer_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement) == 0x000008, "Wrong alignment on btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement");
static_assert(sizeof(btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement) == 0x000040, "Wrong size on btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement, EntryPoint) == 0x000000, "Member 'btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement::EntryPoint' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement, CallFunc_GetEnemyMemberCount_ReturnValue) == 0x000004, "Member 'btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement::CallFunc_GetEnemyMemberCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement, K2Node_Event_CauserCharaName) == 0x00000C, "Member 'btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement::K2Node_Event_CauserCharaName' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement, K2Node_Event_TargetCharaName) == 0x000014, "Member 'btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement::K2Node_Event_TargetCharaName' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement, K2Node_Event_Type) == 0x00001C, "Member 'btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement, K2Node_Event_ID) == 0x000020, "Member 'btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement::K2Node_Event_ID' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement, K2Node_Event_Count) == 0x000028, "Member 'btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement::K2Node_Event_Count' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00002C, "Member 'btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement, K2Node_SwitchName_CmpSuccess) == 0x00002D, "Member 'btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement, K2Node_SwitchEnum_CmpSuccess) == 0x00002E, "Member 'btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement, CallFunc_GetCharaFromActorName_ReturnValue) == 0x000030, "Member 'btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement::CallFunc_GetCharaFromActorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement, CallFunc_IsPlayer_ReturnValue) == 0x000038, "Member 'btsc_COMMON_ColosseumExcitement_C_ExecuteUbergraph_btsc_COMMON_ColosseumExcitement::CallFunc_IsPlayer_ReturnValue' has a wrong offset!");

// Function btsc_COMMON_ColosseumExcitement.btsc_COMMON_ColosseumExcitement_C.OnIncrementBattleCountPerID
// 0x0020 (0x0020 - 0x0000)
struct btsc_COMMON_ColosseumExcitement_C_OnIncrementBattleCountPerID final
{
public:
	class FName                                   CauserCharaName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TargetCharaName;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleCountLogType                        Type;                                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ID;                                                // 0x0014(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_COMMON_ColosseumExcitement_C_OnIncrementBattleCountPerID) == 0x000004, "Wrong alignment on btsc_COMMON_ColosseumExcitement_C_OnIncrementBattleCountPerID");
static_assert(sizeof(btsc_COMMON_ColosseumExcitement_C_OnIncrementBattleCountPerID) == 0x000020, "Wrong size on btsc_COMMON_ColosseumExcitement_C_OnIncrementBattleCountPerID");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_OnIncrementBattleCountPerID, CauserCharaName) == 0x000000, "Member 'btsc_COMMON_ColosseumExcitement_C_OnIncrementBattleCountPerID::CauserCharaName' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_OnIncrementBattleCountPerID, TargetCharaName) == 0x000008, "Member 'btsc_COMMON_ColosseumExcitement_C_OnIncrementBattleCountPerID::TargetCharaName' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_OnIncrementBattleCountPerID, Type) == 0x000010, "Member 'btsc_COMMON_ColosseumExcitement_C_OnIncrementBattleCountPerID::Type' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_OnIncrementBattleCountPerID, ID) == 0x000014, "Member 'btsc_COMMON_ColosseumExcitement_C_OnIncrementBattleCountPerID::ID' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_ColosseumExcitement_C_OnIncrementBattleCountPerID, Count) == 0x00001C, "Member 'btsc_COMMON_ColosseumExcitement_C_OnIncrementBattleCountPerID::Count' has a wrong offset!");

}

