#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: btsc_COMMON_DualSummonBtl

#include "Basic.hpp"

#include "EndDataBase_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function btsc_COMMON_DualSummonBtl.btsc_COMMON_DualSummonBtl_C.ExecuteUbergraph_btsc_COMMON_DualSummonBtl
// 0x0168 (0x0168 - 0x0000)
struct btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          K2Node_Event_SendCharacter;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Message;                              // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CauserCharaName_1;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_TargetCharaName;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleCountLogType                        K2Node_Event_Type;                                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ID;                                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Count;                                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetActorName_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Damage;                               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CauserCharaName;                      // 0x0084(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_DamagedCharaName;                     // 0x008C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AbilityID;                            // 0x0094(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBind;                                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bGuard;                               // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_HitBoneName;                          // 0x00A0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAttributeHit;                        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bResistHit;                           // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_DamageSourceID;                       // 0x00AC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAttributeType                       K2Node_Event_appendAttribute;                      // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_JustHitRotYaw;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitPosition;                          // 0x00BC(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHeal;                                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBurst;                               // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_block;                                // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharaFromActorName_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasStatusChangeID_ReturnValue;            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHPPercent_ReturnValue;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayer_ReturnValue;                     // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AEndCharacter*>                  CallFunc_GetPartyMembersIgnoreDead_ReturnValue;    // 0x00E8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue_1;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AEndCharacter*>                  CallFunc_GetEnemyAIGroupMembers_ReturnValue;       // 0x0118(0x0010)(ReferenceParm)
	class AEndCharacter*                          CallFunc_GetNearestCharacter_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActorName_ReturnValue_1;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl) == 0x000008, "Wrong alignment on btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl");
static_assert(sizeof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl) == 0x000168, "Wrong size on btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, EntryPoint) == 0x000000, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::EntryPoint' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_GetPartyLeader_ReturnValue) == 0x000008, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_GetPartyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_SendCharacter) == 0x000010, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_SendCharacter' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_Message) == 0x000018, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_CauserCharaName_1) == 0x000020, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_CauserCharaName_1' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_TargetCharaName) == 0x000028, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_TargetCharaName' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_Type) == 0x000030, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_ID) == 0x000034, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_ID' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_Count) == 0x00003C, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_Count' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_SwitchName_CmpSuccess) == 0x000040, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000041, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_SwitchEnum_CmpSuccess) == 0x000042, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_SwitchName_CmpSuccess_1) == 0x000043, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_SwitchName_CmpSuccess_2) == 0x000044, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_SwitchName_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_GetActorName_ReturnValue) == 0x000048, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_GetActorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_Conv_NameToString_ReturnValue) == 0x000050, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000070, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_Damage) == 0x000080, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_CauserCharaName) == 0x000084, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_CauserCharaName' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_DamagedCharaName) == 0x00008C, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_DamagedCharaName' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_AbilityID) == 0x000094, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_AbilityID' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_bBind) == 0x00009C, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_bBind' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_bGuard) == 0x00009D, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_bGuard' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_HitBoneName) == 0x0000A0, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_HitBoneName' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_bAttributeHit) == 0x0000A8, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_bAttributeHit' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_bResistHit) == 0x0000A9, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_bResistHit' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_DamageSourceID) == 0x0000AC, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_DamageSourceID' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_appendAttribute) == 0x0000B4, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_appendAttribute' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_JustHitRotYaw) == 0x0000B8, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_JustHitRotYaw' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_HitPosition) == 0x0000BC, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_HitPosition' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_bHeal) == 0x0000C8, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_bHeal' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_bBurst) == 0x0000C9, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_bBurst' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, K2Node_Event_block) == 0x0000CA, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::K2Node_Event_block' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_Not_PreBool_ReturnValue) == 0x0000CB, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_GetCharaFromActorName_ReturnValue) == 0x0000D0, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_GetCharaFromActorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_HasStatusChangeID_ReturnValue) == 0x0000D8, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_HasStatusChangeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_GetHPPercent_ReturnValue) == 0x0000DC, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_GetHPPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000E0, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000E1, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_IsPlayer_ReturnValue) == 0x0000E2, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_IsPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_BooleanAND_ReturnValue) == 0x0000E3, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_BooleanAND_ReturnValue_1) == 0x0000E4, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_BooleanAND_ReturnValue_2) == 0x0000E5, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_GetPartyMembersIgnoreDead_ReturnValue) == 0x0000E8, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_GetPartyMembersIgnoreDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0000FC, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_BooleanOR_ReturnValue) == 0x0000FD, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_GetPartyLeader_ReturnValue_1) == 0x000100, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_GetPartyLeader_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000108, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_GetEnemyAIGroupMembers_ReturnValue) == 0x000118, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_GetEnemyAIGroupMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_GetNearestCharacter_ReturnValue) == 0x000128, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_GetNearestCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_GetActorName_ReturnValue_1) == 0x000130, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_GetActorName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000138, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000148, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000158, "Member 'btsc_COMMON_DualSummonBtl_C_ExecuteUbergraph_btsc_COMMON_DualSummonBtl::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

// Function btsc_COMMON_DualSummonBtl.btsc_COMMON_DualSummonBtl_C.OnTakeDamage
// 0x004C (0x004C - 0x0000)
struct btsc_COMMON_DualSummonBtl_C_OnTakeDamage final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CauserCharaName;                                   // 0x0004(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DamagedCharaName;                                  // 0x000C(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AbilityId;                                         // 0x0014(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBind;                                             // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bGuard;                                            // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   hitBoneName;                                       // 0x0020(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAttributeHit;                                     // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bResistHit;                                        // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DamageSourceID;                                    // 0x002C(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAttributeType                       appendAttribute;                                   // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         justHitRotYaw;                                     // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                hitPosition;                                       // 0x003C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHeal;                                             // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bBurst;                                            // 0x0049(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLock;                                             // 0x004A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage) == 0x000004, "Wrong alignment on btsc_COMMON_DualSummonBtl_C_OnTakeDamage");
static_assert(sizeof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage) == 0x00004C, "Wrong size on btsc_COMMON_DualSummonBtl_C_OnTakeDamage");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, Damage) == 0x000000, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::Damage' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, CauserCharaName) == 0x000004, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::CauserCharaName' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, DamagedCharaName) == 0x00000C, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::DamagedCharaName' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, AbilityId) == 0x000014, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::AbilityId' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, bBind) == 0x00001C, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::bBind' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, bGuard) == 0x00001D, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::bGuard' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, hitBoneName) == 0x000020, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::hitBoneName' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, bAttributeHit) == 0x000028, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::bAttributeHit' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, bResistHit) == 0x000029, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::bResistHit' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, DamageSourceID) == 0x00002C, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::DamageSourceID' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, appendAttribute) == 0x000034, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::appendAttribute' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, justHitRotYaw) == 0x000038, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::justHitRotYaw' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, hitPosition) == 0x00003C, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::hitPosition' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, bHeal) == 0x000048, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::bHeal' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, bBurst) == 0x000049, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::bBurst' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnTakeDamage, bLock) == 0x00004A, "Member 'btsc_COMMON_DualSummonBtl_C_OnTakeDamage::bLock' has a wrong offset!");

// Function btsc_COMMON_DualSummonBtl.btsc_COMMON_DualSummonBtl_C.OnIncrementBattleCountPerID
// 0x0020 (0x0020 - 0x0000)
struct btsc_COMMON_DualSummonBtl_C_OnIncrementBattleCountPerID final
{
public:
	class FName                                   CauserCharaName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TargetCharaName;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleCountLogType                        Type;                                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ID;                                                // 0x0014(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_COMMON_DualSummonBtl_C_OnIncrementBattleCountPerID) == 0x000004, "Wrong alignment on btsc_COMMON_DualSummonBtl_C_OnIncrementBattleCountPerID");
static_assert(sizeof(btsc_COMMON_DualSummonBtl_C_OnIncrementBattleCountPerID) == 0x000020, "Wrong size on btsc_COMMON_DualSummonBtl_C_OnIncrementBattleCountPerID");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnIncrementBattleCountPerID, CauserCharaName) == 0x000000, "Member 'btsc_COMMON_DualSummonBtl_C_OnIncrementBattleCountPerID::CauserCharaName' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnIncrementBattleCountPerID, TargetCharaName) == 0x000008, "Member 'btsc_COMMON_DualSummonBtl_C_OnIncrementBattleCountPerID::TargetCharaName' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnIncrementBattleCountPerID, Type) == 0x000010, "Member 'btsc_COMMON_DualSummonBtl_C_OnIncrementBattleCountPerID::Type' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnIncrementBattleCountPerID, ID) == 0x000014, "Member 'btsc_COMMON_DualSummonBtl_C_OnIncrementBattleCountPerID::ID' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnIncrementBattleCountPerID, Count) == 0x00001C, "Member 'btsc_COMMON_DualSummonBtl_C_OnIncrementBattleCountPerID::Count' has a wrong offset!");

// Function btsc_COMMON_DualSummonBtl.btsc_COMMON_DualSummonBtl_C.OnBPMessageFromAIBP
// 0x0010 (0x0010 - 0x0000)
struct btsc_COMMON_DualSummonBtl_C_OnBPMessageFromAIBP final
{
public:
	class AEndCharacter*                          SendCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Message;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_COMMON_DualSummonBtl_C_OnBPMessageFromAIBP) == 0x000008, "Wrong alignment on btsc_COMMON_DualSummonBtl_C_OnBPMessageFromAIBP");
static_assert(sizeof(btsc_COMMON_DualSummonBtl_C_OnBPMessageFromAIBP) == 0x000010, "Wrong size on btsc_COMMON_DualSummonBtl_C_OnBPMessageFromAIBP");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnBPMessageFromAIBP, SendCharacter) == 0x000000, "Member 'btsc_COMMON_DualSummonBtl_C_OnBPMessageFromAIBP::SendCharacter' has a wrong offset!");
static_assert(offsetof(btsc_COMMON_DualSummonBtl_C_OnBPMessageFromAIBP, Message) == 0x000008, "Member 'btsc_COMMON_DualSummonBtl_C_OnBPMessageFromAIBP::Message' has a wrong offset!");

}

