#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: btsc_2660_NIBLM_EB2000

#include "Basic.hpp"

#include "EndDataBase_structs.hpp"
#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass btsc_2660-NIBLM_EB2000.btsc_2660-NIBLM_EB2000_C
// 0x0020 (0x0350 - 0x0330)
class Abtsc_2660_NIBLM_EB2000_C final : public AEndBattleSceneBlueprint_2660_NIBLM_EB2000
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         NormalAttackCount;                                 // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DamageTalk;                                        // 0x0344(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CheckClear;                                        // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_btsc_2660_NIBLM_EB2000(int32 EntryPoint);
	void OnBattleTalkInterrupted(class FName TalkID, EEndBattleTalkInterruptReason SkipReason);
	void ChangePhase(int32 _phase);
	void OnIncrementBattleCountPerID(class FName CauserCharaName, class FName TargetCharaName, EEndBattleCountLogType Type, class FName ID, int32 Count);
	void OnTakeDamage(int32 Damage, const class FName& CauserCharaName, const class FName& DamagedCharaName, const class FName& AbilityId, bool bBind, bool bGuard, const class FName& hitBoneName, bool bAttributeHit, bool bResistHit, const class FName& DamageSourceID, EEndBattleAttributeType appendAttribute, float justHitRotYaw, const struct FVector& hitPosition, bool bHeal, bool bBurst, bool bLock);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"btsc_2660-NIBLM_EB2000_C">();
	}
	static class Abtsc_2660_NIBLM_EB2000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abtsc_2660_NIBLM_EB2000_C>();
	}
};
static_assert(alignof(Abtsc_2660_NIBLM_EB2000_C) == 0x000008, "Wrong alignment on Abtsc_2660_NIBLM_EB2000_C");
static_assert(sizeof(Abtsc_2660_NIBLM_EB2000_C) == 0x000350, "Wrong size on Abtsc_2660_NIBLM_EB2000_C");
static_assert(offsetof(Abtsc_2660_NIBLM_EB2000_C, UberGraphFrame) == 0x000330, "Member 'Abtsc_2660_NIBLM_EB2000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Abtsc_2660_NIBLM_EB2000_C, DefaultSceneRoot) == 0x000338, "Member 'Abtsc_2660_NIBLM_EB2000_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(Abtsc_2660_NIBLM_EB2000_C, NormalAttackCount) == 0x000340, "Member 'Abtsc_2660_NIBLM_EB2000_C::NormalAttackCount' has a wrong offset!");
static_assert(offsetof(Abtsc_2660_NIBLM_EB2000_C, DamageTalk) == 0x000344, "Member 'Abtsc_2660_NIBLM_EB2000_C::DamageTalk' has a wrong offset!");
static_assert(offsetof(Abtsc_2660_NIBLM_EB2000_C, CheckClear) == 0x000348, "Member 'Abtsc_2660_NIBLM_EB2000_C::CheckClear' has a wrong offset!");

}

