#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: btsc_2660NIBLM_Before_mob_04

#include "Basic.hpp"


namespace SDK::Params
{

// Function btsc_2660NIBLM_Before_mob_04.btsc_2660NIBLM_Before_mob_04_C.ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04
// 0x0078 (0x0078 - 0x0000)
struct btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_cutSceneID;                           // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_battleScenenBPName;                   // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_territoryID;                          // 0x0014(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04) == 0x000008, "Wrong alignment on btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04");
static_assert(sizeof(btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04) == 0x000078, "Wrong size on btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04");
static_assert(offsetof(btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04, EntryPoint) == 0x000000, "Member 'btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04::EntryPoint' has a wrong offset!");
static_assert(offsetof(btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04, K2Node_Event_cutSceneID) == 0x000004, "Member 'btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04::K2Node_Event_cutSceneID' has a wrong offset!");
static_assert(offsetof(btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04, K2Node_Event_battleScenenBPName) == 0x00000C, "Member 'btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04::K2Node_Event_battleScenenBPName' has a wrong offset!");
static_assert(offsetof(btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04, K2Node_Event_territoryID) == 0x000014, "Member 'btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04::K2Node_Event_territoryID' has a wrong offset!");
static_assert(offsetof(btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04, CallFunc_GetPartyLeader_ReturnValue) == 0x000020, "Member 'btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04::CallFunc_GetPartyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04, CallFunc_Conv_NameToString_ReturnValue) == 0x000028, "Member 'btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000058, "Member 'btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000068, "Member 'btsc_2660NIBLM_Before_mob_04_C_ExecuteUbergraph_btsc_2660NIBLM_Before_mob_04::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function btsc_2660NIBLM_Before_mob_04.btsc_2660NIBLM_Before_mob_04_C.OnBeginCutScene
// 0x0008 (0x0008 - 0x0000)
struct btsc_2660NIBLM_Before_mob_04_C_OnBeginCutScene final
{
public:
	class FName                                   CutSceneID;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_2660NIBLM_Before_mob_04_C_OnBeginCutScene) == 0x000004, "Wrong alignment on btsc_2660NIBLM_Before_mob_04_C_OnBeginCutScene");
static_assert(sizeof(btsc_2660NIBLM_Before_mob_04_C_OnBeginCutScene) == 0x000008, "Wrong size on btsc_2660NIBLM_Before_mob_04_C_OnBeginCutScene");
static_assert(offsetof(btsc_2660NIBLM_Before_mob_04_C_OnBeginCutScene, CutSceneID) == 0x000000, "Member 'btsc_2660NIBLM_Before_mob_04_C_OnBeginCutScene::CutSceneID' has a wrong offset!");

// Function btsc_2660NIBLM_Before_mob_04.btsc_2660NIBLM_Before_mob_04_C.OnEntryBattleScene
// 0x0010 (0x0010 - 0x0000)
struct btsc_2660NIBLM_Before_mob_04_C_OnEntryBattleScene final
{
public:
	class FName                                   battleScenenBPName;                                // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   territoryID;                                       // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_2660NIBLM_Before_mob_04_C_OnEntryBattleScene) == 0x000004, "Wrong alignment on btsc_2660NIBLM_Before_mob_04_C_OnEntryBattleScene");
static_assert(sizeof(btsc_2660NIBLM_Before_mob_04_C_OnEntryBattleScene) == 0x000010, "Wrong size on btsc_2660NIBLM_Before_mob_04_C_OnEntryBattleScene");
static_assert(offsetof(btsc_2660NIBLM_Before_mob_04_C_OnEntryBattleScene, battleScenenBPName) == 0x000000, "Member 'btsc_2660NIBLM_Before_mob_04_C_OnEntryBattleScene::battleScenenBPName' has a wrong offset!");
static_assert(offsetof(btsc_2660NIBLM_Before_mob_04_C_OnEntryBattleScene, territoryID) == 0x000008, "Member 'btsc_2660NIBLM_Before_mob_04_C_OnEntryBattleScene::territoryID' has a wrong offset!");

}

