#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Burst_In

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Burst_In.Burst_In_C
// 0x0028 (0x03F0 - 0x03C8)
class UBurst_In_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Transform;                                         // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_BurstText;                               // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_EffectBG;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Burst_In_C">();
	}
	static class UBurst_In_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBurst_In_C>();
	}
};
static_assert(alignof(UBurst_In_C) == 0x000008, "Wrong alignment on UBurst_In_C");
static_assert(sizeof(UBurst_In_C) == 0x0003F0, "Wrong size on UBurst_In_C");
static_assert(offsetof(UBurst_In_C, Out) == 0x0003C8, "Member 'UBurst_In_C::Out' has a wrong offset!");
static_assert(offsetof(UBurst_In_C, Transform) == 0x0003D0, "Member 'UBurst_In_C::Transform' has a wrong offset!");
static_assert(offsetof(UBurst_In_C, In) == 0x0003D8, "Member 'UBurst_In_C::In' has a wrong offset!");
static_assert(offsetof(UBurst_In_C, Billboard_BurstText) == 0x0003E0, "Member 'UBurst_In_C::Billboard_BurstText' has a wrong offset!");
static_assert(offsetof(UBurst_In_C, Img_EffectBG) == 0x0003E8, "Member 'UBurst_In_C::Img_EffectBG' has a wrong offset!");

}

