#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraPlayerRank

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CameraPlayerRank.CameraPlayerRank_C
// 0x0048 (0x0410 - 0x03C8)
class UCameraPlayerRank_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RankUp;                                            // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_00;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_RankUp;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Effect_Light_00a;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Effect_Light_00b;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Light_03;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Reflection;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CameraPlayerRank_C">();
	}
	static class UCameraPlayerRank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraPlayerRank_C>();
	}
};
static_assert(alignof(UCameraPlayerRank_C) == 0x000008, "Wrong alignment on UCameraPlayerRank_C");
static_assert(sizeof(UCameraPlayerRank_C) == 0x000410, "Wrong size on UCameraPlayerRank_C");
static_assert(offsetof(UCameraPlayerRank_C, Out) == 0x0003C8, "Member 'UCameraPlayerRank_C::Out' has a wrong offset!");
static_assert(offsetof(UCameraPlayerRank_C, RankUp) == 0x0003D0, "Member 'UCameraPlayerRank_C::RankUp' has a wrong offset!");
static_assert(offsetof(UCameraPlayerRank_C, In) == 0x0003D8, "Member 'UCameraPlayerRank_C::In' has a wrong offset!");
static_assert(offsetof(UCameraPlayerRank_C, Base_00) == 0x0003E0, "Member 'UCameraPlayerRank_C::Base_00' has a wrong offset!");
static_assert(offsetof(UCameraPlayerRank_C, Base_RankUp) == 0x0003E8, "Member 'UCameraPlayerRank_C::Base_RankUp' has a wrong offset!");
static_assert(offsetof(UCameraPlayerRank_C, Effect_Light_00a) == 0x0003F0, "Member 'UCameraPlayerRank_C::Effect_Light_00a' has a wrong offset!");
static_assert(offsetof(UCameraPlayerRank_C, Effect_Light_00b) == 0x0003F8, "Member 'UCameraPlayerRank_C::Effect_Light_00b' has a wrong offset!");
static_assert(offsetof(UCameraPlayerRank_C, Effect_Light_03) == 0x000400, "Member 'UCameraPlayerRank_C::Effect_Light_03' has a wrong offset!");
static_assert(offsetof(UCameraPlayerRank_C, Effect_Reflection) == 0x000408, "Member 'UCameraPlayerRank_C::Effect_Reflection' has a wrong offset!");

}

