#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CategorySwitch2_Cell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CategorySwitch2_Cell.CategorySwitch2_Cell_C
// 0x0028 (0x0410 - 0x03E8)
class UCategorySwitch2_Cell_C final : public UEndCategorySwitch2Cell
{
public:
	class UWidgetAnimation*                       Selected;                                          // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_Blue;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Blue_1;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Blue_2;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_34;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CategorySwitch2_Cell_C">();
	}
	static class UCategorySwitch2_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCategorySwitch2_Cell_C>();
	}
};
static_assert(alignof(UCategorySwitch2_Cell_C) == 0x000008, "Wrong alignment on UCategorySwitch2_Cell_C");
static_assert(sizeof(UCategorySwitch2_Cell_C) == 0x000410, "Wrong size on UCategorySwitch2_Cell_C");
static_assert(offsetof(UCategorySwitch2_Cell_C, Selected) == 0x0003E8, "Member 'UCategorySwitch2_Cell_C::Selected' has a wrong offset!");
static_assert(offsetof(UCategorySwitch2_Cell_C, Base_Blue) == 0x0003F0, "Member 'UCategorySwitch2_Cell_C::Base_Blue' has a wrong offset!");
static_assert(offsetof(UCategorySwitch2_Cell_C, Base_Blue_1) == 0x0003F8, "Member 'UCategorySwitch2_Cell_C::Base_Blue_1' has a wrong offset!");
static_assert(offsetof(UCategorySwitch2_Cell_C, Base_Blue_2) == 0x000400, "Member 'UCategorySwitch2_Cell_C::Base_Blue_2' has a wrong offset!");
static_assert(offsetof(UCategorySwitch2_Cell_C, EndImage_34) == 0x000408, "Member 'UCategorySwitch2_Cell_C::EndImage_34' has a wrong offset!");

}

