#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboCatching_Status_00

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboCatching_Status_00.ChocoboCatching_Status_00_C
// 0x0088 (0x04C0 - 0x0438)
class UChocoboCatching_Status_00_C final : public UEndChocoboCaptureHeadMenu
{
public:
	class UWidgetAnimation*                       IconFlicker_InOut;                                 // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Icon_InOut;                                        // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Icon_Flicker;                                      // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChickenLure_SpeedMax;                              // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChickenLure_Touch;                                 // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChickenLure_SpeedUp;                               // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChickenLure;                                       // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              FailIcon_1;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FailIcon_2;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FailIcon_3;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           Gauge_00;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_02;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Status_00;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_GaugeBase_00;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_GaugeBase_01;                                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboCatching_Status_00_C">();
	}
	static class UChocoboCatching_Status_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboCatching_Status_00_C>();
	}
};
static_assert(alignof(UChocoboCatching_Status_00_C) == 0x000008, "Wrong alignment on UChocoboCatching_Status_00_C");
static_assert(sizeof(UChocoboCatching_Status_00_C) == 0x0004C0, "Wrong size on UChocoboCatching_Status_00_C");
static_assert(offsetof(UChocoboCatching_Status_00_C, IconFlicker_InOut) == 0x000438, "Member 'UChocoboCatching_Status_00_C::IconFlicker_InOut' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, Icon_InOut) == 0x000440, "Member 'UChocoboCatching_Status_00_C::Icon_InOut' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, Icon_Flicker) == 0x000448, "Member 'UChocoboCatching_Status_00_C::Icon_Flicker' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, ChickenLure_SpeedMax) == 0x000450, "Member 'UChocoboCatching_Status_00_C::ChickenLure_SpeedMax' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, ChickenLure_Touch) == 0x000458, "Member 'UChocoboCatching_Status_00_C::ChickenLure_Touch' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, ChickenLure_SpeedUp) == 0x000460, "Member 'UChocoboCatching_Status_00_C::ChickenLure_SpeedUp' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, ChickenLure) == 0x000468, "Member 'UChocoboCatching_Status_00_C::ChickenLure' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, In) == 0x000470, "Member 'UChocoboCatching_Status_00_C::In' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, FailIcon_1) == 0x000478, "Member 'UChocoboCatching_Status_00_C::FailIcon_1' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, FailIcon_2) == 0x000480, "Member 'UChocoboCatching_Status_00_C::FailIcon_2' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, FailIcon_3) == 0x000488, "Member 'UChocoboCatching_Status_00_C::FailIcon_3' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, Gauge_00) == 0x000490, "Member 'UChocoboCatching_Status_00_C::Gauge_00' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, Gauge_02) == 0x000498, "Member 'UChocoboCatching_Status_00_C::Gauge_02' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, Icon_Status_00) == 0x0004A0, "Member 'UChocoboCatching_Status_00_C::Icon_Status_00' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, Img_GaugeBase_00) == 0x0004A8, "Member 'UChocoboCatching_Status_00_C::Img_GaugeBase_00' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, Img_GaugeBase_01) == 0x0004B0, "Member 'UChocoboCatching_Status_00_C::Img_GaugeBase_01' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Status_00_C, Light) == 0x0004B8, "Member 'UChocoboCatching_Status_00_C::Light' has a wrong offset!");

}

