#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboCarriage_Cell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboCarriage_Cell.ChocoboCarriage_Cell_C
// 0x0050 (0x0418 - 0x03C8)
class UChocoboCarriage_Cell_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       BtnCurrentHover;                                   // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnNormal;                                         // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnCurrent;                                        // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnNormalHover;                                    // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndButton*                             Btn_List;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverLight;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Now_C*                   Icon_Now;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Name;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Value_1;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboCarriage_Cell_C">();
	}
	static class UChocoboCarriage_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboCarriage_Cell_C>();
	}
};
static_assert(alignof(UChocoboCarriage_Cell_C) == 0x000008, "Wrong alignment on UChocoboCarriage_Cell_C");
static_assert(sizeof(UChocoboCarriage_Cell_C) == 0x000418, "Wrong size on UChocoboCarriage_Cell_C");
static_assert(offsetof(UChocoboCarriage_Cell_C, BtnCurrentHover) == 0x0003C8, "Member 'UChocoboCarriage_Cell_C::BtnCurrentHover' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Cell_C, BtnNormal) == 0x0003D0, "Member 'UChocoboCarriage_Cell_C::BtnNormal' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Cell_C, BtnCurrent) == 0x0003D8, "Member 'UChocoboCarriage_Cell_C::BtnCurrent' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Cell_C, BtnNormalHover) == 0x0003E0, "Member 'UChocoboCarriage_Cell_C::BtnNormalHover' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Cell_C, Btn_List) == 0x0003E8, "Member 'UChocoboCarriage_Cell_C::Btn_List' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Cell_C, BtnBase) == 0x0003F0, "Member 'UChocoboCarriage_Cell_C::BtnBase' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Cell_C, HoverLight) == 0x0003F8, "Member 'UChocoboCarriage_Cell_C::HoverLight' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Cell_C, Icon_Now) == 0x000400, "Member 'UChocoboCarriage_Cell_C::Icon_Now' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Cell_C, Txt_Name) == 0x000408, "Member 'UChocoboCarriage_Cell_C::Txt_Name' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Cell_C, Txt_Value_1) == 0x000410, "Member 'UChocoboCarriage_Cell_C::Txt_Value_1' has a wrong offset!");

}

