#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboCatching_TargetArrow

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboCatching_TargetArrow.ChocoboCatching_TargetArrow_C
// 0x0018 (0x03E0 - 0x03C8)
class UChocoboCatching_TargetArrow_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       In;                                                // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All;                                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Cursor;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboCatching_TargetArrow_C">();
	}
	static class UChocoboCatching_TargetArrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboCatching_TargetArrow_C>();
	}
};
static_assert(alignof(UChocoboCatching_TargetArrow_C) == 0x000008, "Wrong alignment on UChocoboCatching_TargetArrow_C");
static_assert(sizeof(UChocoboCatching_TargetArrow_C) == 0x0003E0, "Wrong size on UChocoboCatching_TargetArrow_C");
static_assert(offsetof(UChocoboCatching_TargetArrow_C, In) == 0x0003C8, "Member 'UChocoboCatching_TargetArrow_C::In' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_TargetArrow_C, All) == 0x0003D0, "Member 'UChocoboCatching_TargetArrow_C::All' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_TargetArrow_C, Ims_Cursor) == 0x0003D8, "Member 'UChocoboCatching_TargetArrow_C::Ims_Cursor' has a wrong offset!");

}

