#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboCatching_ThrowModeEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboCatching_ThrowModeEffect.ChocoboCatching_ThrowModeEffect_C
// 0x0020 (0x03E8 - 0x03C8)
class UChocoboCatching_ThrowModeEffect_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Effect_Circle;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_OutLine;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChocoboCatching_ThrowModeEffect(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboCatching_ThrowModeEffect_C">();
	}
	static class UChocoboCatching_ThrowModeEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboCatching_ThrowModeEffect_C>();
	}
};
static_assert(alignof(UChocoboCatching_ThrowModeEffect_C) == 0x000008, "Wrong alignment on UChocoboCatching_ThrowModeEffect_C");
static_assert(sizeof(UChocoboCatching_ThrowModeEffect_C) == 0x0003E8, "Wrong size on UChocoboCatching_ThrowModeEffect_C");
static_assert(offsetof(UChocoboCatching_ThrowModeEffect_C, UberGraphFrame) == 0x0003C8, "Member 'UChocoboCatching_ThrowModeEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_ThrowModeEffect_C, Loop) == 0x0003D0, "Member 'UChocoboCatching_ThrowModeEffect_C::Loop' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_ThrowModeEffect_C, Effect_Circle) == 0x0003D8, "Member 'UChocoboCatching_ThrowModeEffect_C::Effect_Circle' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_ThrowModeEffect_C, Effect_OutLine) == 0x0003E0, "Member 'UChocoboCatching_ThrowModeEffect_C::Effect_OutLine' has a wrong offset!");

}

