#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboCatching_Target

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboCatching_Target.ChocoboCatching_Target_C
// 0x00D0 (0x0498 - 0x03C8)
class UChocoboCatching_Target_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       NoEffect_Shift;                                    // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All;                                               // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_NG_Mark;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Parts_00a;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Parts_00b;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Parts_01a;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Parts_01b;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Parts_02a;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Parts_02b;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Parts_03a;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Parts_03b;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Parts_04a;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Parts_04b;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Parts_05a;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Parts_05b;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Parts_00;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Parts_01;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Parts_02;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Parts_03;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Parts_04;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Parts_05;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Target;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_Target;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboCatching_Target_C">();
	}
	static class UChocoboCatching_Target_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboCatching_Target_C>();
	}
};
static_assert(alignof(UChocoboCatching_Target_C) == 0x000008, "Wrong alignment on UChocoboCatching_Target_C");
static_assert(sizeof(UChocoboCatching_Target_C) == 0x000498, "Wrong size on UChocoboCatching_Target_C");
static_assert(offsetof(UChocoboCatching_Target_C, NoEffect_Shift) == 0x0003C8, "Member 'UChocoboCatching_Target_C::NoEffect_Shift' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Out) == 0x0003D0, "Member 'UChocoboCatching_Target_C::Out' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Loop) == 0x0003D8, "Member 'UChocoboCatching_Target_C::Loop' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, In) == 0x0003E0, "Member 'UChocoboCatching_Target_C::In' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, All) == 0x0003E8, "Member 'UChocoboCatching_Target_C::All' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Img_NG_Mark) == 0x0003F0, "Member 'UChocoboCatching_Target_C::Img_NG_Mark' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Ims_Parts_00a) == 0x0003F8, "Member 'UChocoboCatching_Target_C::Ims_Parts_00a' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Ims_Parts_00b) == 0x000400, "Member 'UChocoboCatching_Target_C::Ims_Parts_00b' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Ims_Parts_01a) == 0x000408, "Member 'UChocoboCatching_Target_C::Ims_Parts_01a' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Ims_Parts_01b) == 0x000410, "Member 'UChocoboCatching_Target_C::Ims_Parts_01b' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Ims_Parts_02a) == 0x000418, "Member 'UChocoboCatching_Target_C::Ims_Parts_02a' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Ims_Parts_02b) == 0x000420, "Member 'UChocoboCatching_Target_C::Ims_Parts_02b' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Ims_Parts_03a) == 0x000428, "Member 'UChocoboCatching_Target_C::Ims_Parts_03a' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Ims_Parts_03b) == 0x000430, "Member 'UChocoboCatching_Target_C::Ims_Parts_03b' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Ims_Parts_04a) == 0x000438, "Member 'UChocoboCatching_Target_C::Ims_Parts_04a' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Ims_Parts_04b) == 0x000440, "Member 'UChocoboCatching_Target_C::Ims_Parts_04b' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Ims_Parts_05a) == 0x000448, "Member 'UChocoboCatching_Target_C::Ims_Parts_05a' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Ims_Parts_05b) == 0x000450, "Member 'UChocoboCatching_Target_C::Ims_Parts_05b' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Nut_Parts_00) == 0x000458, "Member 'UChocoboCatching_Target_C::Nut_Parts_00' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Nut_Parts_01) == 0x000460, "Member 'UChocoboCatching_Target_C::Nut_Parts_01' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Nut_Parts_02) == 0x000468, "Member 'UChocoboCatching_Target_C::Nut_Parts_02' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Nut_Parts_03) == 0x000470, "Member 'UChocoboCatching_Target_C::Nut_Parts_03' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Nut_Parts_04) == 0x000478, "Member 'UChocoboCatching_Target_C::Nut_Parts_04' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Nut_Parts_05) == 0x000480, "Member 'UChocoboCatching_Target_C::Nut_Parts_05' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Nut_Target) == 0x000488, "Member 'UChocoboCatching_Target_C::Nut_Target' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Target_C, Pnl_Target) == 0x000490, "Member 'UChocoboCatching_Target_C::Pnl_Target' has a wrong offset!");

}

