#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboCatching_Retry_Btn

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboCatching_Retry_Btn.ChocoboCatching_Retry_Btn_C
// 0x0038 (0x0418 - 0x03E0)
class UChocoboCatching_Retry_Btn_C final : public UEndFieldReturnFastTravelIcon
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Effect_Retry_00;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Retry_01;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           Gauge_00;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              GaugeBG;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_RetryBase;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboCatching_Retry_Btn_C">();
	}
	static class UChocoboCatching_Retry_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboCatching_Retry_Btn_C>();
	}
};
static_assert(alignof(UChocoboCatching_Retry_Btn_C) == 0x000008, "Wrong alignment on UChocoboCatching_Retry_Btn_C");
static_assert(sizeof(UChocoboCatching_Retry_Btn_C) == 0x000418, "Wrong size on UChocoboCatching_Retry_Btn_C");
static_assert(offsetof(UChocoboCatching_Retry_Btn_C, Out) == 0x0003E0, "Member 'UChocoboCatching_Retry_Btn_C::Out' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Retry_Btn_C, In) == 0x0003E8, "Member 'UChocoboCatching_Retry_Btn_C::In' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Retry_Btn_C, Effect_Retry_00) == 0x0003F0, "Member 'UChocoboCatching_Retry_Btn_C::Effect_Retry_00' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Retry_Btn_C, Effect_Retry_01) == 0x0003F8, "Member 'UChocoboCatching_Retry_Btn_C::Effect_Retry_01' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Retry_Btn_C, Gauge_00) == 0x000400, "Member 'UChocoboCatching_Retry_Btn_C::Gauge_00' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Retry_Btn_C, GaugeBG) == 0x000408, "Member 'UChocoboCatching_Retry_Btn_C::GaugeBG' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Retry_Btn_C, Img_RetryBase) == 0x000410, "Member 'UChocoboCatching_Retry_Btn_C::Img_RetryBase' has a wrong offset!");

}

