#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboCarriage_Map

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboCarriage_Map.ChocoboCarriage_Map_C
// 0x0080 (0x0448 - 0x03C8)
class UChocoboCarriage_Map_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Menu_In;                                           // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                GoldSaucer_10;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                Goldsaucer_01;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                Goldsaucer_02;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                Goldsaucer_03;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                Goldsaucer_04;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                Goldsaucer_05;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                Goldsaucer_06;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                Goldsaucer_07;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                Goldsaucer_08;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                Goldsaucer_09;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Map_Billboard;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light1;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light2;                                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MapBase;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MapFrame;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboCarriage_Map_C">();
	}
	static class UChocoboCarriage_Map_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboCarriage_Map_C>();
	}
};
static_assert(alignof(UChocoboCarriage_Map_C) == 0x000008, "Wrong alignment on UChocoboCarriage_Map_C");
static_assert(sizeof(UChocoboCarriage_Map_C) == 0x000448, "Wrong size on UChocoboCarriage_Map_C");
static_assert(offsetof(UChocoboCarriage_Map_C, Menu_In) == 0x0003C8, "Member 'UChocoboCarriage_Map_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, GoldSaucer_10) == 0x0003D0, "Member 'UChocoboCarriage_Map_C::GoldSaucer_10' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Goldsaucer_01) == 0x0003D8, "Member 'UChocoboCarriage_Map_C::Goldsaucer_01' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Goldsaucer_02) == 0x0003E0, "Member 'UChocoboCarriage_Map_C::Goldsaucer_02' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Goldsaucer_03) == 0x0003E8, "Member 'UChocoboCarriage_Map_C::Goldsaucer_03' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Goldsaucer_04) == 0x0003F0, "Member 'UChocoboCarriage_Map_C::Goldsaucer_04' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Goldsaucer_05) == 0x0003F8, "Member 'UChocoboCarriage_Map_C::Goldsaucer_05' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Goldsaucer_06) == 0x000400, "Member 'UChocoboCarriage_Map_C::Goldsaucer_06' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Goldsaucer_07) == 0x000408, "Member 'UChocoboCarriage_Map_C::Goldsaucer_07' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Goldsaucer_08) == 0x000410, "Member 'UChocoboCarriage_Map_C::Goldsaucer_08' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Goldsaucer_09) == 0x000418, "Member 'UChocoboCarriage_Map_C::Goldsaucer_09' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Img_Map_Billboard) == 0x000420, "Member 'UChocoboCarriage_Map_C::Img_Map_Billboard' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Light1) == 0x000428, "Member 'UChocoboCarriage_Map_C::Light1' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Light2) == 0x000430, "Member 'UChocoboCarriage_Map_C::Light2' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, MapBase) == 0x000438, "Member 'UChocoboCarriage_Map_C::MapBase' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, MapFrame) == 0x000440, "Member 'UChocoboCarriage_Map_C::MapFrame' has a wrong offset!");

}

