#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboCatching_Satus_Get

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboCatching_Satus_Get.ChocoboCatching_Satus_Get_C
// 0x0038 (0x0470 - 0x0438)
class UChocoboCatching_Satus_Get_C final : public UEndChocoboCaptureHeadMenu
{
public:
	class UWidgetAnimation*                       Get;                                               // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ciecle;                                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ciecle2;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon;                                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Eff;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboCatching_Satus_Get_C">();
	}
	static class UChocoboCatching_Satus_Get_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboCatching_Satus_Get_C>();
	}
};
static_assert(alignof(UChocoboCatching_Satus_Get_C) == 0x000008, "Wrong alignment on UChocoboCatching_Satus_Get_C");
static_assert(sizeof(UChocoboCatching_Satus_Get_C) == 0x000470, "Wrong size on UChocoboCatching_Satus_Get_C");
static_assert(offsetof(UChocoboCatching_Satus_Get_C, Get) == 0x000438, "Member 'UChocoboCatching_Satus_Get_C::Get' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Satus_Get_C, Bg) == 0x000440, "Member 'UChocoboCatching_Satus_Get_C::Bg' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Satus_Get_C, Ciecle) == 0x000448, "Member 'UChocoboCatching_Satus_Get_C::Ciecle' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Satus_Get_C, Ciecle2) == 0x000450, "Member 'UChocoboCatching_Satus_Get_C::Ciecle2' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Satus_Get_C, Icon) == 0x000458, "Member 'UChocoboCatching_Satus_Get_C::Icon' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Satus_Get_C, Icon_Eff) == 0x000460, "Member 'UChocoboCatching_Satus_Get_C::Icon_Eff' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Satus_Get_C, Light) == 0x000468, "Member 'UChocoboCatching_Satus_Get_C::Light' has a wrong offset!");

}

