#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboCatching_Command

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboCatching_Command.ChocoboCatching_Command_C
// 0x0038 (0x0448 - 0x0410)
class UChocoboCatching_Command_C final : public UEndChocoboCaptureCommandMenu
{
public:
	class UWidgetAnimation*                       CommandOpen;                                       // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UChocoboCatching_ActionCommand_00_C*    ActionCommand_00;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCatching_ActionCommand_01_C*    ActionCommand_01;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_00;                                           // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCatching_Command_Switching_C*   Command_Switching;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_00;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_GaugeBase_01;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboCatching_Command_C">();
	}
	static class UChocoboCatching_Command_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboCatching_Command_C>();
	}
};
static_assert(alignof(UChocoboCatching_Command_C) == 0x000008, "Wrong alignment on UChocoboCatching_Command_C");
static_assert(sizeof(UChocoboCatching_Command_C) == 0x000448, "Wrong size on UChocoboCatching_Command_C");
static_assert(offsetof(UChocoboCatching_Command_C, CommandOpen) == 0x000410, "Member 'UChocoboCatching_Command_C::CommandOpen' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_C, ActionCommand_00) == 0x000418, "Member 'UChocoboCatching_Command_C::ActionCommand_00' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_C, ActionCommand_01) == 0x000420, "Member 'UChocoboCatching_Command_C::ActionCommand_01' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_C, Base_00) == 0x000428, "Member 'UChocoboCatching_Command_C::Base_00' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_C, Command_Switching) == 0x000430, "Member 'UChocoboCatching_Command_C::Command_Switching' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_C, Gauge_00) == 0x000438, "Member 'UChocoboCatching_Command_C::Gauge_00' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_C, Img_GaugeBase_01) == 0x000440, "Member 'UChocoboCatching_Command_C::Img_GaugeBase_01' has a wrong offset!");

}

