#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboCatching_Command_Switching

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboCatching_Command_Switching.ChocoboCatching_Command_Switching_C
// 0x00B8 (0x0480 - 0x03C8)
class UChocoboCatching_Command_Switching_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Throw_Disable;                                     // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Throwing_Loop;                                     // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Command_Out;                                       // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Command_In;                                        // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_Bottom;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Circle;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Deco;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_ThrowMode;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Top;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco_00;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Circle_1;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_OutLine_1;                                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              GuideBase_00;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Item;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_X_1;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_1;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_02;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line_1;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_TxtBase;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCatching_ThrowModeEffect_C*     ThrowModeEffect;                                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboCatching_Command_Switching_C">();
	}
	static class UChocoboCatching_Command_Switching_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboCatching_Command_Switching_C>();
	}
};
static_assert(alignof(UChocoboCatching_Command_Switching_C) == 0x000008, "Wrong alignment on UChocoboCatching_Command_Switching_C");
static_assert(sizeof(UChocoboCatching_Command_Switching_C) == 0x000480, "Wrong size on UChocoboCatching_Command_Switching_C");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Out) == 0x0003C8, "Member 'UChocoboCatching_Command_Switching_C::Out' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, In) == 0x0003D0, "Member 'UChocoboCatching_Command_Switching_C::In' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Throw_Disable) == 0x0003D8, "Member 'UChocoboCatching_Command_Switching_C::Throw_Disable' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Throwing_Loop) == 0x0003E0, "Member 'UChocoboCatching_Command_Switching_C::Throwing_Loop' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Command_Out) == 0x0003E8, "Member 'UChocoboCatching_Command_Switching_C::Command_Out' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Command_In) == 0x0003F0, "Member 'UChocoboCatching_Command_Switching_C::Command_In' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Base_Bottom) == 0x0003F8, "Member 'UChocoboCatching_Command_Switching_C::Base_Bottom' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Base_Circle) == 0x000400, "Member 'UChocoboCatching_Command_Switching_C::Base_Circle' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Base_Deco) == 0x000408, "Member 'UChocoboCatching_Command_Switching_C::Base_Deco' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Base_ThrowMode) == 0x000410, "Member 'UChocoboCatching_Command_Switching_C::Base_ThrowMode' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Base_Top) == 0x000418, "Member 'UChocoboCatching_Command_Switching_C::Base_Top' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Deco_00) == 0x000420, "Member 'UChocoboCatching_Command_Switching_C::Deco_00' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Effect_Circle_1) == 0x000428, "Member 'UChocoboCatching_Command_Switching_C::Effect_Circle_1' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Effect_OutLine_1) == 0x000430, "Member 'UChocoboCatching_Command_Switching_C::Effect_OutLine_1' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, GuideBase_00) == 0x000438, "Member 'UChocoboCatching_Command_Switching_C::GuideBase_00' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Icon_Item) == 0x000440, "Member 'UChocoboCatching_Command_Switching_C::Icon_Item' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Icon_X_1) == 0x000448, "Member 'UChocoboCatching_Command_Switching_C::Icon_X_1' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Img_Effect) == 0x000450, "Member 'UChocoboCatching_Command_Switching_C::Img_Effect' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Img_Effect_1) == 0x000458, "Member 'UChocoboCatching_Command_Switching_C::Img_Effect_1' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Img_Effect_02) == 0x000460, "Member 'UChocoboCatching_Command_Switching_C::Img_Effect_02' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Img_Line_1) == 0x000468, "Member 'UChocoboCatching_Command_Switching_C::Img_Line_1' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, Img_TxtBase) == 0x000470, "Member 'UChocoboCatching_Command_Switching_C::Img_TxtBase' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_Command_Switching_C, ThrowModeEffect) == 0x000478, "Member 'UChocoboCatching_Command_Switching_C::ThrowModeEffect' has a wrong offset!");

}

