#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboCatching_RetryPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboCatching_RetryPoint.ChocoboCatching_RetryPoint_C
// 0x0060 (0x0428 - 0x03C8)
class UChocoboCatching_RetryPoint_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       CheckPoint;                                        // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LoopCenter;                                        // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Bottom;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Top;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_CenterSet;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Ring;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Ring2;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Ring3;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Info;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChocoboCatching_RetryPoint(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboCatching_RetryPoint_C">();
	}
	static class UChocoboCatching_RetryPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboCatching_RetryPoint_C>();
	}
};
static_assert(alignof(UChocoboCatching_RetryPoint_C) == 0x000008, "Wrong alignment on UChocoboCatching_RetryPoint_C");
static_assert(sizeof(UChocoboCatching_RetryPoint_C) == 0x000428, "Wrong size on UChocoboCatching_RetryPoint_C");
static_assert(offsetof(UChocoboCatching_RetryPoint_C, UberGraphFrame) == 0x0003C8, "Member 'UChocoboCatching_RetryPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_RetryPoint_C, CheckPoint) == 0x0003D0, "Member 'UChocoboCatching_RetryPoint_C::CheckPoint' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_RetryPoint_C, LoopCenter) == 0x0003D8, "Member 'UChocoboCatching_RetryPoint_C::LoopCenter' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_RetryPoint_C, Base) == 0x0003E0, "Member 'UChocoboCatching_RetryPoint_C::Base' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_RetryPoint_C, Base_Bottom) == 0x0003E8, "Member 'UChocoboCatching_RetryPoint_C::Base_Bottom' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_RetryPoint_C, Base_Top) == 0x0003F0, "Member 'UChocoboCatching_RetryPoint_C::Base_Top' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_RetryPoint_C, Icon_CenterSet) == 0x0003F8, "Member 'UChocoboCatching_RetryPoint_C::Icon_CenterSet' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_RetryPoint_C, Icon_Ring) == 0x000400, "Member 'UChocoboCatching_RetryPoint_C::Icon_Ring' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_RetryPoint_C, Icon_Ring2) == 0x000408, "Member 'UChocoboCatching_RetryPoint_C::Icon_Ring2' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_RetryPoint_C, Icon_Ring3) == 0x000410, "Member 'UChocoboCatching_RetryPoint_C::Icon_Ring3' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_RetryPoint_C, Light) == 0x000418, "Member 'UChocoboCatching_RetryPoint_C::Light' has a wrong offset!");
static_assert(offsetof(UChocoboCatching_RetryPoint_C, Txt_Info) == 0x000420, "Member 'UChocoboCatching_RetryPoint_C::Txt_Info' has a wrong offset!");

}

