#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboCarriage_Loca

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboCarriage_Loca.ChocoboCarriage_Loca_C
// 0x0068 (0x0430 - 0x03C8)
class UChocoboCarriage_Loca_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Normal;                                            // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Current;                                           // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Target_Loop;                                       // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_00;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_01;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Current;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Target;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_circle_01;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point;                                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboCarriage_Loca_C">();
	}
	static class UChocoboCarriage_Loca_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboCarriage_Loca_C>();
	}
};
static_assert(alignof(UChocoboCarriage_Loca_C) == 0x000008, "Wrong alignment on UChocoboCarriage_Loca_C");
static_assert(sizeof(UChocoboCarriage_Loca_C) == 0x000430, "Wrong size on UChocoboCarriage_Loca_C");
static_assert(offsetof(UChocoboCarriage_Loca_C, Normal) == 0x0003C8, "Member 'UChocoboCarriage_Loca_C::Normal' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Current) == 0x0003D0, "Member 'UChocoboCarriage_Loca_C::Current' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Menu_In) == 0x0003D8, "Member 'UChocoboCarriage_Loca_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Target_Loop) == 0x0003E0, "Member 'UChocoboCarriage_Loca_C::Target_Loop' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Base) == 0x0003E8, "Member 'UChocoboCarriage_Loca_C::Base' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Cursor_00) == 0x0003F0, "Member 'UChocoboCarriage_Loca_C::Cursor_00' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Cursor_01) == 0x0003F8, "Member 'UChocoboCarriage_Loca_C::Cursor_01' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Frame) == 0x000400, "Member 'UChocoboCarriage_Loca_C::Frame' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Icon_Current) == 0x000408, "Member 'UChocoboCarriage_Loca_C::Icon_Current' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Icon_Target) == 0x000410, "Member 'UChocoboCarriage_Loca_C::Icon_Target' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Img_circle_01) == 0x000418, "Member 'UChocoboCarriage_Loca_C::Img_circle_01' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Point) == 0x000420, "Member 'UChocoboCarriage_Loca_C::Point' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Shadow) == 0x000428, "Member 'UChocoboCarriage_Loca_C::Shadow' has a wrong offset!");

}

