#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboTimeAttack_FlagTime

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboTimeAttack_FlagTime.ChocoboTimeAttack_FlagTime_C
// 0x0020 (0x03E8 - 0x03C8)
class UChocoboTimeAttack_FlagTime_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Past;                                              // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       New;                                               // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Icon;                                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Time;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboTimeAttack_FlagTime_C">();
	}
	static class UChocoboTimeAttack_FlagTime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboTimeAttack_FlagTime_C>();
	}
};
static_assert(alignof(UChocoboTimeAttack_FlagTime_C) == 0x000008, "Wrong alignment on UChocoboTimeAttack_FlagTime_C");
static_assert(sizeof(UChocoboTimeAttack_FlagTime_C) == 0x0003E8, "Wrong size on UChocoboTimeAttack_FlagTime_C");
static_assert(offsetof(UChocoboTimeAttack_FlagTime_C, Past) == 0x0003C8, "Member 'UChocoboTimeAttack_FlagTime_C::Past' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_FlagTime_C, New) == 0x0003D0, "Member 'UChocoboTimeAttack_FlagTime_C::New' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_FlagTime_C, Icon) == 0x0003D8, "Member 'UChocoboTimeAttack_FlagTime_C::Icon' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_FlagTime_C, Txt_Time) == 0x0003E0, "Member 'UChocoboTimeAttack_FlagTime_C::Txt_Time' has a wrong offset!");

}

