#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboTimeAttack_Score2

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboTimeAttack_Score2.ChocoboTimeAttack_Score2_C
// 0x0088 (0x0450 - 0x03C8)
class UChocoboTimeAttack_Score2_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       TargetScoreUp;                                     // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HightScoreUp;                                      // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NormalScoreUp;                                     // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HighScore;                                         // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NormalScore;                                       // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Icon_Clear;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light1;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light2;                                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light3;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line11;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line22;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_PlayerScore;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_PlayerScore2;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ScoreTitle;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TargetScore;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TargetScore_Clear;                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TargetTitle;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboTimeAttack_Score2_C">();
	}
	static class UChocoboTimeAttack_Score2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboTimeAttack_Score2_C>();
	}
};
static_assert(alignof(UChocoboTimeAttack_Score2_C) == 0x000008, "Wrong alignment on UChocoboTimeAttack_Score2_C");
static_assert(sizeof(UChocoboTimeAttack_Score2_C) == 0x000450, "Wrong size on UChocoboTimeAttack_Score2_C");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, TargetScoreUp) == 0x0003C8, "Member 'UChocoboTimeAttack_Score2_C::TargetScoreUp' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, HightScoreUp) == 0x0003D0, "Member 'UChocoboTimeAttack_Score2_C::HightScoreUp' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, NormalScoreUp) == 0x0003D8, "Member 'UChocoboTimeAttack_Score2_C::NormalScoreUp' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, HighScore) == 0x0003E0, "Member 'UChocoboTimeAttack_Score2_C::HighScore' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, NormalScore) == 0x0003E8, "Member 'UChocoboTimeAttack_Score2_C::NormalScore' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, Icon_Clear) == 0x0003F0, "Member 'UChocoboTimeAttack_Score2_C::Icon_Clear' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, Light1) == 0x0003F8, "Member 'UChocoboTimeAttack_Score2_C::Light1' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, Light2) == 0x000400, "Member 'UChocoboTimeAttack_Score2_C::Light2' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, Light3) == 0x000408, "Member 'UChocoboTimeAttack_Score2_C::Light3' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, Line11) == 0x000410, "Member 'UChocoboTimeAttack_Score2_C::Line11' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, Line22) == 0x000418, "Member 'UChocoboTimeAttack_Score2_C::Line22' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, Txt_PlayerScore) == 0x000420, "Member 'UChocoboTimeAttack_Score2_C::Txt_PlayerScore' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, Txt_PlayerScore2) == 0x000428, "Member 'UChocoboTimeAttack_Score2_C::Txt_PlayerScore2' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, Txt_ScoreTitle) == 0x000430, "Member 'UChocoboTimeAttack_Score2_C::Txt_ScoreTitle' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, Txt_TargetScore) == 0x000438, "Member 'UChocoboTimeAttack_Score2_C::Txt_TargetScore' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, Txt_TargetScore_Clear) == 0x000440, "Member 'UChocoboTimeAttack_Score2_C::Txt_TargetScore_Clear' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_Score2_C, Txt_TargetTitle) == 0x000448, "Member 'UChocoboTimeAttack_Score2_C::Txt_TargetTitle' has a wrong offset!");

}

