#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboTimeAttack_CheckPoint

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboTimeAttack_CheckPoint.ChocoboTimeAttack_CheckPoint_C
// 0x0038 (0x0400 - 0x03C8)
class UChocoboTimeAttack_CheckPoint_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       PointUp;                                           // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon;                                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light1;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Point;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Total;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboTimeAttack_CheckPoint_C">();
	}
	static class UChocoboTimeAttack_CheckPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboTimeAttack_CheckPoint_C>();
	}
};
static_assert(alignof(UChocoboTimeAttack_CheckPoint_C) == 0x000008, "Wrong alignment on UChocoboTimeAttack_CheckPoint_C");
static_assert(sizeof(UChocoboTimeAttack_CheckPoint_C) == 0x000400, "Wrong size on UChocoboTimeAttack_CheckPoint_C");
static_assert(offsetof(UChocoboTimeAttack_CheckPoint_C, PointUp) == 0x0003C8, "Member 'UChocoboTimeAttack_CheckPoint_C::PointUp' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_CheckPoint_C, Base) == 0x0003D0, "Member 'UChocoboTimeAttack_CheckPoint_C::Base' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_CheckPoint_C, Icon) == 0x0003D8, "Member 'UChocoboTimeAttack_CheckPoint_C::Icon' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_CheckPoint_C, Light1) == 0x0003E0, "Member 'UChocoboTimeAttack_CheckPoint_C::Light1' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_CheckPoint_C, Line) == 0x0003E8, "Member 'UChocoboTimeAttack_CheckPoint_C::Line' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_CheckPoint_C, Txt_Point) == 0x0003F0, "Member 'UChocoboTimeAttack_CheckPoint_C::Txt_Point' has a wrong offset!");
static_assert(offsetof(UChocoboTimeAttack_CheckPoint_C, Txt_Total) == 0x0003F8, "Member 'UChocoboTimeAttack_CheckPoint_C::Txt_Total' has a wrong offset!");

}

