#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cinema_Skip_Btn

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Cinema_Skip_Btn.Cinema_Skip_Btn_C
// 0x0098 (0x04C0 - 0x0428)
class UCinema_Skip_Btn_C final : public UEndCinemaButton
{
public:
	class UWidgetAnimation*                       Fastforward_Out;                                   // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fastforward_Press;                                 // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fastforward_Loop;                                  // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MenuBtn_Out2;                                      // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MenuBtn_LightIn;                                   // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MenuBtn_On;                                        // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MenuBtn_Out;                                       // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MenuBtn_Press;                                     // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SkipBtn_Out;                                       // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SkipBtn_Press;                                     // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_02;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Menu_Btn_;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           Menu_Gauge;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Skip_Btn_;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           Skip_Gauge;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Triangle_1;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Triangle_2;                                        // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cinema_Skip_Btn_C">();
	}
	static class UCinema_Skip_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCinema_Skip_Btn_C>();
	}
};
static_assert(alignof(UCinema_Skip_Btn_C) == 0x000008, "Wrong alignment on UCinema_Skip_Btn_C");
static_assert(sizeof(UCinema_Skip_Btn_C) == 0x0004C0, "Wrong size on UCinema_Skip_Btn_C");
static_assert(offsetof(UCinema_Skip_Btn_C, Fastforward_Out) == 0x000428, "Member 'UCinema_Skip_Btn_C::Fastforward_Out' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, Fastforward_Press) == 0x000430, "Member 'UCinema_Skip_Btn_C::Fastforward_Press' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, Fastforward_Loop) == 0x000438, "Member 'UCinema_Skip_Btn_C::Fastforward_Loop' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, MenuBtn_Out2) == 0x000440, "Member 'UCinema_Skip_Btn_C::MenuBtn_Out2' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, MenuBtn_LightIn) == 0x000448, "Member 'UCinema_Skip_Btn_C::MenuBtn_LightIn' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, MenuBtn_On) == 0x000450, "Member 'UCinema_Skip_Btn_C::MenuBtn_On' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, MenuBtn_Out) == 0x000458, "Member 'UCinema_Skip_Btn_C::MenuBtn_Out' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, MenuBtn_Press) == 0x000460, "Member 'UCinema_Skip_Btn_C::MenuBtn_Press' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, SkipBtn_Out) == 0x000468, "Member 'UCinema_Skip_Btn_C::SkipBtn_Out' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, SkipBtn_Press) == 0x000470, "Member 'UCinema_Skip_Btn_C::SkipBtn_Press' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, Img_Effect_00) == 0x000478, "Member 'UCinema_Skip_Btn_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, Img_Effect_01) == 0x000480, "Member 'UCinema_Skip_Btn_C::Img_Effect_01' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, Img_Effect_02) == 0x000488, "Member 'UCinema_Skip_Btn_C::Img_Effect_02' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, Menu_Btn_) == 0x000490, "Member 'UCinema_Skip_Btn_C::Menu_Btn_' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, Menu_Gauge) == 0x000498, "Member 'UCinema_Skip_Btn_C::Menu_Gauge' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, Skip_Btn_) == 0x0004A0, "Member 'UCinema_Skip_Btn_C::Skip_Btn_' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, Skip_Gauge) == 0x0004A8, "Member 'UCinema_Skip_Btn_C::Skip_Gauge' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, Triangle_1) == 0x0004B0, "Member 'UCinema_Skip_Btn_C::Triangle_1' has a wrong offset!");
static_assert(offsetof(UCinema_Skip_Btn_C, Triangle_2) == 0x0004B8, "Member 'UCinema_Skip_Btn_C::Triangle_2' has a wrong offset!");

}

