#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_VehicleSoundControl

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_VehicleSoundControl.Clip_VehicleSoundControl
// 0x0010 (0x0010 - 0x0000)
struct FClip_VehicleSoundControl final
{
public:
	class FName                                   ActorName_4_C825489046717F2D62372D8C2809B8A9;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EEndCutVehicleSoundControlType                ControlType_7_B8AF0DDA4E20BA46C9B5E7A9F3906638;    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeTime_10_E740455044F6412EE04A0E85129BDF29;      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(FClip_VehicleSoundControl) == 0x000004, "Wrong alignment on FClip_VehicleSoundControl");
static_assert(sizeof(FClip_VehicleSoundControl) == 0x000010, "Wrong size on FClip_VehicleSoundControl");
static_assert(offsetof(FClip_VehicleSoundControl, ActorName_4_C825489046717F2D62372D8C2809B8A9) == 0x000000, "Member 'FClip_VehicleSoundControl::ActorName_4_C825489046717F2D62372D8C2809B8A9' has a wrong offset!");
static_assert(offsetof(FClip_VehicleSoundControl, ControlType_7_B8AF0DDA4E20BA46C9B5E7A9F3906638) == 0x000008, "Member 'FClip_VehicleSoundControl::ControlType_7_B8AF0DDA4E20BA46C9B5E7A9F3906638' has a wrong offset!");
static_assert(offsetof(FClip_VehicleSoundControl, FadeTime_10_E740455044F6412EE04A0E85129BDF29) == 0x00000C, "Member 'FClip_VehicleSoundControl::FadeTime_10_E740455044F6412EE04A0E85129BDF29' has a wrong offset!");

}

