#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_ShowHideStreamingLevels

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_ShowHideStreamingLevels.Clip_ShowHideStreamingLevels
// 0x0018 (0x0018 - 0x0000)
struct FClip_ShowHideStreamingLevels final
{
public:
	TArray<class FName>                           Labels_7_5B4CFF574AFCED3385A1FBA04CF502FD;         // 0x0000(0x0010)(Edit, BlueprintVisible)
	bool                                          Hidden_5_30C24D494C7A5DA3923AA2ABEAF44C95;         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          WithoutCollision_9_8358A1004C4C8AAA63E2F7B2A6AA4F1A; // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(FClip_ShowHideStreamingLevels) == 0x000008, "Wrong alignment on FClip_ShowHideStreamingLevels");
static_assert(sizeof(FClip_ShowHideStreamingLevels) == 0x000018, "Wrong size on FClip_ShowHideStreamingLevels");
static_assert(offsetof(FClip_ShowHideStreamingLevels, Labels_7_5B4CFF574AFCED3385A1FBA04CF502FD) == 0x000000, "Member 'FClip_ShowHideStreamingLevels::Labels_7_5B4CFF574AFCED3385A1FBA04CF502FD' has a wrong offset!");
static_assert(offsetof(FClip_ShowHideStreamingLevels, Hidden_5_30C24D494C7A5DA3923AA2ABEAF44C95) == 0x000010, "Member 'FClip_ShowHideStreamingLevels::Hidden_5_30C24D494C7A5DA3923AA2ABEAF44C95' has a wrong offset!");
static_assert(offsetof(FClip_ShowHideStreamingLevels, WithoutCollision_9_8358A1004C4C8AAA63E2F7B2A6AA4F1A) == 0x000011, "Member 'FClip_ShowHideStreamingLevels::WithoutCollision_9_8358A1004C4C8AAA63E2F7B2A6AA4F1A' has a wrong offset!");

}

