#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_LovelessPlayMiniGameNote

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_LovelessPlayMiniGameNote.Clip_LovelessPlayMiniGameNote
// 0x0028 (0x0028 - 0x0000)
struct FClip_LovelessPlayMiniGameNote final
{
public:
	EEndLovelessPlayMiniGameInputKey              InputKey_69_C6B2ED9E46658F5DCB520C98721C4A88;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EEndLovelessPlayMiniGameKey                   Type_70_1F6495734024815C222D5FA35D22BE72;          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SignLength_82_8EB714A649B91F575465D29031BEE0B6;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         Length_61_20DDB4604ECA9E04B6CAD683BC2054D3;        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EEndLovelessPlayMiniGameUIAngleOrientation    UIAngleOrientation_71_D065B3E6432D1AF8702846BE5E3A763C; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PositionYOffset_78_B367114B48DA89E2E0E84FAE83E72EBD; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         PositionXOffset_79_CA0999F24ED1DC21A3AECEA037100EEF; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         GoodTapNumber_66_FBE9F7404AA9CE011920A494D0F11C34; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         VeryGoodTapNumber_68_8A95C32C44F45C6666D5F591DA6AE1EF; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   ForceFeedbackId_85_9D2BDCD042F398364BDA2EB461BDF7A8; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(FClip_LovelessPlayMiniGameNote) == 0x000004, "Wrong alignment on FClip_LovelessPlayMiniGameNote");
static_assert(sizeof(FClip_LovelessPlayMiniGameNote) == 0x000028, "Wrong size on FClip_LovelessPlayMiniGameNote");
static_assert(offsetof(FClip_LovelessPlayMiniGameNote, InputKey_69_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_LovelessPlayMiniGameNote::InputKey_69_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_LovelessPlayMiniGameNote, Type_70_1F6495734024815C222D5FA35D22BE72) == 0x000001, "Member 'FClip_LovelessPlayMiniGameNote::Type_70_1F6495734024815C222D5FA35D22BE72' has a wrong offset!");
static_assert(offsetof(FClip_LovelessPlayMiniGameNote, SignLength_82_8EB714A649B91F575465D29031BEE0B6) == 0x000004, "Member 'FClip_LovelessPlayMiniGameNote::SignLength_82_8EB714A649B91F575465D29031BEE0B6' has a wrong offset!");
static_assert(offsetof(FClip_LovelessPlayMiniGameNote, Length_61_20DDB4604ECA9E04B6CAD683BC2054D3) == 0x000008, "Member 'FClip_LovelessPlayMiniGameNote::Length_61_20DDB4604ECA9E04B6CAD683BC2054D3' has a wrong offset!");
static_assert(offsetof(FClip_LovelessPlayMiniGameNote, UIAngleOrientation_71_D065B3E6432D1AF8702846BE5E3A763C) == 0x00000C, "Member 'FClip_LovelessPlayMiniGameNote::UIAngleOrientation_71_D065B3E6432D1AF8702846BE5E3A763C' has a wrong offset!");
static_assert(offsetof(FClip_LovelessPlayMiniGameNote, PositionYOffset_78_B367114B48DA89E2E0E84FAE83E72EBD) == 0x000010, "Member 'FClip_LovelessPlayMiniGameNote::PositionYOffset_78_B367114B48DA89E2E0E84FAE83E72EBD' has a wrong offset!");
static_assert(offsetof(FClip_LovelessPlayMiniGameNote, PositionXOffset_79_CA0999F24ED1DC21A3AECEA037100EEF) == 0x000014, "Member 'FClip_LovelessPlayMiniGameNote::PositionXOffset_79_CA0999F24ED1DC21A3AECEA037100EEF' has a wrong offset!");
static_assert(offsetof(FClip_LovelessPlayMiniGameNote, GoodTapNumber_66_FBE9F7404AA9CE011920A494D0F11C34) == 0x000018, "Member 'FClip_LovelessPlayMiniGameNote::GoodTapNumber_66_FBE9F7404AA9CE011920A494D0F11C34' has a wrong offset!");
static_assert(offsetof(FClip_LovelessPlayMiniGameNote, VeryGoodTapNumber_68_8A95C32C44F45C6666D5F591DA6AE1EF) == 0x00001C, "Member 'FClip_LovelessPlayMiniGameNote::VeryGoodTapNumber_68_8A95C32C44F45C6666D5F591DA6AE1EF' has a wrong offset!");
static_assert(offsetof(FClip_LovelessPlayMiniGameNote, ForceFeedbackId_85_9D2BDCD042F398364BDA2EB461BDF7A8) == 0x000020, "Member 'FClip_LovelessPlayMiniGameNote::ForceFeedbackId_85_9D2BDCD042F398364BDA2EB461BDF7A8' has a wrong offset!");

}

