#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_Unbind

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_Unbind.Clip_Unbind
// 0x0024 (0x0024 - 0x0000)
struct FClip_Unbind final
{
public:
	class FName                                   ActorName_2_0534FA8B4560D0C23DB237ABD57322D9;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          OverrideAnimBlend_19_1A467CCD4FE2085C380ABD98A1DDF52B; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimBlendTime_21_6D28728244F4FE70CA08F0BB7DF90E40; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          OverrideIKBlend_23_A86E81F24218C295EA066ABF6B7AD08E; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IKBlendTime_25_BE2DE87B482C336D1216A1A3F8AD8AE1;   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   TargetPointOnSkip_26_93F8E321496B679A04BE8590786C379B; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          LastFramePositionOnSkip_27_9F79A04F41F1D7B1F7E451AA81D221DA; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(FClip_Unbind) == 0x000004, "Wrong alignment on FClip_Unbind");
static_assert(sizeof(FClip_Unbind) == 0x000024, "Wrong size on FClip_Unbind");
static_assert(offsetof(FClip_Unbind, ActorName_2_0534FA8B4560D0C23DB237ABD57322D9) == 0x000000, "Member 'FClip_Unbind::ActorName_2_0534FA8B4560D0C23DB237ABD57322D9' has a wrong offset!");
static_assert(offsetof(FClip_Unbind, OverrideAnimBlend_19_1A467CCD4FE2085C380ABD98A1DDF52B) == 0x000008, "Member 'FClip_Unbind::OverrideAnimBlend_19_1A467CCD4FE2085C380ABD98A1DDF52B' has a wrong offset!");
static_assert(offsetof(FClip_Unbind, AnimBlendTime_21_6D28728244F4FE70CA08F0BB7DF90E40) == 0x00000C, "Member 'FClip_Unbind::AnimBlendTime_21_6D28728244F4FE70CA08F0BB7DF90E40' has a wrong offset!");
static_assert(offsetof(FClip_Unbind, OverrideIKBlend_23_A86E81F24218C295EA066ABF6B7AD08E) == 0x000010, "Member 'FClip_Unbind::OverrideIKBlend_23_A86E81F24218C295EA066ABF6B7AD08E' has a wrong offset!");
static_assert(offsetof(FClip_Unbind, IKBlendTime_25_BE2DE87B482C336D1216A1A3F8AD8AE1) == 0x000014, "Member 'FClip_Unbind::IKBlendTime_25_BE2DE87B482C336D1216A1A3F8AD8AE1' has a wrong offset!");
static_assert(offsetof(FClip_Unbind, TargetPointOnSkip_26_93F8E321496B679A04BE8590786C379B) == 0x000018, "Member 'FClip_Unbind::TargetPointOnSkip_26_93F8E321496B679A04BE8590786C379B' has a wrong offset!");
static_assert(offsetof(FClip_Unbind, LastFramePositionOnSkip_27_9F79A04F41F1D7B1F7E451AA81D221DA) == 0x000020, "Member 'FClip_Unbind::LastFramePositionOnSkip_27_9F79A04F41F1D7B1F7E451AA81D221DA' has a wrong offset!");

}

