#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_Chapter

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_Chapter.Clip_Chapter
// 0x0014 (0x0014 - 0x0000)
struct FClip_Chapter final
{
public:
	class FName                                   NumberID_9_01285A334BADE2218BB349B8F9286792;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TitleID_10_555D73C74B85032D99B6258A6F787B90;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration_8_88A1A1FB4C8C116FF37D26B67B43313A;       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_Chapter) == 0x000004, "Wrong alignment on FClip_Chapter");
static_assert(sizeof(FClip_Chapter) == 0x000014, "Wrong size on FClip_Chapter");
static_assert(offsetof(FClip_Chapter, NumberID_9_01285A334BADE2218BB349B8F9286792) == 0x000000, "Member 'FClip_Chapter::NumberID_9_01285A334BADE2218BB349B8F9286792' has a wrong offset!");
static_assert(offsetof(FClip_Chapter, TitleID_10_555D73C74B85032D99B6258A6F787B90) == 0x000008, "Member 'FClip_Chapter::TitleID_10_555D73C74B85032D99B6258A6F787B90' has a wrong offset!");
static_assert(offsetof(FClip_Chapter, Duration_8_88A1A1FB4C8C116FF37D26B67B43313A) == 0x000010, "Member 'FClip_Chapter::Duration_8_88A1A1FB4C8C116FF37D26B67B43313A' has a wrong offset!");

}

