#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_Bind

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_Bind.Clip_Bind
// 0x0018 (0x0018 - 0x0000)
struct FClip_Bind final
{
public:
	class FName                                   ActorName_50_B40E29B7452E697A8A1C67A882E87128;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          OverrideAnimBlend_44_61E98A124E38A07D2C7B129BA2B76E7F; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimBlendTime_35_61AE8C6F4172E57C5AA26EAB6492DF2F; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          OverrideIKBlend_45_F4CF329B4F09981A015300A7C73A1553; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IKBlendTime_46_1F8D8EA24CC1FEC9844906B652C66456;   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(FClip_Bind) == 0x000004, "Wrong alignment on FClip_Bind");
static_assert(sizeof(FClip_Bind) == 0x000018, "Wrong size on FClip_Bind");
static_assert(offsetof(FClip_Bind, ActorName_50_B40E29B7452E697A8A1C67A882E87128) == 0x000000, "Member 'FClip_Bind::ActorName_50_B40E29B7452E697A8A1C67A882E87128' has a wrong offset!");
static_assert(offsetof(FClip_Bind, OverrideAnimBlend_44_61E98A124E38A07D2C7B129BA2B76E7F) == 0x000008, "Member 'FClip_Bind::OverrideAnimBlend_44_61E98A124E38A07D2C7B129BA2B76E7F' has a wrong offset!");
static_assert(offsetof(FClip_Bind, AnimBlendTime_35_61AE8C6F4172E57C5AA26EAB6492DF2F) == 0x00000C, "Member 'FClip_Bind::AnimBlendTime_35_61AE8C6F4172E57C5AA26EAB6492DF2F' has a wrong offset!");
static_assert(offsetof(FClip_Bind, OverrideIKBlend_45_F4CF329B4F09981A015300A7C73A1553) == 0x000010, "Member 'FClip_Bind::OverrideIKBlend_45_F4CF329B4F09981A015300A7C73A1553' has a wrong offset!");
static_assert(offsetof(FClip_Bind, IKBlendTime_46_1F8D8EA24CC1FEC9844906B652C66456) == 0x000014, "Member 'FClip_Bind::IKBlendTime_46_1F8D8EA24CC1FEC9844906B652C66456' has a wrong offset!");

}

