#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_Constraint

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_Constraint.Clip_Constraint
// 0x001C (0x001C - 0x0000)
struct FClip_Constraint final
{
public:
	class FName                                   ActorName_41_B866B4C142789D9BC2167CA4BCE4A280;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ParentName_42_FBC98ECF426C6ED2E04A5AA17E472FA6;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName_43_27E6A3FD4B007DE1565510A411874070;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Detach_37_96C1761542C2F2E20018F2BE47E11229;        // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FClip_Constraint) == 0x000004, "Wrong alignment on FClip_Constraint");
static_assert(sizeof(FClip_Constraint) == 0x00001C, "Wrong size on FClip_Constraint");
static_assert(offsetof(FClip_Constraint, ActorName_41_B866B4C142789D9BC2167CA4BCE4A280) == 0x000000, "Member 'FClip_Constraint::ActorName_41_B866B4C142789D9BC2167CA4BCE4A280' has a wrong offset!");
static_assert(offsetof(FClip_Constraint, ParentName_42_FBC98ECF426C6ED2E04A5AA17E472FA6) == 0x000008, "Member 'FClip_Constraint::ParentName_42_FBC98ECF426C6ED2E04A5AA17E472FA6' has a wrong offset!");
static_assert(offsetof(FClip_Constraint, SocketName_43_27E6A3FD4B007DE1565510A411874070) == 0x000010, "Member 'FClip_Constraint::SocketName_43_27E6A3FD4B007DE1565510A411874070' has a wrong offset!");
static_assert(offsetof(FClip_Constraint, Detach_37_96C1761542C2F2E20018F2BE47E11229) == 0x000018, "Member 'FClip_Constraint::Detach_37_96C1761542C2F2E20018F2BE47E11229' has a wrong offset!");

}

