#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_ReplaceCharaSpec

#include "Basic.hpp"

#include "EndDataBase_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_ReplaceCharaSpec.Clip_ReplaceCharaSpec
// 0x001C (0x001C - 0x0000)
struct FClip_ReplaceCharaSpec final
{
public:
	class FName                                   ActorName_2_DDAD7FAE4953D5BEB0B83591E8174AC2;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reference_6_B5F6E5A4457338C83384A18C5F453B94;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CharaSpec_7_C6C9531C4B37E7660C8195931CBD3DF2;      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerType                                   RefPlayerType_10_BF9742FE4B516D59875DB3B9E393C0B6; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_ReplaceCharaSpec) == 0x000004, "Wrong alignment on FClip_ReplaceCharaSpec");
static_assert(sizeof(FClip_ReplaceCharaSpec) == 0x00001C, "Wrong size on FClip_ReplaceCharaSpec");
static_assert(offsetof(FClip_ReplaceCharaSpec, ActorName_2_DDAD7FAE4953D5BEB0B83591E8174AC2) == 0x000000, "Member 'FClip_ReplaceCharaSpec::ActorName_2_DDAD7FAE4953D5BEB0B83591E8174AC2' has a wrong offset!");
static_assert(offsetof(FClip_ReplaceCharaSpec, Reference_6_B5F6E5A4457338C83384A18C5F453B94) == 0x000008, "Member 'FClip_ReplaceCharaSpec::Reference_6_B5F6E5A4457338C83384A18C5F453B94' has a wrong offset!");
static_assert(offsetof(FClip_ReplaceCharaSpec, CharaSpec_7_C6C9531C4B37E7660C8195931CBD3DF2) == 0x000010, "Member 'FClip_ReplaceCharaSpec::CharaSpec_7_C6C9531C4B37E7660C8195931CBD3DF2' has a wrong offset!");
static_assert(offsetof(FClip_ReplaceCharaSpec, RefPlayerType_10_BF9742FE4B516D59875DB3B9E393C0B6) == 0x000018, "Member 'FClip_ReplaceCharaSpec::RefPlayerType_10_BF9742FE4B516D59875DB3B9E393C0B6' has a wrong offset!");

}

