#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_ChocoboRiderConstraint

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_ChocoboRiderConstraint.Clip_ChocoboRiderConstraint
// 0x0028 (0x0028 - 0x0000)
struct FClip_ChocoboRiderConstraint final
{
public:
	TArray<class FName>                           VehicleNames_7_CEBC116943E452DC1CCCCFA0ADA4275F;   // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           RiderNames_9_04C4695544CA2FA41A811FB1D5A5F88B;     // 0x0010(0x0010)(Edit, BlueprintVisible)
	bool                                          Detach_3_F1D5E2794E37ACCEC207958AABAB2B67;         // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          ForceApply_11_4FD619214D84FB4880484BB98AF4E7F2;    // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(FClip_ChocoboRiderConstraint) == 0x000008, "Wrong alignment on FClip_ChocoboRiderConstraint");
static_assert(sizeof(FClip_ChocoboRiderConstraint) == 0x000028, "Wrong size on FClip_ChocoboRiderConstraint");
static_assert(offsetof(FClip_ChocoboRiderConstraint, VehicleNames_7_CEBC116943E452DC1CCCCFA0ADA4275F) == 0x000000, "Member 'FClip_ChocoboRiderConstraint::VehicleNames_7_CEBC116943E452DC1CCCCFA0ADA4275F' has a wrong offset!");
static_assert(offsetof(FClip_ChocoboRiderConstraint, RiderNames_9_04C4695544CA2FA41A811FB1D5A5F88B) == 0x000010, "Member 'FClip_ChocoboRiderConstraint::RiderNames_9_04C4695544CA2FA41A811FB1D5A5F88B' has a wrong offset!");
static_assert(offsetof(FClip_ChocoboRiderConstraint, Detach_3_F1D5E2794E37ACCEC207958AABAB2B67) == 0x000020, "Member 'FClip_ChocoboRiderConstraint::Detach_3_F1D5E2794E37ACCEC207958AABAB2B67' has a wrong offset!");
static_assert(offsetof(FClip_ChocoboRiderConstraint, ForceApply_11_4FD619214D84FB4880484BB98AF4E7F2) == 0x000021, "Member 'FClip_ChocoboRiderConstraint::ForceApply_11_4FD619214D84FB4880484BB98AF4E7F2' has a wrong offset!");

}

