#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_WaitOnSkip

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_WaitOnSkip.Clip_WaitOnSkip
// 0x0048 (0x0048 - 0x0000)
struct FClip_WaitOnSkip final
{
public:
	float                                         WaitTime_52_6C183F384ACBAE650CB12C91776D5AE1;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ActorNames_43_27558BD145F56A4C4EE53E813ADB7EF0;    // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           BgfaAccessIds_47_EF1B2D5C42573CE5682A4C918051CB61; // 0x0018(0x0010)(Edit, BlueprintVisible)
	float                                         TimeOut_53_758C57BA47BB3BAC69E6CC92E5594599;       // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          PlayerPositionCollision_55_856B142A4553DDC808F41CA03D964889; // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           StateEnvironmentAnimation_59_B1D6CA194E5F97C2812732836E1C1ECC; // 0x0030(0x0010)(Edit, BlueprintVisible)
	bool                                          WaitBeforeSkipOut_61_97EAFA2E43FC5A01DCB5E0B3CA235CFA; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(FClip_WaitOnSkip) == 0x000008, "Wrong alignment on FClip_WaitOnSkip");
static_assert(sizeof(FClip_WaitOnSkip) == 0x000048, "Wrong size on FClip_WaitOnSkip");
static_assert(offsetof(FClip_WaitOnSkip, WaitTime_52_6C183F384ACBAE650CB12C91776D5AE1) == 0x000000, "Member 'FClip_WaitOnSkip::WaitTime_52_6C183F384ACBAE650CB12C91776D5AE1' has a wrong offset!");
static_assert(offsetof(FClip_WaitOnSkip, ActorNames_43_27558BD145F56A4C4EE53E813ADB7EF0) == 0x000008, "Member 'FClip_WaitOnSkip::ActorNames_43_27558BD145F56A4C4EE53E813ADB7EF0' has a wrong offset!");
static_assert(offsetof(FClip_WaitOnSkip, BgfaAccessIds_47_EF1B2D5C42573CE5682A4C918051CB61) == 0x000018, "Member 'FClip_WaitOnSkip::BgfaAccessIds_47_EF1B2D5C42573CE5682A4C918051CB61' has a wrong offset!");
static_assert(offsetof(FClip_WaitOnSkip, TimeOut_53_758C57BA47BB3BAC69E6CC92E5594599) == 0x000028, "Member 'FClip_WaitOnSkip::TimeOut_53_758C57BA47BB3BAC69E6CC92E5594599' has a wrong offset!");
static_assert(offsetof(FClip_WaitOnSkip, PlayerPositionCollision_55_856B142A4553DDC808F41CA03D964889) == 0x00002C, "Member 'FClip_WaitOnSkip::PlayerPositionCollision_55_856B142A4553DDC808F41CA03D964889' has a wrong offset!");
static_assert(offsetof(FClip_WaitOnSkip, StateEnvironmentAnimation_59_B1D6CA194E5F97C2812732836E1C1ECC) == 0x000030, "Member 'FClip_WaitOnSkip::StateEnvironmentAnimation_59_B1D6CA194E5F97C2812732836E1C1ECC' has a wrong offset!");
static_assert(offsetof(FClip_WaitOnSkip, WaitBeforeSkipOut_61_97EAFA2E43FC5A01DCB5E0B3CA235CFA) == 0x000040, "Member 'FClip_WaitOnSkip::WaitBeforeSkipOut_61_97EAFA2E43FC5A01DCB5E0B3CA235CFA' has a wrong offset!");

}

