#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_SwitchStreamingVolume

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_SwitchStreamingVolume.Clip_SwitchStreamingVolume
// 0x0014 (0x0014 - 0x0000)
struct FClip_SwitchStreamingVolume final
{
public:
	class FName                                   VolumeLabel_49_7CBE103D4AF38A0DE2078AA4E45848D0;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   SwitchLabel_50_D0FD790341A168CE3857378274AA0531;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EEndStreamingSwitchType                       SwitchType_52_875964524C365ADD8E7A019B9D590AD1;    // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(FClip_SwitchStreamingVolume) == 0x000004, "Wrong alignment on FClip_SwitchStreamingVolume");
static_assert(sizeof(FClip_SwitchStreamingVolume) == 0x000014, "Wrong size on FClip_SwitchStreamingVolume");
static_assert(offsetof(FClip_SwitchStreamingVolume, VolumeLabel_49_7CBE103D4AF38A0DE2078AA4E45848D0) == 0x000000, "Member 'FClip_SwitchStreamingVolume::VolumeLabel_49_7CBE103D4AF38A0DE2078AA4E45848D0' has a wrong offset!");
static_assert(offsetof(FClip_SwitchStreamingVolume, SwitchLabel_50_D0FD790341A168CE3857378274AA0531) == 0x000008, "Member 'FClip_SwitchStreamingVolume::SwitchLabel_50_D0FD790341A168CE3857378274AA0531' has a wrong offset!");
static_assert(offsetof(FClip_SwitchStreamingVolume, SwitchType_52_875964524C365ADD8E7A019B9D590AD1) == 0x000010, "Member 'FClip_SwitchStreamingVolume::SwitchType_52_875964524C365ADD8E7A019B9D590AD1' has a wrong offset!");

}

