#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_OverrideFootAttribute

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_OverrideFootAttribute.Clip_OverrideFootAttribute
// 0x0020 (0x0020 - 0x0000)
struct FClip_OverrideFootAttribute final
{
public:
	EEndCutOverrideFootAttributeMode              Mode_8_5746B98446DECC41C9399EB09CCDF49A;           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EPhysicalSurface                              Attribute_10_83A4191A4E7A0E043B5A48AAEE3454AF;     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ActorNames_14_301816894B491B5BD2F31BA76A886391;    // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          bEnable_13_76C4B8EB414A7066ADE2179817B2F6E8;       // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(FClip_OverrideFootAttribute) == 0x000008, "Wrong alignment on FClip_OverrideFootAttribute");
static_assert(sizeof(FClip_OverrideFootAttribute) == 0x000020, "Wrong size on FClip_OverrideFootAttribute");
static_assert(offsetof(FClip_OverrideFootAttribute, Mode_8_5746B98446DECC41C9399EB09CCDF49A) == 0x000000, "Member 'FClip_OverrideFootAttribute::Mode_8_5746B98446DECC41C9399EB09CCDF49A' has a wrong offset!");
static_assert(offsetof(FClip_OverrideFootAttribute, Attribute_10_83A4191A4E7A0E043B5A48AAEE3454AF) == 0x000001, "Member 'FClip_OverrideFootAttribute::Attribute_10_83A4191A4E7A0E043B5A48AAEE3454AF' has a wrong offset!");
static_assert(offsetof(FClip_OverrideFootAttribute, ActorNames_14_301816894B491B5BD2F31BA76A886391) == 0x000008, "Member 'FClip_OverrideFootAttribute::ActorNames_14_301816894B491B5BD2F31BA76A886391' has a wrong offset!");
static_assert(offsetof(FClip_OverrideFootAttribute, bEnable_13_76C4B8EB414A7066ADE2179817B2F6E8) == 0x000018, "Member 'FClip_OverrideFootAttribute::bEnable_13_76C4B8EB414A7066ADE2179817B2F6E8' has a wrong offset!");

}

