#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_ChangeParts

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_ChangeParts.Clip_ChangeParts
// 0x0018 (0x0018 - 0x0000)
struct FClip_ChangeParts final
{
public:
	class FName                                   ActorName_58_AE6F648142F232AD3900D6BB39044FE0;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MeshName_59_A758A2AC430AB52A8602D3A44E2E86EB;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MeshLabel_60_A0518749445AB1F8C743BDB2AA125ACA;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_ChangeParts) == 0x000004, "Wrong alignment on FClip_ChangeParts");
static_assert(sizeof(FClip_ChangeParts) == 0x000018, "Wrong size on FClip_ChangeParts");
static_assert(offsetof(FClip_ChangeParts, ActorName_58_AE6F648142F232AD3900D6BB39044FE0) == 0x000000, "Member 'FClip_ChangeParts::ActorName_58_AE6F648142F232AD3900D6BB39044FE0' has a wrong offset!");
static_assert(offsetof(FClip_ChangeParts, MeshName_59_A758A2AC430AB52A8602D3A44E2E86EB) == 0x000008, "Member 'FClip_ChangeParts::MeshName_59_A758A2AC430AB52A8602D3A44E2E86EB' has a wrong offset!");
static_assert(offsetof(FClip_ChangeParts, MeshLabel_60_A0518749445AB1F8C743BDB2AA125ACA) == 0x000010, "Member 'FClip_ChangeParts::MeshLabel_60_A0518749445AB1F8C743BDB2AA125ACA' has a wrong offset!");

}

