#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_SubTitle

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_SubTitle.Clip_SubTitle
// 0x000C (0x000C - 0x0000)
struct FClip_SubTitle final
{
public:
	class FName                                   TextLabel_28_6C183F384ACBAE650CB12C91776D5AE1;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndCutLangType                               Language_38_27558BD145F56A4C4EE53E813ADB7EF0;      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_34_EF1B2D5C42573CE5682A4C918051CB61;        // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FClip_SubTitle) == 0x000004, "Wrong alignment on FClip_SubTitle");
static_assert(sizeof(FClip_SubTitle) == 0x00000C, "Wrong size on FClip_SubTitle");
static_assert(offsetof(FClip_SubTitle, TextLabel_28_6C183F384ACBAE650CB12C91776D5AE1) == 0x000000, "Member 'FClip_SubTitle::TextLabel_28_6C183F384ACBAE650CB12C91776D5AE1' has a wrong offset!");
static_assert(offsetof(FClip_SubTitle, Language_38_27558BD145F56A4C4EE53E813ADB7EF0) == 0x000008, "Member 'FClip_SubTitle::Language_38_27558BD145F56A4C4EE53E813ADB7EF0' has a wrong offset!");
static_assert(offsetof(FClip_SubTitle, Enable_34_EF1B2D5C42573CE5682A4C918051CB61) == 0x000009, "Member 'FClip_SubTitle::Enable_34_EF1B2D5C42573CE5682A4C918051CB61' has a wrong offset!");

}

