#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_DirLightModify

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_DirLightModify.Clip_DirLightModify
// 0x0020 (0x0020 - 0x0000)
struct FClip_DirLightModify final
{
public:
	EEndCutLightModulateTargetMode                Mode_13_C77225D5441134CDB4796ABC61B6DAB4;          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ActorNames_14_F3C3EC284CE073A1F962C88B04685D43;    // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          Enable_16_F8538F4C4A4F9C6F67561FA28A20857D;        // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FClip_DirLightModify) == 0x000008, "Wrong alignment on FClip_DirLightModify");
static_assert(sizeof(FClip_DirLightModify) == 0x000020, "Wrong size on FClip_DirLightModify");
static_assert(offsetof(FClip_DirLightModify, Mode_13_C77225D5441134CDB4796ABC61B6DAB4) == 0x000000, "Member 'FClip_DirLightModify::Mode_13_C77225D5441134CDB4796ABC61B6DAB4' has a wrong offset!");
static_assert(offsetof(FClip_DirLightModify, ActorNames_14_F3C3EC284CE073A1F962C88B04685D43) == 0x000008, "Member 'FClip_DirLightModify::ActorNames_14_F3C3EC284CE073A1F962C88B04685D43' has a wrong offset!");
static_assert(offsetof(FClip_DirLightModify, Enable_16_F8538F4C4A4F9C6F67561FA28A20857D) == 0x000018, "Member 'FClip_DirLightModify::Enable_16_F8538F4C4A4F9C6F67561FA28A20857D' has a wrong offset!");

}

