#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_SelectWidget

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_SelectWidget.Clip_SelectWidget
// 0x0028 (0x0028 - 0x0000)
struct FClip_SelectWidget final
{
public:
	class FName                                   Title_59_8D92B141417D05A0E5D22EB6AE177136;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<struct FEndCutSelectWidgetItem>        Items_92_23574C6C4963693156F6668A85AF27E0;         // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          Erase_85_D70CFF794F558DE1A05861AAC92B22FA;         // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InitialSelection_97_E7F5A18047CE64081F00B49B90D7767B; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         LimitTime_99_0ADCFFDF4C63B81201089691BC0CDA4A;     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Shuffle_100_E0854B924886F9568173748E29CDF31E;      // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(FClip_SelectWidget) == 0x000008, "Wrong alignment on FClip_SelectWidget");
static_assert(sizeof(FClip_SelectWidget) == 0x000028, "Wrong size on FClip_SelectWidget");
static_assert(offsetof(FClip_SelectWidget, Title_59_8D92B141417D05A0E5D22EB6AE177136) == 0x000000, "Member 'FClip_SelectWidget::Title_59_8D92B141417D05A0E5D22EB6AE177136' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, Items_92_23574C6C4963693156F6668A85AF27E0) == 0x000008, "Member 'FClip_SelectWidget::Items_92_23574C6C4963693156F6668A85AF27E0' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, Erase_85_D70CFF794F558DE1A05861AAC92B22FA) == 0x000018, "Member 'FClip_SelectWidget::Erase_85_D70CFF794F558DE1A05861AAC92B22FA' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, InitialSelection_97_E7F5A18047CE64081F00B49B90D7767B) == 0x00001C, "Member 'FClip_SelectWidget::InitialSelection_97_E7F5A18047CE64081F00B49B90D7767B' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, LimitTime_99_0ADCFFDF4C63B81201089691BC0CDA4A) == 0x000020, "Member 'FClip_SelectWidget::LimitTime_99_0ADCFFDF4C63B81201089691BC0CDA4A' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, Shuffle_100_E0854B924886F9568173748E29CDF31E) == 0x000024, "Member 'FClip_SelectWidget::Shuffle_100_E0854B924886F9568173748E29CDF31E' has a wrong offset!");

}

