#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_StorySubtitle

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_StorySubtitle.Clip_StorySubtitle
// 0x0020 (0x0020 - 0x0000)
struct FClip_StorySubtitle final
{
public:
	class FName                                   TextLabel_13_4791FD294A9F065ED2E8549D5ED54E9F;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndCutLangType                               Language_14_CD8A5E144EB9733110E7CD9BED8C928C;      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEndCutStoryFlagConditionItem>  FlagConditions_19_5EB7E6DE4516A42649E0BB99E517031F; // 0x0010(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FClip_StorySubtitle) == 0x000008, "Wrong alignment on FClip_StorySubtitle");
static_assert(sizeof(FClip_StorySubtitle) == 0x000020, "Wrong size on FClip_StorySubtitle");
static_assert(offsetof(FClip_StorySubtitle, TextLabel_13_4791FD294A9F065ED2E8549D5ED54E9F) == 0x000000, "Member 'FClip_StorySubtitle::TextLabel_13_4791FD294A9F065ED2E8549D5ED54E9F' has a wrong offset!");
static_assert(offsetof(FClip_StorySubtitle, Language_14_CD8A5E144EB9733110E7CD9BED8C928C) == 0x000008, "Member 'FClip_StorySubtitle::Language_14_CD8A5E144EB9733110E7CD9BED8C928C' has a wrong offset!");
static_assert(offsetof(FClip_StorySubtitle, FlagConditions_19_5EB7E6DE4516A42649E0BB99E517031F) == 0x000010, "Member 'FClip_StorySubtitle::FlagConditions_19_5EB7E6DE4516A42649E0BB99E517031F' has a wrong offset!");

}

