#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_MovieControl

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_MovieControl.Clip_MovieControl
// 0x0010 (0x0010 - 0x0000)
struct FClip_MovieControl final
{
public:
	EEndCutMovieControlGroup                      Group_58_6959559841774FBD920D459A91507837;         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MovieID_49_AE6F648142F232AD3900D6BB39044FE0;       // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndCutMovieControlType                       Mode_48_243AE6BA46865417DCD33596CDBB4A32;          // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_MovieControl) == 0x000004, "Wrong alignment on FClip_MovieControl");
static_assert(sizeof(FClip_MovieControl) == 0x000010, "Wrong size on FClip_MovieControl");
static_assert(offsetof(FClip_MovieControl, Group_58_6959559841774FBD920D459A91507837) == 0x000000, "Member 'FClip_MovieControl::Group_58_6959559841774FBD920D459A91507837' has a wrong offset!");
static_assert(offsetof(FClip_MovieControl, MovieID_49_AE6F648142F232AD3900D6BB39044FE0) == 0x000004, "Member 'FClip_MovieControl::MovieID_49_AE6F648142F232AD3900D6BB39044FE0' has a wrong offset!");
static_assert(offsetof(FClip_MovieControl, Mode_48_243AE6BA46865417DCD33596CDBB4A32) == 0x00000C, "Member 'FClip_MovieControl::Mode_48_243AE6BA46865417DCD33596CDBB4A32' has a wrong offset!");

}

