#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_CrowdActorDraw

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_CrowdActorDraw.Clip_CrowdActorDraw
// 0x0030 (0x0030 - 0x0000)
struct FClip_CrowdActorDraw final
{
public:
	class FName                                   AccessId_22_E3480F2D4B8099BB6FBCB49C300C6D8B;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hidden_19_2AA03F96424A827448886999CF535DBD;        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendTime_25_2F09AC5B44DB58B36D8FE3BB259C1944;     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseFade_27_D8CB137E4E4B7088857739AEF0FAD277;      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OverrideName_32_65A617DB4F988F5CE06526AD550365C8;  // 0x0014(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bResetOverride_31_0E4EA3674F1AC7A6DBD603B9BFCA874C; // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 IndexList_37_DAE52F6045AF7C9E44C79AB99E84E8A3;     // 0x0020(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FClip_CrowdActorDraw) == 0x000008, "Wrong alignment on FClip_CrowdActorDraw");
static_assert(sizeof(FClip_CrowdActorDraw) == 0x000030, "Wrong size on FClip_CrowdActorDraw");
static_assert(offsetof(FClip_CrowdActorDraw, AccessId_22_E3480F2D4B8099BB6FBCB49C300C6D8B) == 0x000000, "Member 'FClip_CrowdActorDraw::AccessId_22_E3480F2D4B8099BB6FBCB49C300C6D8B' has a wrong offset!");
static_assert(offsetof(FClip_CrowdActorDraw, Hidden_19_2AA03F96424A827448886999CF535DBD) == 0x000008, "Member 'FClip_CrowdActorDraw::Hidden_19_2AA03F96424A827448886999CF535DBD' has a wrong offset!");
static_assert(offsetof(FClip_CrowdActorDraw, BlendTime_25_2F09AC5B44DB58B36D8FE3BB259C1944) == 0x00000C, "Member 'FClip_CrowdActorDraw::BlendTime_25_2F09AC5B44DB58B36D8FE3BB259C1944' has a wrong offset!");
static_assert(offsetof(FClip_CrowdActorDraw, bUseFade_27_D8CB137E4E4B7088857739AEF0FAD277) == 0x000010, "Member 'FClip_CrowdActorDraw::bUseFade_27_D8CB137E4E4B7088857739AEF0FAD277' has a wrong offset!");
static_assert(offsetof(FClip_CrowdActorDraw, OverrideName_32_65A617DB4F988F5CE06526AD550365C8) == 0x000014, "Member 'FClip_CrowdActorDraw::OverrideName_32_65A617DB4F988F5CE06526AD550365C8' has a wrong offset!");
static_assert(offsetof(FClip_CrowdActorDraw, bResetOverride_31_0E4EA3674F1AC7A6DBD603B9BFCA874C) == 0x00001C, "Member 'FClip_CrowdActorDraw::bResetOverride_31_0E4EA3674F1AC7A6DBD603B9BFCA874C' has a wrong offset!");
static_assert(offsetof(FClip_CrowdActorDraw, IndexList_37_DAE52F6045AF7C9E44C79AB99E84E8A3) == 0x000020, "Member 'FClip_CrowdActorDraw::IndexList_37_DAE52F6045AF7C9E44C79AB99E84E8A3' has a wrong offset!");

}

