#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_BCamShake

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_BCamShake.Clip_BCamShake
// 0x003C (0x003C - 0x0000)
struct FClip_BCamShake final
{
public:
	float                                         Duration_76_F290BD3748C5348D97A506A969A0B03A;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendInTime_78_E9205FDD4319C02038E518B8B289835E;   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendOutTime_80_71A3DB8D4C0BEC787CB5E8AFE61CBE40;  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rot_Oscillation_Pitch_Amplitude_100_E0358850489D7A979699B49E069685AC; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rot_Oscillation_Pitch_Frequency_106_6A5F8C684238016CDF98E489DCC53DC7; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rot_Oscillation_Yaw_Amplitude_107_010120B84ED8ECCDE85582A79F7C21F8; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rot_Oscillation_Yaw_Frequency_108_CAEA7C464C830606CE8C359A3B2D25B9; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rot_Oscillation_Roll_Amplitude_109_D1E8D65E4D0C5DF62CA752B375B2B15B; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rot_Oscillation_Roll_Frequency_110_4CB6D15C4CD1324B419690AC0192AD9B; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Loc_Oscillation_X_Amplitude_122_C05080784D0B290F18B775A28271D731; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Loc_Oscillation_X_Frequency_117_748DAA554C3F4EB594B0E0829E89151C; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Loc_Oscillation_Y_Amplitude_118_952CC57C49EF5DCBD7CA5FBF918E756F; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Loc_Oscillation_Y_Frequency_120_314785274A7EBE8929BFDBA92B6B9BC7; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Loc_Oscillation_Z_Amplitude_119_99FCABDB41F0AD0B3D5C4C9DE871459B; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Loc_Oscillation_Z_Frequency_121_5CA906D54FE77E82EF0E26910C86EDE6; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_BCamShake) == 0x000004, "Wrong alignment on FClip_BCamShake");
static_assert(sizeof(FClip_BCamShake) == 0x00003C, "Wrong size on FClip_BCamShake");
static_assert(offsetof(FClip_BCamShake, Duration_76_F290BD3748C5348D97A506A969A0B03A) == 0x000000, "Member 'FClip_BCamShake::Duration_76_F290BD3748C5348D97A506A969A0B03A' has a wrong offset!");
static_assert(offsetof(FClip_BCamShake, BlendInTime_78_E9205FDD4319C02038E518B8B289835E) == 0x000004, "Member 'FClip_BCamShake::BlendInTime_78_E9205FDD4319C02038E518B8B289835E' has a wrong offset!");
static_assert(offsetof(FClip_BCamShake, BlendOutTime_80_71A3DB8D4C0BEC787CB5E8AFE61CBE40) == 0x000008, "Member 'FClip_BCamShake::BlendOutTime_80_71A3DB8D4C0BEC787CB5E8AFE61CBE40' has a wrong offset!");
static_assert(offsetof(FClip_BCamShake, Rot_Oscillation_Pitch_Amplitude_100_E0358850489D7A979699B49E069685AC) == 0x00000C, "Member 'FClip_BCamShake::Rot_Oscillation_Pitch_Amplitude_100_E0358850489D7A979699B49E069685AC' has a wrong offset!");
static_assert(offsetof(FClip_BCamShake, Rot_Oscillation_Pitch_Frequency_106_6A5F8C684238016CDF98E489DCC53DC7) == 0x000010, "Member 'FClip_BCamShake::Rot_Oscillation_Pitch_Frequency_106_6A5F8C684238016CDF98E489DCC53DC7' has a wrong offset!");
static_assert(offsetof(FClip_BCamShake, Rot_Oscillation_Yaw_Amplitude_107_010120B84ED8ECCDE85582A79F7C21F8) == 0x000014, "Member 'FClip_BCamShake::Rot_Oscillation_Yaw_Amplitude_107_010120B84ED8ECCDE85582A79F7C21F8' has a wrong offset!");
static_assert(offsetof(FClip_BCamShake, Rot_Oscillation_Yaw_Frequency_108_CAEA7C464C830606CE8C359A3B2D25B9) == 0x000018, "Member 'FClip_BCamShake::Rot_Oscillation_Yaw_Frequency_108_CAEA7C464C830606CE8C359A3B2D25B9' has a wrong offset!");
static_assert(offsetof(FClip_BCamShake, Rot_Oscillation_Roll_Amplitude_109_D1E8D65E4D0C5DF62CA752B375B2B15B) == 0x00001C, "Member 'FClip_BCamShake::Rot_Oscillation_Roll_Amplitude_109_D1E8D65E4D0C5DF62CA752B375B2B15B' has a wrong offset!");
static_assert(offsetof(FClip_BCamShake, Rot_Oscillation_Roll_Frequency_110_4CB6D15C4CD1324B419690AC0192AD9B) == 0x000020, "Member 'FClip_BCamShake::Rot_Oscillation_Roll_Frequency_110_4CB6D15C4CD1324B419690AC0192AD9B' has a wrong offset!");
static_assert(offsetof(FClip_BCamShake, Loc_Oscillation_X_Amplitude_122_C05080784D0B290F18B775A28271D731) == 0x000024, "Member 'FClip_BCamShake::Loc_Oscillation_X_Amplitude_122_C05080784D0B290F18B775A28271D731' has a wrong offset!");
static_assert(offsetof(FClip_BCamShake, Loc_Oscillation_X_Frequency_117_748DAA554C3F4EB594B0E0829E89151C) == 0x000028, "Member 'FClip_BCamShake::Loc_Oscillation_X_Frequency_117_748DAA554C3F4EB594B0E0829E89151C' has a wrong offset!");
static_assert(offsetof(FClip_BCamShake, Loc_Oscillation_Y_Amplitude_118_952CC57C49EF5DCBD7CA5FBF918E756F) == 0x00002C, "Member 'FClip_BCamShake::Loc_Oscillation_Y_Amplitude_118_952CC57C49EF5DCBD7CA5FBF918E756F' has a wrong offset!");
static_assert(offsetof(FClip_BCamShake, Loc_Oscillation_Y_Frequency_120_314785274A7EBE8929BFDBA92B6B9BC7) == 0x000030, "Member 'FClip_BCamShake::Loc_Oscillation_Y_Frequency_120_314785274A7EBE8929BFDBA92B6B9BC7' has a wrong offset!");
static_assert(offsetof(FClip_BCamShake, Loc_Oscillation_Z_Amplitude_119_99FCABDB41F0AD0B3D5C4C9DE871459B) == 0x000034, "Member 'FClip_BCamShake::Loc_Oscillation_Z_Amplitude_119_99FCABDB41F0AD0B3D5C4C9DE871459B' has a wrong offset!");
static_assert(offsetof(FClip_BCamShake, Loc_Oscillation_Z_Frequency_121_5CA906D54FE77E82EF0E26910C86EDE6) == 0x000038, "Member 'FClip_BCamShake::Loc_Oscillation_Z_Frequency_121_5CA906D54FE77E82EF0E26910C86EDE6' has a wrong offset!");

}

