#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_CameraTimeScale

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_CameraTimeScale.Clip_CameraTimeScale
// 0x0010 (0x0010 - 0x0000)
struct FClip_CameraTimeScale final
{
public:
	float                                         TimeScale_2_7947C6494439216EB69580B2D8DA873A;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StoryName_6_B95B32EF47C292AAE4768A8D3EAD22AC;      // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StoryFlagCondition_8_E50002C843E5986D0EB06D8473C9FC2F; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FClip_CameraTimeScale) == 0x000004, "Wrong alignment on FClip_CameraTimeScale");
static_assert(sizeof(FClip_CameraTimeScale) == 0x000010, "Wrong size on FClip_CameraTimeScale");
static_assert(offsetof(FClip_CameraTimeScale, TimeScale_2_7947C6494439216EB69580B2D8DA873A) == 0x000000, "Member 'FClip_CameraTimeScale::TimeScale_2_7947C6494439216EB69580B2D8DA873A' has a wrong offset!");
static_assert(offsetof(FClip_CameraTimeScale, StoryName_6_B95B32EF47C292AAE4768A8D3EAD22AC) == 0x000004, "Member 'FClip_CameraTimeScale::StoryName_6_B95B32EF47C292AAE4768A8D3EAD22AC' has a wrong offset!");
static_assert(offsetof(FClip_CameraTimeScale, StoryFlagCondition_8_E50002C843E5986D0EB06D8473C9FC2F) == 0x00000C, "Member 'FClip_CameraTimeScale::StoryFlagCondition_8_E50002C843E5986D0EB06D8473C9FC2F' has a wrong offset!");

}

