#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_TriggerAbility

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_TriggerAbility.Clip_TriggerAbility
// 0x0014 (0x0014 - 0x0000)
struct FClip_TriggerAbility final
{
public:
	class FName                                   ActorName_2_594196924DC9B431A3A904ACF3CD8359;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Keyword_5_55307E644784ADF1D5A77D959B0D8B41;        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EvalOnSkip_7_00B477B14D12BEA60D13EA934DC2EEEA;     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FClip_TriggerAbility) == 0x000004, "Wrong alignment on FClip_TriggerAbility");
static_assert(sizeof(FClip_TriggerAbility) == 0x000014, "Wrong size on FClip_TriggerAbility");
static_assert(offsetof(FClip_TriggerAbility, ActorName_2_594196924DC9B431A3A904ACF3CD8359) == 0x000000, "Member 'FClip_TriggerAbility::ActorName_2_594196924DC9B431A3A904ACF3CD8359' has a wrong offset!");
static_assert(offsetof(FClip_TriggerAbility, Keyword_5_55307E644784ADF1D5A77D959B0D8B41) == 0x000008, "Member 'FClip_TriggerAbility::Keyword_5_55307E644784ADF1D5A77D959B0D8B41' has a wrong offset!");
static_assert(offsetof(FClip_TriggerAbility, EvalOnSkip_7_00B477B14D12BEA60D13EA934DC2EEEA) == 0x000010, "Member 'FClip_TriggerAbility::EvalOnSkip_7_00B477B14D12BEA60D13EA934DC2EEEA' has a wrong offset!");

}

