#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_PlayLipSync

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_PlayLipSync.Clip_PlayLipSync
// 0x0018 (0x0018 - 0x0000)
struct FClip_PlayLipSync final
{
public:
	class FName                                   ActorName_29_052BF5034665348DF4A413A048B6CE91;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PackName_38_71EF15704947FF9D6A9A7AB87D9BE137;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LipSyncName_37_37111A9B4771290AD82AB0B36E32FBF2;   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_PlayLipSync) == 0x000004, "Wrong alignment on FClip_PlayLipSync");
static_assert(sizeof(FClip_PlayLipSync) == 0x000018, "Wrong size on FClip_PlayLipSync");
static_assert(offsetof(FClip_PlayLipSync, ActorName_29_052BF5034665348DF4A413A048B6CE91) == 0x000000, "Member 'FClip_PlayLipSync::ActorName_29_052BF5034665348DF4A413A048B6CE91' has a wrong offset!");
static_assert(offsetof(FClip_PlayLipSync, PackName_38_71EF15704947FF9D6A9A7AB87D9BE137) == 0x000008, "Member 'FClip_PlayLipSync::PackName_38_71EF15704947FF9D6A9A7AB87D9BE137' has a wrong offset!");
static_assert(offsetof(FClip_PlayLipSync, LipSyncName_37_37111A9B4771290AD82AB0B36E32FBF2) == 0x000010, "Member 'FClip_PlayLipSync::LipSyncName_37_37111A9B4771290AD82AB0B36E32FBF2' has a wrong offset!");

}

