#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_StoryJump

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_StoryJump.Clip_StoryJump
// 0x0050 (0x0050 - 0x0000)
struct FClip_StoryJump final
{
public:
	class FName                                   StoryFlag_15_DAD321354C74B1EB45B2BE8C80F3B417;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   ON_12_2BA2070D487293BBF17529AE25FFBF33;            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   OFF_13_552F1A04483AC55F9E8677B070A0C88B;           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          EvalOnSkip_18_5AE8673B42D7FFB8B593EB806ADE8474;    // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           AdditionalStoryFlags_26_46B69EE14B68DB114997719532C96A51; // 0x0020(0x0010)(Edit, BlueprintVisible)
	bool                                          ANDCondition_34_E99BE63E459C6475E37C129A9F9000D9;  // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          StoryFlagCondition_31_D8DCD6724CBBA1595995359F0F87785B; // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  AdditionalStoryFlagConditions_33_334FDD1741A2769EC57E84A1FD9AE147; // 0x0038(0x0010)(Edit, BlueprintVisible)
	bool                                          ResetSeamlessCameraIfJumpON_41_97D1B5D345F479670FC25F8876C49ADA; // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          ResetSeamlessCameraIfJumpOFF_42_5D78170E4F45159D57EA99809DFCD7F6; // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(FClip_StoryJump) == 0x000008, "Wrong alignment on FClip_StoryJump");
static_assert(sizeof(FClip_StoryJump) == 0x000050, "Wrong size on FClip_StoryJump");
static_assert(offsetof(FClip_StoryJump, StoryFlag_15_DAD321354C74B1EB45B2BE8C80F3B417) == 0x000000, "Member 'FClip_StoryJump::StoryFlag_15_DAD321354C74B1EB45B2BE8C80F3B417' has a wrong offset!");
static_assert(offsetof(FClip_StoryJump, ON_12_2BA2070D487293BBF17529AE25FFBF33) == 0x000008, "Member 'FClip_StoryJump::ON_12_2BA2070D487293BBF17529AE25FFBF33' has a wrong offset!");
static_assert(offsetof(FClip_StoryJump, OFF_13_552F1A04483AC55F9E8677B070A0C88B) == 0x000010, "Member 'FClip_StoryJump::OFF_13_552F1A04483AC55F9E8677B070A0C88B' has a wrong offset!");
static_assert(offsetof(FClip_StoryJump, EvalOnSkip_18_5AE8673B42D7FFB8B593EB806ADE8474) == 0x000018, "Member 'FClip_StoryJump::EvalOnSkip_18_5AE8673B42D7FFB8B593EB806ADE8474' has a wrong offset!");
static_assert(offsetof(FClip_StoryJump, AdditionalStoryFlags_26_46B69EE14B68DB114997719532C96A51) == 0x000020, "Member 'FClip_StoryJump::AdditionalStoryFlags_26_46B69EE14B68DB114997719532C96A51' has a wrong offset!");
static_assert(offsetof(FClip_StoryJump, ANDCondition_34_E99BE63E459C6475E37C129A9F9000D9) == 0x000030, "Member 'FClip_StoryJump::ANDCondition_34_E99BE63E459C6475E37C129A9F9000D9' has a wrong offset!");
static_assert(offsetof(FClip_StoryJump, StoryFlagCondition_31_D8DCD6724CBBA1595995359F0F87785B) == 0x000031, "Member 'FClip_StoryJump::StoryFlagCondition_31_D8DCD6724CBBA1595995359F0F87785B' has a wrong offset!");
static_assert(offsetof(FClip_StoryJump, AdditionalStoryFlagConditions_33_334FDD1741A2769EC57E84A1FD9AE147) == 0x000038, "Member 'FClip_StoryJump::AdditionalStoryFlagConditions_33_334FDD1741A2769EC57E84A1FD9AE147' has a wrong offset!");
static_assert(offsetof(FClip_StoryJump, ResetSeamlessCameraIfJumpON_41_97D1B5D345F479670FC25F8876C49ADA) == 0x000048, "Member 'FClip_StoryJump::ResetSeamlessCameraIfJumpON_41_97D1B5D345F479670FC25F8876C49ADA' has a wrong offset!");
static_assert(offsetof(FClip_StoryJump, ResetSeamlessCameraIfJumpOFF_42_5D78170E4F45159D57EA99809DFCD7F6) == 0x000049, "Member 'FClip_StoryJump::ResetSeamlessCameraIfJumpOFF_42_5D78170E4F45159D57EA99809DFCD7F6' has a wrong offset!");

}

