#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_SwitchVolumeForDebug

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_SwitchVolumeForDebug.Clip_SwitchVolumeForDebug
// 0x0018 (0x0018 - 0x0000)
struct FClip_SwitchVolumeForDebug final
{
public:
	class FName                                   VolumeLabel_5_2CBFF0A24CD48DB0234270B5DA773174;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Hidden_13_768864884AB88715C3ABE2A6FD56E390;        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SwitchLabel_14_8719736943F203A6DBE421B9D012B350;   // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EEndStreamingSwitchType                       SwitchType_12_96FF8C96475E74994F1D41A9B8870454;    // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(FClip_SwitchVolumeForDebug) == 0x000004, "Wrong alignment on FClip_SwitchVolumeForDebug");
static_assert(sizeof(FClip_SwitchVolumeForDebug) == 0x000018, "Wrong size on FClip_SwitchVolumeForDebug");
static_assert(offsetof(FClip_SwitchVolumeForDebug, VolumeLabel_5_2CBFF0A24CD48DB0234270B5DA773174) == 0x000000, "Member 'FClip_SwitchVolumeForDebug::VolumeLabel_5_2CBFF0A24CD48DB0234270B5DA773174' has a wrong offset!");
static_assert(offsetof(FClip_SwitchVolumeForDebug, Hidden_13_768864884AB88715C3ABE2A6FD56E390) == 0x000008, "Member 'FClip_SwitchVolumeForDebug::Hidden_13_768864884AB88715C3ABE2A6FD56E390' has a wrong offset!");
static_assert(offsetof(FClip_SwitchVolumeForDebug, SwitchLabel_14_8719736943F203A6DBE421B9D012B350) == 0x00000C, "Member 'FClip_SwitchVolumeForDebug::SwitchLabel_14_8719736943F203A6DBE421B9D012B350' has a wrong offset!");
static_assert(offsetof(FClip_SwitchVolumeForDebug, SwitchType_12_96FF8C96475E74994F1D41A9B8870454) == 0x000014, "Member 'FClip_SwitchVolumeForDebug::SwitchType_12_96FF8C96475E74994F1D41A9B8870454' has a wrong offset!");

}

