#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_ApplyChocoboEquip

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_ApplyChocoboEquip.Clip_ApplyChocoboEquip
// 0x0020 (0x0020 - 0x0000)
struct FClip_ApplyChocoboEquip final
{
public:
	TArray<class FName>                           ActorNames_5_12D249DE478723ABF5731B82A96558D0;     // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FName                                   ChocoboSpec_8_85E347FE4E9CA9B343FEB6AA7788EA75;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          bApplyEquip_10_3AEC51E7414A83F4795021B1BAC3A17E;   // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(FClip_ApplyChocoboEquip) == 0x000008, "Wrong alignment on FClip_ApplyChocoboEquip");
static_assert(sizeof(FClip_ApplyChocoboEquip) == 0x000020, "Wrong size on FClip_ApplyChocoboEquip");
static_assert(offsetof(FClip_ApplyChocoboEquip, ActorNames_5_12D249DE478723ABF5731B82A96558D0) == 0x000000, "Member 'FClip_ApplyChocoboEquip::ActorNames_5_12D249DE478723ABF5731B82A96558D0' has a wrong offset!");
static_assert(offsetof(FClip_ApplyChocoboEquip, ChocoboSpec_8_85E347FE4E9CA9B343FEB6AA7788EA75) == 0x000010, "Member 'FClip_ApplyChocoboEquip::ChocoboSpec_8_85E347FE4E9CA9B343FEB6AA7788EA75' has a wrong offset!");
static_assert(offsetof(FClip_ApplyChocoboEquip, bApplyEquip_10_3AEC51E7414A83F4795021B1BAC3A17E) == 0x000018, "Member 'FClip_ApplyChocoboEquip::bApplyEquip_10_3AEC51E7414A83F4795021B1BAC3A17E' has a wrong offset!");

}

