#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_ActorDraw

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_ActorDraw.Clip_ActorDraw
// 0x000C (0x000C - 0x0000)
struct FClip_ActorDraw final
{
public:
	class FName                                   ActorName_34_AE6F648142F232AD3900D6BB39044FE0;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Hidden_29_B620A2B3462916D5B03C8D98B72CC288;        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          ForceAnimEval_36_25A27BFF4610F31E115B8197DBB2561F; // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(FClip_ActorDraw) == 0x000004, "Wrong alignment on FClip_ActorDraw");
static_assert(sizeof(FClip_ActorDraw) == 0x00000C, "Wrong size on FClip_ActorDraw");
static_assert(offsetof(FClip_ActorDraw, ActorName_34_AE6F648142F232AD3900D6BB39044FE0) == 0x000000, "Member 'FClip_ActorDraw::ActorName_34_AE6F648142F232AD3900D6BB39044FE0' has a wrong offset!");
static_assert(offsetof(FClip_ActorDraw, Hidden_29_B620A2B3462916D5B03C8D98B72CC288) == 0x000008, "Member 'FClip_ActorDraw::Hidden_29_B620A2B3462916D5B03C8D98B72CC288' has a wrong offset!");
static_assert(offsetof(FClip_ActorDraw, ForceAnimEval_36_25A27BFF4610F31E115B8197DBB2561F) == 0x000009, "Member 'FClip_ActorDraw::ForceAnimEval_36_25A27BFF4610F31E115B8197DBB2561F' has a wrong offset!");

}

