#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_TextureForceResidentMode

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_TextureForceResidentMode.Clip_TextureForceResidentMode
// 0x0018 (0x0018 - 0x0000)
struct FClip_TextureForceResidentMode final
{
public:
	TArray<class FName>                           ActorNames_6_2441A609482D68D8690EEDA07021BBEC;     // 0x0000(0x0010)(Edit, BlueprintVisible)
	bool                                          bEnable_9_FE6CD53D4BEE018E0A16C9AE82886790;        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Duration_11_077BC481480780D9B249B7A4C2EDFF85;      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(FClip_TextureForceResidentMode) == 0x000008, "Wrong alignment on FClip_TextureForceResidentMode");
static_assert(sizeof(FClip_TextureForceResidentMode) == 0x000018, "Wrong size on FClip_TextureForceResidentMode");
static_assert(offsetof(FClip_TextureForceResidentMode, ActorNames_6_2441A609482D68D8690EEDA07021BBEC) == 0x000000, "Member 'FClip_TextureForceResidentMode::ActorNames_6_2441A609482D68D8690EEDA07021BBEC' has a wrong offset!");
static_assert(offsetof(FClip_TextureForceResidentMode, bEnable_9_FE6CD53D4BEE018E0A16C9AE82886790) == 0x000010, "Member 'FClip_TextureForceResidentMode::bEnable_9_FE6CD53D4BEE018E0A16C9AE82886790' has a wrong offset!");
static_assert(offsetof(FClip_TextureForceResidentMode, Duration_11_077BC481480780D9B249B7A4C2EDFF85) == 0x000014, "Member 'FClip_TextureForceResidentMode::Duration_11_077BC481480780D9B249B7A4C2EDFF85' has a wrong offset!");

}

