#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_PlannerEventStartAddViewSlaveLocation

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_PlannerEventStartAddViewSlaveLocation.Clip_PlannerEventStartAddViewSlaveLocation
// 0x0028 (0x0028 - 0x0000)
struct FClip_PlannerEventStartAddViewSlaveLocation final
{
public:
	class FName                                   EventName_3_F35333B248AA15261A500DB2F4687703;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class FName>                           EventNames_9_F3BD6A3A458468DA1ACF148F42952750;     // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           StateConditions_11_332BA2F84F36F3E9800643A1939AE0E1; // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FClip_PlannerEventStartAddViewSlaveLocation) == 0x000008, "Wrong alignment on FClip_PlannerEventStartAddViewSlaveLocation");
static_assert(sizeof(FClip_PlannerEventStartAddViewSlaveLocation) == 0x000028, "Wrong size on FClip_PlannerEventStartAddViewSlaveLocation");
static_assert(offsetof(FClip_PlannerEventStartAddViewSlaveLocation, EventName_3_F35333B248AA15261A500DB2F4687703) == 0x000000, "Member 'FClip_PlannerEventStartAddViewSlaveLocation::EventName_3_F35333B248AA15261A500DB2F4687703' has a wrong offset!");
static_assert(offsetof(FClip_PlannerEventStartAddViewSlaveLocation, EventNames_9_F3BD6A3A458468DA1ACF148F42952750) == 0x000008, "Member 'FClip_PlannerEventStartAddViewSlaveLocation::EventNames_9_F3BD6A3A458468DA1ACF148F42952750' has a wrong offset!");
static_assert(offsetof(FClip_PlannerEventStartAddViewSlaveLocation, StateConditions_11_332BA2F84F36F3E9800643A1939AE0E1) == 0x000018, "Member 'FClip_PlannerEventStartAddViewSlaveLocation::StateConditions_11_332BA2F84F36F3E9800643A1939AE0E1' has a wrong offset!");

}

