#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_StoryVoice

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_StoryVoice.Clip_StoryVoice
// 0x0028 (0x0028 - 0x0000)
struct FClip_StoryVoice final
{
public:
	class FName                                   VoiceName_8_4791FD294A9F065ED2E8549D5ED54E9F;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndCutLangType                               Language_9_A2E158AC4C5EFF9DB57AE2B0DDA3D9BD;       // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActorName_17_57E8CA5F48E571D5977E139AD7CB1B3D;     // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEndCutStoryFlagConditionItem>  FlagConditions_14_6C6203C5423A8A77FF5B07939DFF0CBE; // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FClip_StoryVoice) == 0x000008, "Wrong alignment on FClip_StoryVoice");
static_assert(sizeof(FClip_StoryVoice) == 0x000028, "Wrong size on FClip_StoryVoice");
static_assert(offsetof(FClip_StoryVoice, VoiceName_8_4791FD294A9F065ED2E8549D5ED54E9F) == 0x000000, "Member 'FClip_StoryVoice::VoiceName_8_4791FD294A9F065ED2E8549D5ED54E9F' has a wrong offset!");
static_assert(offsetof(FClip_StoryVoice, Language_9_A2E158AC4C5EFF9DB57AE2B0DDA3D9BD) == 0x000008, "Member 'FClip_StoryVoice::Language_9_A2E158AC4C5EFF9DB57AE2B0DDA3D9BD' has a wrong offset!");
static_assert(offsetof(FClip_StoryVoice, ActorName_17_57E8CA5F48E571D5977E139AD7CB1B3D) == 0x00000C, "Member 'FClip_StoryVoice::ActorName_17_57E8CA5F48E571D5977E139AD7CB1B3D' has a wrong offset!");
static_assert(offsetof(FClip_StoryVoice, FlagConditions_14_6C6203C5423A8A77FF5B07939DFF0CBE) == 0x000018, "Member 'FClip_StoryVoice::FlagConditions_14_6C6203C5423A8A77FF5B07939DFF0CBE' has a wrong offset!");

}

