#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_ViewSlaveLocationFarClippingPlane

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_ViewSlaveLocationFarClippingPlane.Clip_ViewSlaveLocationFarClippingPlane
// 0x0014 (0x0014 - 0x0000)
struct FClip_ViewSlaveLocationFarClippingPlane final
{
public:
	float                                         Distance_3_AF52D18B447D77147493E489333F6B69;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          bReset_4_926AA0CB4EE1406C6C3DDE9A5F35A247;         // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	EEndCutEnableAddViewSlaveLocation             OverrideEnableAddView_9_950FA63842623E3D80014593EBCA0903; // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShadowDistance_14_8371E62D47D7B8EBD069BF94E532A090; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EEndCutEnableAddViewSlaveLocation             OverrideEnableAddViewShadow_21_B98EEB0C49DD333F2ADA4EA354A465C7; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverrideOverBudgetMargin_24_1DBC5B2D4E6AA807CC467EAC49FFC500; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(FClip_ViewSlaveLocationFarClippingPlane) == 0x000004, "Wrong alignment on FClip_ViewSlaveLocationFarClippingPlane");
static_assert(sizeof(FClip_ViewSlaveLocationFarClippingPlane) == 0x000014, "Wrong size on FClip_ViewSlaveLocationFarClippingPlane");
static_assert(offsetof(FClip_ViewSlaveLocationFarClippingPlane, Distance_3_AF52D18B447D77147493E489333F6B69) == 0x000000, "Member 'FClip_ViewSlaveLocationFarClippingPlane::Distance_3_AF52D18B447D77147493E489333F6B69' has a wrong offset!");
static_assert(offsetof(FClip_ViewSlaveLocationFarClippingPlane, bReset_4_926AA0CB4EE1406C6C3DDE9A5F35A247) == 0x000004, "Member 'FClip_ViewSlaveLocationFarClippingPlane::bReset_4_926AA0CB4EE1406C6C3DDE9A5F35A247' has a wrong offset!");
static_assert(offsetof(FClip_ViewSlaveLocationFarClippingPlane, OverrideEnableAddView_9_950FA63842623E3D80014593EBCA0903) == 0x000005, "Member 'FClip_ViewSlaveLocationFarClippingPlane::OverrideEnableAddView_9_950FA63842623E3D80014593EBCA0903' has a wrong offset!");
static_assert(offsetof(FClip_ViewSlaveLocationFarClippingPlane, ShadowDistance_14_8371E62D47D7B8EBD069BF94E532A090) == 0x000008, "Member 'FClip_ViewSlaveLocationFarClippingPlane::ShadowDistance_14_8371E62D47D7B8EBD069BF94E532A090' has a wrong offset!");
static_assert(offsetof(FClip_ViewSlaveLocationFarClippingPlane, OverrideEnableAddViewShadow_21_B98EEB0C49DD333F2ADA4EA354A465C7) == 0x00000C, "Member 'FClip_ViewSlaveLocationFarClippingPlane::OverrideEnableAddViewShadow_21_B98EEB0C49DD333F2ADA4EA354A465C7' has a wrong offset!");
static_assert(offsetof(FClip_ViewSlaveLocationFarClippingPlane, OverrideOverBudgetMargin_24_1DBC5B2D4E6AA807CC467EAC49FFC500) == 0x000010, "Member 'FClip_ViewSlaveLocationFarClippingPlane::OverrideOverBudgetMargin_24_1DBC5B2D4E6AA807CC467EAC49FFC500' has a wrong offset!");

}

