#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_LovelessPlayMiniGameResultScreen

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_LovelessPlayMiniGameResultScreen.Clip_LovelessPlayMiniGameResultScreen
// 0x0003 (0x0003 - 0x0000)
struct FClip_LovelessPlayMiniGameResultScreen final
{
public:
	bool                                          Show_62_C6B2ED9E46658F5DCB520C98721C4A88;          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          ViewRank_68_55734151498B84BFEA0DAB889CE3824E;      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          PlayFinish_65_418E72F347AC40320E6558A8232AF1E5;    // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(FClip_LovelessPlayMiniGameResultScreen) == 0x000001, "Wrong alignment on FClip_LovelessPlayMiniGameResultScreen");
static_assert(sizeof(FClip_LovelessPlayMiniGameResultScreen) == 0x000003, "Wrong size on FClip_LovelessPlayMiniGameResultScreen");
static_assert(offsetof(FClip_LovelessPlayMiniGameResultScreen, Show_62_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_LovelessPlayMiniGameResultScreen::Show_62_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_LovelessPlayMiniGameResultScreen, ViewRank_68_55734151498B84BFEA0DAB889CE3824E) == 0x000001, "Member 'FClip_LovelessPlayMiniGameResultScreen::ViewRank_68_55734151498B84BFEA0DAB889CE3824E' has a wrong offset!");
static_assert(offsetof(FClip_LovelessPlayMiniGameResultScreen, PlayFinish_65_418E72F347AC40320E6558A8232AF1E5) == 0x000002, "Member 'FClip_LovelessPlayMiniGameResultScreen::PlayFinish_65_418E72F347AC40320E6558A8232AF1E5' has a wrong offset!");

}

