#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_JumpWithBlend

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_JumpWithBlend.Clip_JumpWithBlend
// 0x0014 (0x0014 - 0x0000)
struct FClip_JumpWithBlend final
{
public:
	class FName                                   StoryFlag_48_7CBE103D4AF38A0DE2078AA4E45848D0;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   Goto_52_BF3543C746ED03208DA00B8F33A019E7;          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         BlendTime_51_4C9820C64F6B49E5F416FCAA053A05B9;     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(FClip_JumpWithBlend) == 0x000004, "Wrong alignment on FClip_JumpWithBlend");
static_assert(sizeof(FClip_JumpWithBlend) == 0x000014, "Wrong size on FClip_JumpWithBlend");
static_assert(offsetof(FClip_JumpWithBlend, StoryFlag_48_7CBE103D4AF38A0DE2078AA4E45848D0) == 0x000000, "Member 'FClip_JumpWithBlend::StoryFlag_48_7CBE103D4AF38A0DE2078AA4E45848D0' has a wrong offset!");
static_assert(offsetof(FClip_JumpWithBlend, Goto_52_BF3543C746ED03208DA00B8F33A019E7) == 0x000008, "Member 'FClip_JumpWithBlend::Goto_52_BF3543C746ED03208DA00B8F33A019E7' has a wrong offset!");
static_assert(offsetof(FClip_JumpWithBlend, BlendTime_51_4C9820C64F6B49E5F416FCAA053A05B9) == 0x000010, "Member 'FClip_JumpWithBlend::BlendTime_51_4C9820C64F6B49E5F416FCAA053A05B9' has a wrong offset!");

}

