#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Com_Btn_01

#include "Basic.hpp"


namespace SDK::Params
{

// Function Com_Btn_01.Com_Btn_01_C.ExecuteUbergraph_Com_Btn_01
// 0x0008 (0x0008 - 0x0000)
struct Com_Btn_01_C_ExecuteUbergraph_Com_Btn_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_2;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Com_Btn_01_C_ExecuteUbergraph_Com_Btn_01) == 0x000004, "Wrong alignment on Com_Btn_01_C_ExecuteUbergraph_Com_Btn_01");
static_assert(sizeof(Com_Btn_01_C_ExecuteUbergraph_Com_Btn_01) == 0x000008, "Wrong size on Com_Btn_01_C_ExecuteUbergraph_Com_Btn_01");
static_assert(offsetof(Com_Btn_01_C_ExecuteUbergraph_Com_Btn_01, EntryPoint) == 0x000000, "Member 'Com_Btn_01_C_ExecuteUbergraph_Com_Btn_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Com_Btn_01_C_ExecuteUbergraph_Com_Btn_01, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'Com_Btn_01_C_ExecuteUbergraph_Com_Btn_01::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Com_Btn_01_C_ExecuteUbergraph_Com_Btn_01, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000005, "Member 'Com_Btn_01_C_ExecuteUbergraph_Com_Btn_01::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Com_Btn_01_C_ExecuteUbergraph_Com_Btn_01, CallFunc_PlayAnimationByName_ReturnValue_2) == 0x000006, "Member 'Com_Btn_01_C_ExecuteUbergraph_Com_Btn_01::CallFunc_PlayAnimationByName_ReturnValue_2' has a wrong offset!");

}

