#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Com_Btn_00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Com_Btn_00.Com_Btn_00_C
// 0x0070 (0x0438 - 0x03C8)
class UCom_Btn_00_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Hover;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Hover_Light;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Button_00;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DecoL;                                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DecoR;                                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Left;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Right;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LightDotL;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LightDotR;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt;                                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Com_Btn_00(int32 EntryPoint);
	void BndEvt__Button_00_K2Node_ComponentBoundEvent_351_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_00_K2Node_ComponentBoundEvent_338_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Com_Btn_00_C">();
	}
	static class UCom_Btn_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCom_Btn_00_C>();
	}
};
static_assert(alignof(UCom_Btn_00_C) == 0x000008, "Wrong alignment on UCom_Btn_00_C");
static_assert(sizeof(UCom_Btn_00_C) == 0x000438, "Wrong size on UCom_Btn_00_C");
static_assert(offsetof(UCom_Btn_00_C, UberGraphFrame) == 0x0003C8, "Member 'UCom_Btn_00_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, Loop) == 0x0003D0, "Member 'UCom_Btn_00_C::Loop' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, BtnHover) == 0x0003D8, "Member 'UCom_Btn_00_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, Base) == 0x0003E0, "Member 'UCom_Btn_00_C::Base' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, Base_Hover) == 0x0003E8, "Member 'UCom_Btn_00_C::Base_Hover' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, Base_Hover_Light) == 0x0003F0, "Member 'UCom_Btn_00_C::Base_Hover_Light' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, Button_00) == 0x0003F8, "Member 'UCom_Btn_00_C::Button_00' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, DecoL) == 0x000400, "Member 'UCom_Btn_00_C::DecoL' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, DecoR) == 0x000408, "Member 'UCom_Btn_00_C::DecoR' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, Icon_Left) == 0x000410, "Member 'UCom_Btn_00_C::Icon_Left' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, Icon_Right) == 0x000418, "Member 'UCom_Btn_00_C::Icon_Right' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, LightDotL) == 0x000420, "Member 'UCom_Btn_00_C::LightDotL' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, LightDotR) == 0x000428, "Member 'UCom_Btn_00_C::LightDotR' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, Txt) == 0x000430, "Member 'UCom_Btn_00_C::Txt' has a wrong offset!");

}

