#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Com_Window_01

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Com_Window_01.Com_Window_01_C
// 0x0098 (0x04A8 - 0x0410)
class UCom_Window_01_C final : public UEndMessageWindow
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCom_Btn_01_C*                          Btn_00;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCom_Btn_01_C*                          Btn_01;                                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconBase2;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconBaseLight;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconFrame;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconFrame_1Light;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconFrame_2Light;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLineLeft;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLineRight;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LEFT;                                              // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              RIGHT;                                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Star1;                                             // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Star2;                                             // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Icon;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn;                                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Com_Window_01_C">();
	}
	static class UCom_Window_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCom_Window_01_C>();
	}
};
static_assert(alignof(UCom_Window_01_C) == 0x000008, "Wrong alignment on UCom_Window_01_C");
static_assert(sizeof(UCom_Window_01_C) == 0x0004A8, "Wrong size on UCom_Window_01_C");
static_assert(offsetof(UCom_Window_01_C, Out) == 0x000410, "Member 'UCom_Window_01_C::Out' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, In) == 0x000418, "Member 'UCom_Window_01_C::In' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, Bg) == 0x000420, "Member 'UCom_Window_01_C::Bg' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, Btn_00) == 0x000428, "Member 'UCom_Window_01_C::Btn_00' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, Btn_01) == 0x000430, "Member 'UCom_Window_01_C::Btn_01' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, Frame) == 0x000438, "Member 'UCom_Window_01_C::Frame' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, IconBase2) == 0x000440, "Member 'UCom_Window_01_C::IconBase2' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, IconBaseLight) == 0x000448, "Member 'UCom_Window_01_C::IconBaseLight' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, IconFrame) == 0x000450, "Member 'UCom_Window_01_C::IconFrame' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, IconFrame_1Light) == 0x000458, "Member 'UCom_Window_01_C::IconFrame_1Light' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, IconFrame_2Light) == 0x000460, "Member 'UCom_Window_01_C::IconFrame_2Light' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, IconLineLeft) == 0x000468, "Member 'UCom_Window_01_C::IconLineLeft' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, IconLineRight) == 0x000470, "Member 'UCom_Window_01_C::IconLineRight' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, LEFT) == 0x000478, "Member 'UCom_Window_01_C::LEFT' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, RIGHT) == 0x000480, "Member 'UCom_Window_01_C::RIGHT' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, Star1) == 0x000488, "Member 'UCom_Window_01_C::Star1' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, Star2) == 0x000490, "Member 'UCom_Window_01_C::Star2' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, Title_Icon) == 0x000498, "Member 'UCom_Window_01_C::Title_Icon' has a wrong offset!");
static_assert(offsetof(UCom_Window_01_C, Txt_Btn) == 0x0004A0, "Member 'UCom_Window_01_C::Txt_Btn' has a wrong offset!");

}

