#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_PartySet_00

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_PartySet_00.Command_PartySet_00_C
// 0x0058 (0x0420 - 0x03C8)
class UCommand_PartySet_00_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Running;                                           // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Enable;                                            // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Disabled;                                          // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_BtnGuide;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommand_BtnPressedEffect_C*            BtnPressedEffect;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Retry_00;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Retry_01;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_00;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Effect_00;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReserveMemberCommand_Effect_C*         ReserveMemberCommand_Effect;                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_PartySet_00_C">();
	}
	static class UCommand_PartySet_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_PartySet_00_C>();
	}
};
static_assert(alignof(UCommand_PartySet_00_C) == 0x000008, "Wrong alignment on UCommand_PartySet_00_C");
static_assert(sizeof(UCommand_PartySet_00_C) == 0x000420, "Wrong size on UCommand_PartySet_00_C");
static_assert(offsetof(UCommand_PartySet_00_C, Running) == 0x0003C8, "Member 'UCommand_PartySet_00_C::Running' has a wrong offset!");
static_assert(offsetof(UCommand_PartySet_00_C, Enable) == 0x0003D0, "Member 'UCommand_PartySet_00_C::Enable' has a wrong offset!");
static_assert(offsetof(UCommand_PartySet_00_C, Disabled) == 0x0003D8, "Member 'UCommand_PartySet_00_C::Disabled' has a wrong offset!");
static_assert(offsetof(UCommand_PartySet_00_C, In) == 0x0003E0, "Member 'UCommand_PartySet_00_C::In' has a wrong offset!");
static_assert(offsetof(UCommand_PartySet_00_C, Base_BtnGuide) == 0x0003E8, "Member 'UCommand_PartySet_00_C::Base_BtnGuide' has a wrong offset!");
static_assert(offsetof(UCommand_PartySet_00_C, BtnPressedEffect) == 0x0003F0, "Member 'UCommand_PartySet_00_C::BtnPressedEffect' has a wrong offset!");
static_assert(offsetof(UCommand_PartySet_00_C, Effect_Retry_00) == 0x0003F8, "Member 'UCommand_PartySet_00_C::Effect_Retry_00' has a wrong offset!");
static_assert(offsetof(UCommand_PartySet_00_C, Effect_Retry_01) == 0x000400, "Member 'UCommand_PartySet_00_C::Effect_Retry_01' has a wrong offset!");
static_assert(offsetof(UCommand_PartySet_00_C, Gauge_00) == 0x000408, "Member 'UCommand_PartySet_00_C::Gauge_00' has a wrong offset!");
static_assert(offsetof(UCommand_PartySet_00_C, Img_Effect_00) == 0x000410, "Member 'UCommand_PartySet_00_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UCommand_PartySet_00_C, ReserveMemberCommand_Effect) == 0x000418, "Member 'UCommand_PartySet_00_C::ReserveMemberCommand_Effect' has a wrong offset!");

}

