#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_CellPage

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_CellPage.Command_CellPage_C
// 0x0038 (0x0400 - 0x03C8)
class UCommand_CellPage_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       CellPage_L1_R0;                                    // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CellPage_L1_R1;                                    // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CellPage_L0_R1;                                    // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_Command_CellPage;                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Arrow_L00;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Arrow_R00;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_CellPage;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_CellPage_C">();
	}
	static class UCommand_CellPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_CellPage_C>();
	}
};
static_assert(alignof(UCommand_CellPage_C) == 0x000008, "Wrong alignment on UCommand_CellPage_C");
static_assert(sizeof(UCommand_CellPage_C) == 0x000400, "Wrong size on UCommand_CellPage_C");
static_assert(offsetof(UCommand_CellPage_C, CellPage_L1_R0) == 0x0003C8, "Member 'UCommand_CellPage_C::CellPage_L1_R0' has a wrong offset!");
static_assert(offsetof(UCommand_CellPage_C, CellPage_L1_R1) == 0x0003D0, "Member 'UCommand_CellPage_C::CellPage_L1_R1' has a wrong offset!");
static_assert(offsetof(UCommand_CellPage_C, CellPage_L0_R1) == 0x0003D8, "Member 'UCommand_CellPage_C::CellPage_L0_R1' has a wrong offset!");
static_assert(offsetof(UCommand_CellPage_C, All_Command_CellPage) == 0x0003E0, "Member 'UCommand_CellPage_C::All_Command_CellPage' has a wrong offset!");
static_assert(offsetof(UCommand_CellPage_C, Img_Arrow_L00) == 0x0003E8, "Member 'UCommand_CellPage_C::Img_Arrow_L00' has a wrong offset!");
static_assert(offsetof(UCommand_CellPage_C, Img_Arrow_R00) == 0x0003F0, "Member 'UCommand_CellPage_C::Img_Arrow_R00' has a wrong offset!");
static_assert(offsetof(UCommand_CellPage_C, Pnl_CellPage) == 0x0003F8, "Member 'UCommand_CellPage_C::Pnl_CellPage' has a wrong offset!");

}

