#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_ChainInfo

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_ChainInfo.Command_ChainInfo_C
// 0x0030 (0x03F8 - 0x03C8)
class UCommand_ChainInfo_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       vision;                                            // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MP;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Limit;                                             // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Burst;                                             // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_00;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_00;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_ChainInfo_C">();
	}
	static class UCommand_ChainInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_ChainInfo_C>();
	}
};
static_assert(alignof(UCommand_ChainInfo_C) == 0x000008, "Wrong alignment on UCommand_ChainInfo_C");
static_assert(sizeof(UCommand_ChainInfo_C) == 0x0003F8, "Wrong size on UCommand_ChainInfo_C");
static_assert(offsetof(UCommand_ChainInfo_C, vision) == 0x0003C8, "Member 'UCommand_ChainInfo_C::vision' has a wrong offset!");
static_assert(offsetof(UCommand_ChainInfo_C, MP) == 0x0003D0, "Member 'UCommand_ChainInfo_C::MP' has a wrong offset!");
static_assert(offsetof(UCommand_ChainInfo_C, Limit) == 0x0003D8, "Member 'UCommand_ChainInfo_C::Limit' has a wrong offset!");
static_assert(offsetof(UCommand_ChainInfo_C, Burst) == 0x0003E0, "Member 'UCommand_ChainInfo_C::Burst' has a wrong offset!");
static_assert(offsetof(UCommand_ChainInfo_C, Base_00) == 0x0003E8, "Member 'UCommand_ChainInfo_C::Base_00' has a wrong offset!");
static_assert(offsetof(UCommand_ChainInfo_C, Icon_00) == 0x0003F0, "Member 'UCommand_ChainInfo_C::Icon_00' has a wrong offset!");

}

