#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_ReserveEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_ReserveEffect.Command_ReserveEffect_C
// 0x0048 (0x0410 - 0x03C8)
class UCommand_ReserveEffect_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Effect_Gradation;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Gradation2_1;                               // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Gradation2_Add;                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light_00;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light_01;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Reserve;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Reserve_Add;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Command_ReserveEffect(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_ReserveEffect_C">();
	}
	static class UCommand_ReserveEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_ReserveEffect_C>();
	}
};
static_assert(alignof(UCommand_ReserveEffect_C) == 0x000008, "Wrong alignment on UCommand_ReserveEffect_C");
static_assert(sizeof(UCommand_ReserveEffect_C) == 0x000410, "Wrong size on UCommand_ReserveEffect_C");
static_assert(offsetof(UCommand_ReserveEffect_C, UberGraphFrame) == 0x0003C8, "Member 'UCommand_ReserveEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCommand_ReserveEffect_C, Loop) == 0x0003D0, "Member 'UCommand_ReserveEffect_C::Loop' has a wrong offset!");
static_assert(offsetof(UCommand_ReserveEffect_C, Effect_Gradation) == 0x0003D8, "Member 'UCommand_ReserveEffect_C::Effect_Gradation' has a wrong offset!");
static_assert(offsetof(UCommand_ReserveEffect_C, Effect_Gradation2_1) == 0x0003E0, "Member 'UCommand_ReserveEffect_C::Effect_Gradation2_1' has a wrong offset!");
static_assert(offsetof(UCommand_ReserveEffect_C, Effect_Gradation2_Add) == 0x0003E8, "Member 'UCommand_ReserveEffect_C::Effect_Gradation2_Add' has a wrong offset!");
static_assert(offsetof(UCommand_ReserveEffect_C, Light_00) == 0x0003F0, "Member 'UCommand_ReserveEffect_C::Light_00' has a wrong offset!");
static_assert(offsetof(UCommand_ReserveEffect_C, Light_01) == 0x0003F8, "Member 'UCommand_ReserveEffect_C::Light_01' has a wrong offset!");
static_assert(offsetof(UCommand_ReserveEffect_C, Reserve) == 0x000400, "Member 'UCommand_ReserveEffect_C::Reserve' has a wrong offset!");
static_assert(offsetof(UCommand_ReserveEffect_C, Reserve_Add) == 0x000408, "Member 'UCommand_ReserveEffect_C::Reserve_Add' has a wrong offset!");

}

