#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_Return_Btn

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_Return_Btn.Command_Return_Btn_C
// 0x0030 (0x0410 - 0x03E0)
class UCommand_Return_Btn_C final : public UEndFieldReturnFastTravelIcon
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndButton*                             Btn_00;                                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           Gauge_00;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              GaugeBG;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BG;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_Return_Btn_C">();
	}
	static class UCommand_Return_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_Return_Btn_C>();
	}
};
static_assert(alignof(UCommand_Return_Btn_C) == 0x000008, "Wrong alignment on UCommand_Return_Btn_C");
static_assert(sizeof(UCommand_Return_Btn_C) == 0x000410, "Wrong size on UCommand_Return_Btn_C");
static_assert(offsetof(UCommand_Return_Btn_C, Out) == 0x0003E0, "Member 'UCommand_Return_Btn_C::Out' has a wrong offset!");
static_assert(offsetof(UCommand_Return_Btn_C, In) == 0x0003E8, "Member 'UCommand_Return_Btn_C::In' has a wrong offset!");
static_assert(offsetof(UCommand_Return_Btn_C, Btn_00) == 0x0003F0, "Member 'UCommand_Return_Btn_C::Btn_00' has a wrong offset!");
static_assert(offsetof(UCommand_Return_Btn_C, Gauge_00) == 0x0003F8, "Member 'UCommand_Return_Btn_C::Gauge_00' has a wrong offset!");
static_assert(offsetof(UCommand_Return_Btn_C, GaugeBG) == 0x000400, "Member 'UCommand_Return_Btn_C::GaugeBG' has a wrong offset!");
static_assert(offsetof(UCommand_Return_Btn_C, Img_BG) == 0x000408, "Member 'UCommand_Return_Btn_C::Img_BG' has a wrong offset!");

}

