#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_BtnPressedEffect

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_BtnPressedEffect.Command_BtnPressedEffect_C
// 0x0020 (0x03E8 - 0x03C8)
class UCommand_BtnPressedEffect_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Pressed;                                           // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_02;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_BtnPressedEffect_C">();
	}
	static class UCommand_BtnPressedEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_BtnPressedEffect_C>();
	}
};
static_assert(alignof(UCommand_BtnPressedEffect_C) == 0x000008, "Wrong alignment on UCommand_BtnPressedEffect_C");
static_assert(sizeof(UCommand_BtnPressedEffect_C) == 0x0003E8, "Wrong size on UCommand_BtnPressedEffect_C");
static_assert(offsetof(UCommand_BtnPressedEffect_C, Pressed) == 0x0003C8, "Member 'UCommand_BtnPressedEffect_C::Pressed' has a wrong offset!");
static_assert(offsetof(UCommand_BtnPressedEffect_C, Img_BtnLight) == 0x0003D0, "Member 'UCommand_BtnPressedEffect_C::Img_BtnLight' has a wrong offset!");
static_assert(offsetof(UCommand_BtnPressedEffect_C, Img_Effect_01) == 0x0003D8, "Member 'UCommand_BtnPressedEffect_C::Img_Effect_01' has a wrong offset!");
static_assert(offsetof(UCommand_BtnPressedEffect_C, Img_Effect_02) == 0x0003E0, "Member 'UCommand_BtnPressedEffect_C::Img_Effect_02' has a wrong offset!");

}

