#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_ShortCut_List_00

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_ShortCut_List_00.Command_ShortCut_List_00_C
// 0x00A8 (0x0470 - 0x03C8)
class UCommand_ShortCut_List_00_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       SwitchingDisable_R;                                // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SwitchingDisable_L;                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Switching_R;                                       // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Switching_L;                                       // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIcon_ATBCost_C*                        Icon_ATBCost;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_ATBCost_C*                        Icon_ATBCost_L;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_ATBCost_C*                        Icon_ATBCost_R;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_00;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_01L;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_01R;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_02;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Arrow_Main;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Add;                                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Player;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Player_L;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Player_R;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_00;                                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_ShortCut_List_00_C">();
	}
	static class UCommand_ShortCut_List_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_ShortCut_List_00_C>();
	}
};
static_assert(alignof(UCommand_ShortCut_List_00_C) == 0x000008, "Wrong alignment on UCommand_ShortCut_List_00_C");
static_assert(sizeof(UCommand_ShortCut_List_00_C) == 0x000470, "Wrong size on UCommand_ShortCut_List_00_C");
static_assert(offsetof(UCommand_ShortCut_List_00_C, SwitchingDisable_R) == 0x0003C8, "Member 'UCommand_ShortCut_List_00_C::SwitchingDisable_R' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, SwitchingDisable_L) == 0x0003D0, "Member 'UCommand_ShortCut_List_00_C::SwitchingDisable_L' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Switching_R) == 0x0003D8, "Member 'UCommand_ShortCut_List_00_C::Switching_R' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Switching_L) == 0x0003E0, "Member 'UCommand_ShortCut_List_00_C::Switching_L' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Out) == 0x0003E8, "Member 'UCommand_ShortCut_List_00_C::Out' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, In) == 0x0003F0, "Member 'UCommand_ShortCut_List_00_C::In' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Icon_ATBCost) == 0x0003F8, "Member 'UCommand_ShortCut_List_00_C::Icon_ATBCost' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Icon_ATBCost_L) == 0x000400, "Member 'UCommand_ShortCut_List_00_C::Icon_ATBCost_L' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Icon_ATBCost_R) == 0x000408, "Member 'UCommand_ShortCut_List_00_C::Icon_ATBCost_R' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_00) == 0x000410, "Member 'UCommand_ShortCut_List_00_C::Img_00' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_01L) == 0x000418, "Member 'UCommand_ShortCut_List_00_C::Img_01L' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_01R) == 0x000420, "Member 'UCommand_ShortCut_List_00_C::Img_01R' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_02) == 0x000428, "Member 'UCommand_ShortCut_List_00_C::Img_02' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_Arrow_Main) == 0x000430, "Member 'UCommand_ShortCut_List_00_C::Img_Arrow_Main' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_Base) == 0x000438, "Member 'UCommand_ShortCut_List_00_C::Img_Base' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_Base_Add) == 0x000440, "Member 'UCommand_ShortCut_List_00_C::Img_Base_Add' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_Effect_00) == 0x000448, "Member 'UCommand_ShortCut_List_00_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_Player) == 0x000450, "Member 'UCommand_ShortCut_List_00_C::Img_Player' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_Player_L) == 0x000458, "Member 'UCommand_ShortCut_List_00_C::Img_Player_L' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_Player_R) == 0x000460, "Member 'UCommand_ShortCut_List_00_C::Img_Player_R' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Line_00) == 0x000468, "Member 'UCommand_ShortCut_List_00_C::Line_00' has a wrong offset!");

}

