#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_Default

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_Default.Command_Default_C
// 0x0050 (0x05D8 - 0x0588)
class UCommand_Default_C final : public UEndUniqueActionPane
{
public:
	class UWidgetAnimation*                       ActionCommand_Shift;                               // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShortCut_Shift;                                    // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Switching;                                         // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommand_Default_Cell_00_C*             Command_Default_Cell_00;                           // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommand_Default_Cell_00_C*             Command_Default_Cell_01;                           // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommand_Default_Cell_00_C*             Command_Default_Cell_02;                           // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommand_Default_Cell_00_C*             Command_Default_Cell_03;                           // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_ATBCost_C*                        Icon_ATBCost;                                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_Default_C">();
	}
	static class UCommand_Default_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_Default_C>();
	}
};
static_assert(alignof(UCommand_Default_C) == 0x000008, "Wrong alignment on UCommand_Default_C");
static_assert(sizeof(UCommand_Default_C) == 0x0005D8, "Wrong size on UCommand_Default_C");
static_assert(offsetof(UCommand_Default_C, ActionCommand_Shift) == 0x000588, "Member 'UCommand_Default_C::ActionCommand_Shift' has a wrong offset!");
static_assert(offsetof(UCommand_Default_C, ShortCut_Shift) == 0x000590, "Member 'UCommand_Default_C::ShortCut_Shift' has a wrong offset!");
static_assert(offsetof(UCommand_Default_C, Out) == 0x000598, "Member 'UCommand_Default_C::Out' has a wrong offset!");
static_assert(offsetof(UCommand_Default_C, Switching) == 0x0005A0, "Member 'UCommand_Default_C::Switching' has a wrong offset!");
static_assert(offsetof(UCommand_Default_C, In) == 0x0005A8, "Member 'UCommand_Default_C::In' has a wrong offset!");
static_assert(offsetof(UCommand_Default_C, Command_Default_Cell_00) == 0x0005B0, "Member 'UCommand_Default_C::Command_Default_Cell_00' has a wrong offset!");
static_assert(offsetof(UCommand_Default_C, Command_Default_Cell_01) == 0x0005B8, "Member 'UCommand_Default_C::Command_Default_Cell_01' has a wrong offset!");
static_assert(offsetof(UCommand_Default_C, Command_Default_Cell_02) == 0x0005C0, "Member 'UCommand_Default_C::Command_Default_Cell_02' has a wrong offset!");
static_assert(offsetof(UCommand_Default_C, Command_Default_Cell_03) == 0x0005C8, "Member 'UCommand_Default_C::Command_Default_Cell_03' has a wrong offset!");
static_assert(offsetof(UCommand_Default_C, Icon_ATBCost) == 0x0005D0, "Member 'UCommand_Default_C::Icon_ATBCost' has a wrong offset!");

}

