#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_ShortCut_Cell_00

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_ShortCut_Cell_00.Command_ShortCut_Cell_00_C
// 0x00F0 (0x04E8 - 0x03F8)
class UCommand_ShortCut_Cell_00_C final : public UEndCmdShortcutCell
{
public:
	class UWidgetAnimation*                       Dark_On;                                           // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Dark_Off;                                          // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Disabled;                                          // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Running;                                           // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Shift;                                             // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pressed;                                           // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndButton*                             Btn;                                               // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommand_Effect_00_C*                   Command_Effect_00;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CoopBase_01;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CoopCost_00;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CoopCost_01;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        CoopGauge_00;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        CoopGauge_01;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           CoopGaugeCover_00;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           CoopGaugeCover_01;                                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_00;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_Ability_00;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_ATBCost_C*                        Icon_ATBCost;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Chain;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Bar_ShortCut_01;                               // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnBase_On;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Effect_00;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Player_00;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Player_01;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_GaugeCharge;                                   // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_GaugeCover;                                    // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULimitLevel_C*                          LimitLevel;                                        // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Number;                                        // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Symbol;                                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_ShortCut_Cell_00_C">();
	}
	static class UCommand_ShortCut_Cell_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_ShortCut_Cell_00_C>();
	}
};
static_assert(alignof(UCommand_ShortCut_Cell_00_C) == 0x000008, "Wrong alignment on UCommand_ShortCut_Cell_00_C");
static_assert(sizeof(UCommand_ShortCut_Cell_00_C) == 0x0004E8, "Wrong size on UCommand_ShortCut_Cell_00_C");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Dark_On) == 0x0003F8, "Member 'UCommand_ShortCut_Cell_00_C::Dark_On' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Dark_Off) == 0x000400, "Member 'UCommand_ShortCut_Cell_00_C::Dark_Off' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Disabled) == 0x000408, "Member 'UCommand_ShortCut_Cell_00_C::Disabled' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Running) == 0x000410, "Member 'UCommand_ShortCut_Cell_00_C::Running' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Shift) == 0x000418, "Member 'UCommand_ShortCut_Cell_00_C::Shift' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Pressed) == 0x000420, "Member 'UCommand_ShortCut_Cell_00_C::Pressed' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Btn) == 0x000428, "Member 'UCommand_ShortCut_Cell_00_C::Btn' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Command_Effect_00) == 0x000430, "Member 'UCommand_ShortCut_Cell_00_C::Command_Effect_00' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, CoopBase_01) == 0x000438, "Member 'UCommand_ShortCut_Cell_00_C::CoopBase_01' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, CoopCost_00) == 0x000440, "Member 'UCommand_ShortCut_Cell_00_C::CoopCost_00' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, CoopCost_01) == 0x000448, "Member 'UCommand_ShortCut_Cell_00_C::CoopCost_01' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, CoopGauge_00) == 0x000450, "Member 'UCommand_ShortCut_Cell_00_C::CoopGauge_00' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, CoopGauge_01) == 0x000458, "Member 'UCommand_ShortCut_Cell_00_C::CoopGauge_01' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, CoopGaugeCover_00) == 0x000460, "Member 'UCommand_ShortCut_Cell_00_C::CoopGaugeCover_00' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, CoopGaugeCover_01) == 0x000468, "Member 'UCommand_ShortCut_Cell_00_C::CoopGaugeCover_01' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Gauge_00) == 0x000470, "Member 'UCommand_ShortCut_Cell_00_C::Gauge_00' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Gauge_Ability_00) == 0x000478, "Member 'UCommand_ShortCut_Cell_00_C::Gauge_Ability_00' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Icon_ATBCost) == 0x000480, "Member 'UCommand_ShortCut_Cell_00_C::Icon_ATBCost' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Icon_Chain) == 0x000488, "Member 'UCommand_ShortCut_Cell_00_C::Icon_Chain' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Icon_Status) == 0x000490, "Member 'UCommand_ShortCut_Cell_00_C::Icon_Status' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Img_Bar_ShortCut_01) == 0x000498, "Member 'UCommand_ShortCut_Cell_00_C::Img_Bar_ShortCut_01' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Img_BtnBase_On) == 0x0004A0, "Member 'UCommand_ShortCut_Cell_00_C::Img_BtnBase_On' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Img_Effect_00) == 0x0004A8, "Member 'UCommand_ShortCut_Cell_00_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Img_Player_00) == 0x0004B0, "Member 'UCommand_ShortCut_Cell_00_C::Img_Player_00' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Img_Player_01) == 0x0004B8, "Member 'UCommand_ShortCut_Cell_00_C::Img_Player_01' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Ims_GaugeCharge) == 0x0004C0, "Member 'UCommand_ShortCut_Cell_00_C::Ims_GaugeCharge' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Ims_GaugeCover) == 0x0004C8, "Member 'UCommand_ShortCut_Cell_00_C::Ims_GaugeCover' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, LimitLevel) == 0x0004D0, "Member 'UCommand_ShortCut_Cell_00_C::LimitLevel' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Txt_Number) == 0x0004D8, "Member 'UCommand_ShortCut_Cell_00_C::Txt_Number' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_Cell_00_C, Txt_Symbol) == 0x0004E0, "Member 'UCommand_ShortCut_Cell_00_C::Txt_Symbol' has a wrong offset!");

}

