#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_Base

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_Base.Command_Base_C
// 0x0090 (0x0458 - 0x03C8)
class UCommand_Base_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       ReserveEffect_Out;                                 // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ReserveEffect_In;                                  // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShortCut_Reset;                                    // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShortCut_Shift;                                    // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Field_Open;                                        // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Battle_In;                                         // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Effect_Gradation;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Summon;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Deco;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Help;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Help_1;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_TxtBase;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light_00;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light_01;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommand_ReserveEffect_C*               ReserveEffect;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommand_ReserveTxt_C*                  ReserveTxt;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_Base_C">();
	}
	static class UCommand_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_Base_C>();
	}
};
static_assert(alignof(UCommand_Base_C) == 0x000008, "Wrong alignment on UCommand_Base_C");
static_assert(sizeof(UCommand_Base_C) == 0x000458, "Wrong size on UCommand_Base_C");
static_assert(offsetof(UCommand_Base_C, ReserveEffect_Out) == 0x0003C8, "Member 'UCommand_Base_C::ReserveEffect_Out' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, ReserveEffect_In) == 0x0003D0, "Member 'UCommand_Base_C::ReserveEffect_In' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, ShortCut_Reset) == 0x0003D8, "Member 'UCommand_Base_C::ShortCut_Reset' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, ShortCut_Shift) == 0x0003E0, "Member 'UCommand_Base_C::ShortCut_Shift' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, FadeOut) == 0x0003E8, "Member 'UCommand_Base_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, Field_Open) == 0x0003F0, "Member 'UCommand_Base_C::Field_Open' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, Battle_In) == 0x0003F8, "Member 'UCommand_Base_C::Battle_In' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, Effect_Gradation) == 0x000400, "Member 'UCommand_Base_C::Effect_Gradation' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, Icon_Summon) == 0x000408, "Member 'UCommand_Base_C::Icon_Summon' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, Img_Deco) == 0x000410, "Member 'UCommand_Base_C::Img_Deco' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, Img_Help) == 0x000418, "Member 'UCommand_Base_C::Img_Help' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, Img_Help_1) == 0x000420, "Member 'UCommand_Base_C::Img_Help_1' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, Img_Line) == 0x000428, "Member 'UCommand_Base_C::Img_Line' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, Img_TxtBase) == 0x000430, "Member 'UCommand_Base_C::Img_TxtBase' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, Light_00) == 0x000438, "Member 'UCommand_Base_C::Light_00' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, Light_01) == 0x000440, "Member 'UCommand_Base_C::Light_01' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, ReserveEffect) == 0x000448, "Member 'UCommand_Base_C::ReserveEffect' has a wrong offset!");
static_assert(offsetof(UCommand_Base_C, ReserveTxt) == 0x000450, "Member 'UCommand_Base_C::ReserveTxt' has a wrong offset!");

}

