#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommandLinkage

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommandLinkage.CommandLinkage_C
// 0x0098 (0x04B8 - 0x0420)
class UCommandLinkage_C final : public UEndBattleLinkageIcon
{
public:
	class UWidgetAnimation*                       Linkage_Out;                                       // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Linkage_Hit;                                       // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Linkage_Loop;                                      // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Linkage_In;                                        // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Arrow_00;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_01;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_Shadow;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndNumberLabel*                        EndNumberLabel_0;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Horz_Linkage_Magni;                                // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_BurstExtend_C*                    Icon_BurstExtend;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Light_01;                               // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_00;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_01;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_EffectBG_00;                                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_EffectBG_01;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             Nut_Linkage_Magni;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Magni;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Percent;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Symbol;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CommandLinkage_C">();
	}
	static class UCommandLinkage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommandLinkage_C>();
	}
};
static_assert(alignof(UCommandLinkage_C) == 0x000008, "Wrong alignment on UCommandLinkage_C");
static_assert(sizeof(UCommandLinkage_C) == 0x0004B8, "Wrong size on UCommandLinkage_C");
static_assert(offsetof(UCommandLinkage_C, Linkage_Out) == 0x000420, "Member 'UCommandLinkage_C::Linkage_Out' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Linkage_Hit) == 0x000428, "Member 'UCommandLinkage_C::Linkage_Hit' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Linkage_Loop) == 0x000430, "Member 'UCommandLinkage_C::Linkage_Loop' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Linkage_In) == 0x000438, "Member 'UCommandLinkage_C::Linkage_In' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Arrow_00) == 0x000440, "Member 'UCommandLinkage_C::Arrow_00' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Arrow_01) == 0x000448, "Member 'UCommandLinkage_C::Arrow_01' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Arrow_Shadow) == 0x000450, "Member 'UCommandLinkage_C::Arrow_Shadow' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, EndNumberLabel_0) == 0x000458, "Member 'UCommandLinkage_C::EndNumberLabel_0' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Horz_Linkage_Magni) == 0x000460, "Member 'UCommandLinkage_C::Horz_Linkage_Magni' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Icon_BurstExtend) == 0x000468, "Member 'UCommandLinkage_C::Icon_BurstExtend' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Img_Effect_Light_01) == 0x000470, "Member 'UCommandLinkage_C::Img_Effect_Light_01' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Img_Effect_Particle_00) == 0x000478, "Member 'UCommandLinkage_C::Img_Effect_Particle_00' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Img_Effect_Particle_01) == 0x000480, "Member 'UCommandLinkage_C::Img_Effect_Particle_01' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Img_EffectBG_00) == 0x000488, "Member 'UCommandLinkage_C::Img_EffectBG_00' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Img_EffectBG_01) == 0x000490, "Member 'UCommandLinkage_C::Img_EffectBG_01' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Nut_Linkage_Magni) == 0x000498, "Member 'UCommandLinkage_C::Nut_Linkage_Magni' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Txt_Magni) == 0x0004A0, "Member 'UCommandLinkage_C::Txt_Magni' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Txt_Percent) == 0x0004A8, "Member 'UCommandLinkage_C::Txt_Percent' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Txt_Symbol) == 0x0004B0, "Member 'UCommandLinkage_C::Txt_Symbol' has a wrong offset!");

}

