#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_Help2

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_Help2.Command_Help2_C
// 0x0038 (0x04A8 - 0x0470)
class UCommand_Help2_C final : public UEndBattleCommandHelpMenu
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_Filter;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Line_Left;                                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Line_Left_2;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Line_Right;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Line_Right_2;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_Help2_C">();
	}
	static class UCommand_Help2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_Help2_C>();
	}
};
static_assert(alignof(UCommand_Help2_C) == 0x000008, "Wrong alignment on UCommand_Help2_C");
static_assert(sizeof(UCommand_Help2_C) == 0x0004A8, "Wrong size on UCommand_Help2_C");
static_assert(offsetof(UCommand_Help2_C, Out) == 0x000470, "Member 'UCommand_Help2_C::Out' has a wrong offset!");
static_assert(offsetof(UCommand_Help2_C, In) == 0x000478, "Member 'UCommand_Help2_C::In' has a wrong offset!");
static_assert(offsetof(UCommand_Help2_C, Img_Filter) == 0x000480, "Member 'UCommand_Help2_C::Img_Filter' has a wrong offset!");
static_assert(offsetof(UCommand_Help2_C, Line_Left) == 0x000488, "Member 'UCommand_Help2_C::Line_Left' has a wrong offset!");
static_assert(offsetof(UCommand_Help2_C, Line_Left_2) == 0x000490, "Member 'UCommand_Help2_C::Line_Left_2' has a wrong offset!");
static_assert(offsetof(UCommand_Help2_C, Line_Right) == 0x000498, "Member 'UCommand_Help2_C::Line_Right' has a wrong offset!");
static_assert(offsetof(UCommand_Help2_C, Line_Right_2) == 0x0004A0, "Member 'UCommand_Help2_C::Line_Right_2' has a wrong offset!");

}

