#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_LinkUp_Cell_00

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_LinkUp_Cell_00.Command_LinkUp_Cell_00_C
// 0x00C0 (0x04B8 - 0x03F8)
class UCommand_LinkUp_Cell_00_C final : public UEndCmdShortcutCell
{
public:
	class UWidgetAnimation*                       CoopDefault;                                       // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CoopGrey_R;                                        // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CoopGrey_L;                                        // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GaugeAdd;                                          // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GaugeReduce;                                       // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GaugeMax;                                          // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Disabled;                                          // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Running;                                           // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Shift;                                             // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pressed;                                           // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_Btn;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn;                                               // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CoopBase_00;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CoopBase_01;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco_Left;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_01;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_00;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Chain;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Bar_ShortCut_01;                               // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnBase_GaugeMax;                              // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnBase_On;                                    // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Effect_00;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Player_00;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Player_01;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_LinkUp_Cell_00_C">();
	}
	static class UCommand_LinkUp_Cell_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_LinkUp_Cell_00_C>();
	}
};
static_assert(alignof(UCommand_LinkUp_Cell_00_C) == 0x000008, "Wrong alignment on UCommand_LinkUp_Cell_00_C");
static_assert(sizeof(UCommand_LinkUp_Cell_00_C) == 0x0004B8, "Wrong size on UCommand_LinkUp_Cell_00_C");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, CoopDefault) == 0x0003F8, "Member 'UCommand_LinkUp_Cell_00_C::CoopDefault' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, CoopGrey_R) == 0x000400, "Member 'UCommand_LinkUp_Cell_00_C::CoopGrey_R' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, CoopGrey_L) == 0x000408, "Member 'UCommand_LinkUp_Cell_00_C::CoopGrey_L' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, GaugeAdd) == 0x000410, "Member 'UCommand_LinkUp_Cell_00_C::GaugeAdd' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, GaugeReduce) == 0x000418, "Member 'UCommand_LinkUp_Cell_00_C::GaugeReduce' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, GaugeMax) == 0x000420, "Member 'UCommand_LinkUp_Cell_00_C::GaugeMax' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Disabled) == 0x000428, "Member 'UCommand_LinkUp_Cell_00_C::Disabled' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Running) == 0x000430, "Member 'UCommand_LinkUp_Cell_00_C::Running' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Shift) == 0x000438, "Member 'UCommand_LinkUp_Cell_00_C::Shift' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Pressed) == 0x000440, "Member 'UCommand_LinkUp_Cell_00_C::Pressed' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Base_Btn) == 0x000448, "Member 'UCommand_LinkUp_Cell_00_C::Base_Btn' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Btn) == 0x000450, "Member 'UCommand_LinkUp_Cell_00_C::Btn' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, CoopBase_00) == 0x000458, "Member 'UCommand_LinkUp_Cell_00_C::CoopBase_00' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, CoopBase_01) == 0x000460, "Member 'UCommand_LinkUp_Cell_00_C::CoopBase_01' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Deco_Left) == 0x000468, "Member 'UCommand_LinkUp_Cell_00_C::Deco_Left' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Effect_01) == 0x000470, "Member 'UCommand_LinkUp_Cell_00_C::Effect_01' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Gauge_00) == 0x000478, "Member 'UCommand_LinkUp_Cell_00_C::Gauge_00' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Icon_Chain) == 0x000480, "Member 'UCommand_LinkUp_Cell_00_C::Icon_Chain' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Img_Bar_ShortCut_01) == 0x000488, "Member 'UCommand_LinkUp_Cell_00_C::Img_Bar_ShortCut_01' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Img_BtnBase_GaugeMax) == 0x000490, "Member 'UCommand_LinkUp_Cell_00_C::Img_BtnBase_GaugeMax' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Img_BtnBase_On) == 0x000498, "Member 'UCommand_LinkUp_Cell_00_C::Img_BtnBase_On' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Img_Effect_00) == 0x0004A0, "Member 'UCommand_LinkUp_Cell_00_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Img_Player_00) == 0x0004A8, "Member 'UCommand_LinkUp_Cell_00_C::Img_Player_00' has a wrong offset!");
static_assert(offsetof(UCommand_LinkUp_Cell_00_C, Img_Player_01) == 0x0004B0, "Member 'UCommand_LinkUp_Cell_00_C::Img_Player_01' has a wrong offset!");

}

