#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_Help

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_Help.Command_Help_C
// 0x0030 (0x03F8 - 0x03C8)
class UCommand_Help_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_Nut;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBasicGuide_Cell_C*                     BasicGuide_Cell;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Help;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Help;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_Help_C">();
	}
	static class UCommand_Help_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_Help_C>();
	}
};
static_assert(alignof(UCommand_Help_C) == 0x000008, "Wrong alignment on UCommand_Help_C");
static_assert(sizeof(UCommand_Help_C) == 0x0003F8, "Wrong size on UCommand_Help_C");
static_assert(offsetof(UCommand_Help_C, Out) == 0x0003C8, "Member 'UCommand_Help_C::Out' has a wrong offset!");
static_assert(offsetof(UCommand_Help_C, In) == 0x0003D0, "Member 'UCommand_Help_C::In' has a wrong offset!");
static_assert(offsetof(UCommand_Help_C, All_Nut) == 0x0003D8, "Member 'UCommand_Help_C::All_Nut' has a wrong offset!");
static_assert(offsetof(UCommand_Help_C, BasicGuide_Cell) == 0x0003E0, "Member 'UCommand_Help_C::BasicGuide_Cell' has a wrong offset!");
static_assert(offsetof(UCommand_Help_C, Img_Help) == 0x0003E8, "Member 'UCommand_Help_C::Img_Help' has a wrong offset!");
static_assert(offsetof(UCommand_Help_C, Txt_Help) == 0x0003F0, "Member 'UCommand_Help_C::Txt_Help' has a wrong offset!");

}

