#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMON_SingleKeibihei02

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function COMON_SingleKeibihei02.COMON_SingleKeibihei02_C.ExecuteUbergraph_COMON_SingleKeibihei02
// 0x0068 (0x0068 - 0x0000)
struct COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem; // 0x0004(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1; // 0x0014(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2; // 0x0024(0x0010)(NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEndMobPrefabRandomAnimationExecuteItem> K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddContactConditionCommand_ReturnValue;   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactAnimationExecuteCommand_ReturnValue; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddPartyPositionConditionCommand_ReturnValue; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddEmptyConditionCommand_ReturnValue;     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtStartExecuteCommand_ReturnValue; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddTimerConditionCommand_ReturnValue;     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtEndExecuteCommand_ReturnValue;   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddRandomAnimationExecuteCommand_ReturnValue; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02) == 0x000008, "Wrong alignment on COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02");
static_assert(sizeof(COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02) == 0x000068, "Wrong size on COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02");
static_assert(offsetof(COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02, EntryPoint) == 0x000000, "Member 'COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem) == 0x000004, "Member 'COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem' has a wrong offset!");
static_assert(offsetof(COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1) == 0x000014, "Member 'COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1' has a wrong offset!");
static_assert(offsetof(COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2) == 0x000024, "Member 'COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2' has a wrong offset!");
static_assert(offsetof(COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02, K2Node_MakeArray_Array) == 0x000038, "Member 'COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02, CallFunc_AddContactConditionCommand_ReturnValue) == 0x000048, "Member 'COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02::CallFunc_AddContactConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02, CallFunc_AddContactAnimationExecuteCommand_ReturnValue) == 0x00004C, "Member 'COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02::CallFunc_AddContactAnimationExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02, CallFunc_AddPartyPositionConditionCommand_ReturnValue) == 0x000050, "Member 'COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02::CallFunc_AddPartyPositionConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02, CallFunc_AddEmptyConditionCommand_ReturnValue) == 0x000054, "Member 'COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02::CallFunc_AddEmptyConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02, CallFunc_AddLookAtStartExecuteCommand_ReturnValue) == 0x000058, "Member 'COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02::CallFunc_AddLookAtStartExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02, CallFunc_AddTimerConditionCommand_ReturnValue) == 0x00005C, "Member 'COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02::CallFunc_AddTimerConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02, CallFunc_AddLookAtEndExecuteCommand_ReturnValue) == 0x000060, "Member 'COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02::CallFunc_AddLookAtEndExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02, CallFunc_AddRandomAnimationExecuteCommand_ReturnValue) == 0x000064, "Member 'COMON_SingleKeibihei02_C_ExecuteUbergraph_COMON_SingleKeibihei02::CallFunc_AddRandomAnimationExecuteCommand_ReturnValue' has a wrong offset!");

}

