#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMON_SingleThink1_02

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function COMON_SingleThink1_02.COMON_SingleThink1_02_C.ExecuteUbergraph_COMON_SingleThink1_02
// 0x00F0 (0x00F0 - 0x0000)
struct COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem; // 0x0004(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1; // 0x0014(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2; // 0x0024(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3; // 0x0034(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_4; // 0x0044(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_5; // 0x0054(0x0010)(NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEndMobPrefabRandomAnimationExecuteItem> K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_6; // 0x0078(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_7; // 0x0088(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_8; // 0x0098(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_9; // 0x00A8(0x0010)(NoDestructor)
	TArray<struct FEndMobPrefabRandomAnimationExecuteItem> K2Node_MakeArray_Array_1;                          // 0x00B8(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddTimerConditionCommand_ReturnValue;     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactConditionCommand_ReturnValue;   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtEndExecuteCommand_ReturnValue;   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactAnimationExecuteCommand_ReturnValue; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddRandomAnimationExecuteCommand_ReturnValue; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddPartyPositionConditionCommand_ReturnValue; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddTimerConditionCommand_ReturnValue_1;   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_1; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtStartExecuteCommand_ReturnValue; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02) == 0x000008, "Wrong alignment on COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02");
static_assert(sizeof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02) == 0x0000F0, "Wrong size on COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, EntryPoint) == 0x000000, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem) == 0x000004, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1) == 0x000014, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2) == 0x000024, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3) == 0x000034, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_4) == 0x000044, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_4' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_5) == 0x000054, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_5' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, K2Node_MakeArray_Array) == 0x000068, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_6) == 0x000078, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_6' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_7) == 0x000088, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_7' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_8) == 0x000098, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_8' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_9) == 0x0000A8, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_9' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, K2Node_MakeArray_Array_1) == 0x0000B8, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, CallFunc_AddTimerConditionCommand_ReturnValue) == 0x0000C8, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::CallFunc_AddTimerConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, CallFunc_AddContactConditionCommand_ReturnValue) == 0x0000CC, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::CallFunc_AddContactConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, CallFunc_AddLookAtEndExecuteCommand_ReturnValue) == 0x0000D0, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::CallFunc_AddLookAtEndExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, CallFunc_AddContactAnimationExecuteCommand_ReturnValue) == 0x0000D4, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::CallFunc_AddContactAnimationExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, CallFunc_AddRandomAnimationExecuteCommand_ReturnValue) == 0x0000D8, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::CallFunc_AddRandomAnimationExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, CallFunc_AddPartyPositionConditionCommand_ReturnValue) == 0x0000DC, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::CallFunc_AddPartyPositionConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, CallFunc_AddTimerConditionCommand_ReturnValue_1) == 0x0000E0, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::CallFunc_AddTimerConditionCommand_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_1) == 0x0000E4, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02, CallFunc_AddLookAtStartExecuteCommand_ReturnValue) == 0x0000E8, "Member 'COMON_SingleThink1_02_C_ExecuteUbergraph_COMON_SingleThink1_02::CallFunc_AddLookAtStartExecuteCommand_ReturnValue' has a wrong offset!");

}

