#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMON_SingleChair1_04

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function COMON_SingleChair1_04.COMON_SingleChair1_04_C.ExecuteUbergraph_COMON_SingleChair1_04
// 0x01B8 (0x01B8 - 0x0000)
struct COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddPartyPositionConditionCommand_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem; // 0x0008(0x0010)(NoDestructor)
	int32                                         CallFunc_AddAnimationWithLookAtExecuteCommand_ReturnValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1; // 0x001C(0x0010)(NoDestructor)
	int32                                         CallFunc_AddLookAtStartExecuteCommand_ReturnValue; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2; // 0x0030(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3; // 0x0040(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_4; // 0x0050(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_5; // 0x0060(0x0010)(NoDestructor)
	TArray<struct FEndMobPrefabRandomAnimationExecuteItem> K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_6; // 0x0080(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_7; // 0x0090(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_8; // 0x00A0(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_9; // 0x00B0(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_10; // 0x00C0(0x0010)(NoDestructor)
	TArray<struct FEndMobPrefabRandomAnimationExecuteItem> K2Node_MakeArray_Array_1;                          // 0x00D0(0x0010)(ReferenceParm)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_11; // 0x00E0(0x0010)(NoDestructor)
	int32                                         CallFunc_AddRandomAnimationExecuteCommand_ReturnValue; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_12; // 0x00F4(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_13; // 0x0104(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_14; // 0x0114(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_15; // 0x0124(0x0010)(NoDestructor)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEndMobPrefabRandomAnimationExecuteItem> K2Node_MakeArray_Array_2;                          // 0x0138(0x0010)(ReferenceParm)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_16; // 0x0148(0x0010)(NoDestructor)
	int32                                         CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_1; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_17; // 0x015C(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_18; // 0x016C(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_19; // 0x017C(0x0010)(NoDestructor)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEndMobPrefabRandomAnimationExecuteItem> K2Node_MakeArray_Array_3;                          // 0x0190(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_2; // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddTimerConditionCommand_ReturnValue;     // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtEndExecuteCommand_ReturnValue;   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddAnimationExecuteCommand_ReturnValue;   // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_3; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04) == 0x000008, "Wrong alignment on COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04");
static_assert(sizeof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04) == 0x0001B8, "Wrong size on COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, EntryPoint) == 0x000000, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, CallFunc_AddPartyPositionConditionCommand_ReturnValue) == 0x000004, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::CallFunc_AddPartyPositionConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem) == 0x000008, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, CallFunc_AddAnimationWithLookAtExecuteCommand_ReturnValue) == 0x000018, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::CallFunc_AddAnimationWithLookAtExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1) == 0x00001C, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, CallFunc_AddLookAtStartExecuteCommand_ReturnValue) == 0x00002C, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::CallFunc_AddLookAtStartExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2) == 0x000030, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3) == 0x000040, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_4) == 0x000050, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_4' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_5) == 0x000060, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_5' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeArray_Array) == 0x000070, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_6) == 0x000080, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_6' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_7) == 0x000090, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_7' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_8) == 0x0000A0, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_8' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_9) == 0x0000B0, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_9' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_10) == 0x0000C0, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_10' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeArray_Array_1) == 0x0000D0, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_11) == 0x0000E0, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_11' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, CallFunc_AddRandomAnimationExecuteCommand_ReturnValue) == 0x0000F0, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::CallFunc_AddRandomAnimationExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_12) == 0x0000F4, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_12' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_13) == 0x000104, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_13' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_14) == 0x000114, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_14' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_15) == 0x000124, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_15' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeArray_Array_2) == 0x000138, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_16) == 0x000148, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_16' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_1) == 0x000158, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_17) == 0x00015C, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_17' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_18) == 0x00016C, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_18' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_19) == 0x00017C, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_19' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, K2Node_MakeArray_Array_3) == 0x000190, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_2) == 0x0001A0, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, CallFunc_AddTimerConditionCommand_ReturnValue) == 0x0001A4, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::CallFunc_AddTimerConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, CallFunc_AddLookAtEndExecuteCommand_ReturnValue) == 0x0001A8, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::CallFunc_AddLookAtEndExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, CallFunc_AddAnimationExecuteCommand_ReturnValue) == 0x0001AC, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::CallFunc_AddAnimationExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04, CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_3) == 0x0001B0, "Member 'COMON_SingleChair1_04_C_ExecuteUbergraph_COMON_SingleChair1_04::CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_3' has a wrong offset!");

}

