#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMON_SingleChairReadBook1_01_45Chair01

#include "Basic.hpp"


namespace SDK::Params
{

// Function COMON_SingleChairReadBook1_01_45Chair01.COMON_SingleChairReadBook1_01_45Chair01_C.ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01
// 0x0018 (0x0018 - 0x0000)
struct COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddEmptyConditionCommand_ReturnValue;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtEndExecuteCommand_ReturnValue;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddPartyPositionConditionCommand_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtStartExecuteCommand_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddAnimationExecuteCommand_ReturnValue;   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01) == 0x000004, "Wrong alignment on COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01");
static_assert(sizeof(COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01) == 0x000018, "Wrong size on COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01");
static_assert(offsetof(COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01, EntryPoint) == 0x000000, "Member 'COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01, CallFunc_AddEmptyConditionCommand_ReturnValue) == 0x000004, "Member 'COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01::CallFunc_AddEmptyConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01, CallFunc_AddLookAtEndExecuteCommand_ReturnValue) == 0x000008, "Member 'COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01::CallFunc_AddLookAtEndExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01, CallFunc_AddPartyPositionConditionCommand_ReturnValue) == 0x00000C, "Member 'COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01::CallFunc_AddPartyPositionConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01, CallFunc_AddLookAtStartExecuteCommand_ReturnValue) == 0x000010, "Member 'COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01::CallFunc_AddLookAtStartExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01, CallFunc_AddAnimationExecuteCommand_ReturnValue) == 0x000014, "Member 'COMON_SingleChairReadBook1_01_45Chair01_C_ExecuteUbergraph_COMON_SingleChairReadBook1_01_45Chair01::CallFunc_AddAnimationExecuteCommand_ReturnValue' has a wrong offset!");

}

