#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMON_SingleThink1_05

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function COMON_SingleThink1_05.COMON_SingleThink1_05_C.ExecuteUbergraph_COMON_SingleThink1_05
// 0x0078 (0x0078 - 0x0000)
struct COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem; // 0x0004(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1; // 0x0014(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2; // 0x0024(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3; // 0x0034(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_4; // 0x0044(0x0010)(NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEndMobPrefabRandomAnimationExecuteItem> K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddTimerConditionCommand_ReturnValue;     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactConditionCommand_ReturnValue;   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddRandomAnimationExecuteCommand_ReturnValue; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactAnimationExecuteCommand_ReturnValue; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05) == 0x000008, "Wrong alignment on COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05");
static_assert(sizeof(COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05) == 0x000078, "Wrong size on COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05");
static_assert(offsetof(COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05, EntryPoint) == 0x000000, "Member 'COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem) == 0x000004, "Member 'COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1) == 0x000014, "Member 'COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2) == 0x000024, "Member 'COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3) == 0x000034, "Member 'COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_4) == 0x000044, "Member 'COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_4' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05, K2Node_MakeArray_Array) == 0x000058, "Member 'COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05, CallFunc_AddTimerConditionCommand_ReturnValue) == 0x000068, "Member 'COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05::CallFunc_AddTimerConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05, CallFunc_AddContactConditionCommand_ReturnValue) == 0x00006C, "Member 'COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05::CallFunc_AddContactConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05, CallFunc_AddRandomAnimationExecuteCommand_ReturnValue) == 0x000070, "Member 'COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05::CallFunc_AddRandomAnimationExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05, CallFunc_AddContactAnimationExecuteCommand_ReturnValue) == 0x000074, "Member 'COMON_SingleThink1_05_C_ExecuteUbergraph_COMON_SingleThink1_05::CallFunc_AddContactAnimationExecuteCommand_ReturnValue' has a wrong offset!");

}

