#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMON_Double_Move_HorizontalTalk1_01

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function COMON_Double_Move_HorizontalTalk1_01.COMON_Double_Move_HorizontalTalk1_01_C.ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01
// 0x00D8 (0x00D8 - 0x0000)
struct COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddTimerConditionCommand_ReturnValue;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem; // 0x0008(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1; // 0x0018(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2; // 0x0028(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3; // 0x0038(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_4; // 0x0048(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_5; // 0x0058(0x0010)(NoDestructor)
	TArray<struct FEndMobPrefabRandomAnimationExecuteItem> K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_6; // 0x0078(0x0010)(NoDestructor, UObjectWrapper)
	int32                                         CallFunc_AddRandomAnimationExecuteCommand_ReturnValue; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_7; // 0x008C(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_8; // 0x009C(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_9; // 0x00AC(0x0010)(NoDestructor)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEndMobPrefabRandomAnimationExecuteItem> K2Node_MakeArray_Array_1;                          // 0x00C0(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_1; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01) == 0x000008, "Wrong alignment on COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01");
static_assert(sizeof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01) == 0x0000D8, "Wrong size on COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, EntryPoint) == 0x000000, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, CallFunc_AddTimerConditionCommand_ReturnValue) == 0x000004, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::CallFunc_AddTimerConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem) == 0x000008, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem' has a wrong offset!");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1) == 0x000018, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1' has a wrong offset!");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2) == 0x000028, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2' has a wrong offset!");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3) == 0x000038, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3' has a wrong offset!");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_4) == 0x000048, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_4' has a wrong offset!");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_5) == 0x000058, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_5' has a wrong offset!");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, K2Node_MakeArray_Array) == 0x000068, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_6) == 0x000078, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_6' has a wrong offset!");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, CallFunc_AddRandomAnimationExecuteCommand_ReturnValue) == 0x000088, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::CallFunc_AddRandomAnimationExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_7) == 0x00008C, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_7' has a wrong offset!");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_8) == 0x00009C, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_8' has a wrong offset!");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_9) == 0x0000AC, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_9' has a wrong offset!");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, K2Node_MakeArray_Array_1) == 0x0000C0, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01, CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_1) == 0x0000D0, "Member 'COMON_Double_Move_HorizontalTalk1_01_C_ExecuteUbergraph_COMON_Double_Move_HorizontalTalk1_01::CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_1' has a wrong offset!");

}

