#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Compass

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Compass.Compass_C
// 0x0018 (0x03F0 - 0x03D8)
class UCompass_C final : public UEndCompassWindow
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Compass;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Compass_C">();
	}
	static class UCompass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompass_C>();
	}
};
static_assert(alignof(UCompass_C) == 0x000008, "Wrong alignment on UCompass_C");
static_assert(sizeof(UCompass_C) == 0x0003F0, "Wrong size on UCompass_C");
static_assert(offsetof(UCompass_C, Out) == 0x0003D8, "Member 'UCompass_C::Out' has a wrong offset!");
static_assert(offsetof(UCompass_C, In) == 0x0003E0, "Member 'UCompass_C::In' has a wrong offset!");
static_assert(offsetof(UCompass_C, Ims_Compass) == 0x0003E8, "Member 'UCompass_C::Ims_Compass' has a wrong offset!");

}

