#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Core_CellNew

#include "Basic.hpp"


namespace SDK::Params
{

// Function Core_CellNew.Core_CellNew_C.ExecuteUbergraph_Core_CellNew
// 0x0008 (0x0008 - 0x0000)
struct Core_CellNew_C_ExecuteUbergraph_Core_CellNew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_2;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Core_CellNew_C_ExecuteUbergraph_Core_CellNew) == 0x000004, "Wrong alignment on Core_CellNew_C_ExecuteUbergraph_Core_CellNew");
static_assert(sizeof(Core_CellNew_C_ExecuteUbergraph_Core_CellNew) == 0x000008, "Wrong size on Core_CellNew_C_ExecuteUbergraph_Core_CellNew");
static_assert(offsetof(Core_CellNew_C_ExecuteUbergraph_Core_CellNew, EntryPoint) == 0x000000, "Member 'Core_CellNew_C_ExecuteUbergraph_Core_CellNew::EntryPoint' has a wrong offset!");
static_assert(offsetof(Core_CellNew_C_ExecuteUbergraph_Core_CellNew, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'Core_CellNew_C_ExecuteUbergraph_Core_CellNew::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_CellNew_C_ExecuteUbergraph_Core_CellNew, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000005, "Member 'Core_CellNew_C_ExecuteUbergraph_Core_CellNew::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Core_CellNew_C_ExecuteUbergraph_Core_CellNew, CallFunc_PlayAnimationByName_ReturnValue_2) == 0x000006, "Member 'Core_CellNew_C_ExecuteUbergraph_Core_CellNew::CallFunc_PlayAnimationByName_ReturnValue_2' has a wrong offset!");

}

