#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Debug_EndGame

#include "Basic.hpp"


namespace SDK::Params
{

// Function Debug_EndGame.Debug_EndGame_C.ExecuteUbergraph_Debug_EndGame
// 0x0030 (0x0030 - 0x0000)
struct Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetDebugID_ReturnValue;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndGameMode*                           K2Node_DynamicCast_AsEnd_Game_Mode;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame) == 0x000008, "Wrong alignment on Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame");
static_assert(sizeof(Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame) == 0x000030, "Wrong size on Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame");
static_assert(offsetof(Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame, EntryPoint) == 0x000000, "Member 'Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame::EntryPoint' has a wrong offset!");
static_assert(offsetof(Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame, CallFunc_GetDebugID_ReturnValue) == 0x000004, "Member 'Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame::CallFunc_GetDebugID_ReturnValue' has a wrong offset!");
static_assert(offsetof(Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame, CallFunc_GetGameMode_ReturnValue) == 0x000010, "Member 'Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame, K2Node_DynamicCast_AsEnd_Game_Mode) == 0x000020, "Member 'Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame::K2Node_DynamicCast_AsEnd_Game_Mode' has a wrong offset!");
static_assert(offsetof(Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Debug_EndGame_C_ExecuteUbergraph_Debug_EndGame::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

