#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EB0017_00_DarkNation_Standard_AIBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndDataObject_structs.hpp"
#include "EndDataBase_structs.hpp"


namespace SDK::Params
{

// Function EB0017_00_DarkNation_Standard_AIBP.EB0017_00_DarkNation_Standard_AIBP_C.OnAddStatusChangeID
// 0x0008 (0x0008 - 0x0000)
struct EB0017_00_DarkNation_Standard_AIBP_C_OnAddStatusChangeID final
{
public:
	class FName                                   statusChangeID;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0017_00_DarkNation_Standard_AIBP_C_OnAddStatusChangeID) == 0x000004, "Wrong alignment on EB0017_00_DarkNation_Standard_AIBP_C_OnAddStatusChangeID");
static_assert(sizeof(EB0017_00_DarkNation_Standard_AIBP_C_OnAddStatusChangeID) == 0x000008, "Wrong size on EB0017_00_DarkNation_Standard_AIBP_C_OnAddStatusChangeID");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnAddStatusChangeID, statusChangeID) == 0x000000, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnAddStatusChangeID::statusChangeID' has a wrong offset!");

// Function EB0017_00_DarkNation_Standard_AIBP.EB0017_00_DarkNation_Standard_AIBP_C.OnRemoveStatusChangeID
// 0x0008 (0x0008 - 0x0000)
struct EB0017_00_DarkNation_Standard_AIBP_C_OnRemoveStatusChangeID final
{
public:
	class FName                                   statusChangeID;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0017_00_DarkNation_Standard_AIBP_C_OnRemoveStatusChangeID) == 0x000004, "Wrong alignment on EB0017_00_DarkNation_Standard_AIBP_C_OnRemoveStatusChangeID");
static_assert(sizeof(EB0017_00_DarkNation_Standard_AIBP_C_OnRemoveStatusChangeID) == 0x000008, "Wrong size on EB0017_00_DarkNation_Standard_AIBP_C_OnRemoveStatusChangeID");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnRemoveStatusChangeID, statusChangeID) == 0x000000, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnRemoveStatusChangeID::statusChangeID' has a wrong offset!");

// Function EB0017_00_DarkNation_Standard_AIBP.EB0017_00_DarkNation_Standard_AIBP_C.OnAITimerInvoke
// 0x0008 (0x0008 - 0x0000)
struct EB0017_00_DarkNation_Standard_AIBP_C_OnAITimerInvoke final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0017_00_DarkNation_Standard_AIBP_C_OnAITimerInvoke) == 0x000004, "Wrong alignment on EB0017_00_DarkNation_Standard_AIBP_C_OnAITimerInvoke");
static_assert(sizeof(EB0017_00_DarkNation_Standard_AIBP_C_OnAITimerInvoke) == 0x000008, "Wrong size on EB0017_00_DarkNation_Standard_AIBP_C_OnAITimerInvoke");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnAITimerInvoke, ID) == 0x000000, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnAITimerInvoke::ID' has a wrong offset!");

// Function EB0017_00_DarkNation_Standard_AIBP.EB0017_00_DarkNation_Standard_AIBP_C.OnGroupMessageInvoke
// 0x0020 (0x0020 - 0x0000)
struct EB0017_00_DarkNation_Standard_AIBP_C_OnGroupMessageInvoke final
{
public:
	struct FEndAIBattleGroupNotifyInfo            NotifyInfo;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(EB0017_00_DarkNation_Standard_AIBP_C_OnGroupMessageInvoke) == 0x000008, "Wrong alignment on EB0017_00_DarkNation_Standard_AIBP_C_OnGroupMessageInvoke");
static_assert(sizeof(EB0017_00_DarkNation_Standard_AIBP_C_OnGroupMessageInvoke) == 0x000020, "Wrong size on EB0017_00_DarkNation_Standard_AIBP_C_OnGroupMessageInvoke");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGroupMessageInvoke, NotifyInfo) == 0x000000, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGroupMessageInvoke::NotifyInfo' has a wrong offset!");

// Function EB0017_00_DarkNation_Standard_AIBP.EB0017_00_DarkNation_Standard_AIBP_C.OnAICombinationInvoke
// 0x0010 (0x0010 - 0x0000)
struct EB0017_00_DarkNation_Standard_AIBP_C_OnAICombinationInvoke final
{
public:
	EEndAIEnemyCombinationNotify                  NotifyType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CombinationId;                                     // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0017_00_DarkNation_Standard_AIBP_C_OnAICombinationInvoke) == 0x000004, "Wrong alignment on EB0017_00_DarkNation_Standard_AIBP_C_OnAICombinationInvoke");
static_assert(sizeof(EB0017_00_DarkNation_Standard_AIBP_C_OnAICombinationInvoke) == 0x000010, "Wrong size on EB0017_00_DarkNation_Standard_AIBP_C_OnAICombinationInvoke");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnAICombinationInvoke, NotifyType) == 0x000000, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnAICombinationInvoke::NotifyType' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnAICombinationInvoke, CombinationId) == 0x000004, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnAICombinationInvoke::CombinationId' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnAICombinationInvoke, Count) == 0x00000C, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnAICombinationInvoke::Count' has a wrong offset!");

// Function EB0017_00_DarkNation_Standard_AIBP.EB0017_00_DarkNation_Standard_AIBP_C.OnEndAICombinationInvoke
// 0x0008 (0x0008 - 0x0000)
struct EB0017_00_DarkNation_Standard_AIBP_C_OnEndAICombinationInvoke final
{
public:
	class FName                                   CombinationId;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0017_00_DarkNation_Standard_AIBP_C_OnEndAICombinationInvoke) == 0x000004, "Wrong alignment on EB0017_00_DarkNation_Standard_AIBP_C_OnEndAICombinationInvoke");
static_assert(sizeof(EB0017_00_DarkNation_Standard_AIBP_C_OnEndAICombinationInvoke) == 0x000008, "Wrong size on EB0017_00_DarkNation_Standard_AIBP_C_OnEndAICombinationInvoke");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnEndAICombinationInvoke, CombinationId) == 0x000000, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnEndAICombinationInvoke::CombinationId' has a wrong offset!");

// Function EB0017_00_DarkNation_Standard_AIBP.EB0017_00_DarkNation_Standard_AIBP_C.OnTakeDamageInvoke
// 0x0090 (0x0090 - 0x0000)
struct EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          InChara;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InName;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAbilityCommandType                  InCommandType;                                     // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InBind;                                            // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InGuard;                                           // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InBoneName;                                        // 0x001C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InAttributeWeak;                                   // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InDmgSrcID;                                        // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAttributeType                       appendAttribute;                                   // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         justHitRotYaw;                                     // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                hitPosition;                                       // 0x0038(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InHeal;                                            // 0x0044(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InCounter;                                         // 0x0045(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEndDataObjectBattleDamageSourceAccessor dataObjectBattleDamageSource;                      // 0x0048(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          useAbilityUCPC;                                    // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEndDataObjectBattleAbilityAccessor    dataObjectBattleAbility;                           // 0x0070(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke) == 0x000008, "Wrong alignment on EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke");
static_assert(sizeof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke) == 0x000090, "Wrong size on EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, Damage) == 0x000000, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::Damage' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, InChara) == 0x000008, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::InChara' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, InName) == 0x000010, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::InName' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, InCommandType) == 0x000018, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::InCommandType' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, InBind) == 0x000019, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::InBind' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, InGuard) == 0x00001A, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::InGuard' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, InBoneName) == 0x00001C, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::InBoneName' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, InAttributeWeak) == 0x000024, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::InAttributeWeak' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, InDmgSrcID) == 0x000028, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::InDmgSrcID' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, appendAttribute) == 0x000030, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::appendAttribute' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, justHitRotYaw) == 0x000034, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::justHitRotYaw' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, hitPosition) == 0x000038, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::hitPosition' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, InHeal) == 0x000044, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::InHeal' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, InCounter) == 0x000045, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::InCounter' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, dataObjectBattleDamageSource) == 0x000048, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::dataObjectBattleDamageSource' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, useAbilityUCPC) == 0x000068, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::useAbilityUCPC' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke, dataObjectBattleAbility) == 0x000070, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnTakeDamageInvoke::dataObjectBattleAbility' has a wrong offset!");

// Function EB0017_00_DarkNation_Standard_AIBP.EB0017_00_DarkNation_Standard_AIBP_C.OnDead
// 0x0001 (0x0001 - 0x0000)
struct EB0017_00_DarkNation_Standard_AIBP_C_OnDead final
{
public:
	bool                                          AtBurst;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EB0017_00_DarkNation_Standard_AIBP_C_OnDead) == 0x000001, "Wrong alignment on EB0017_00_DarkNation_Standard_AIBP_C_OnDead");
static_assert(sizeof(EB0017_00_DarkNation_Standard_AIBP_C_OnDead) == 0x000001, "Wrong size on EB0017_00_DarkNation_Standard_AIBP_C_OnDead");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnDead, AtBurst) == 0x000000, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnDead::AtBurst' has a wrong offset!");

// Function EB0017_00_DarkNation_Standard_AIBP.EB0017_00_DarkNation_Standard_AIBP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct EB0017_00_DarkNation_Standard_AIBP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0017_00_DarkNation_Standard_AIBP_C_ReceiveTick) == 0x000004, "Wrong alignment on EB0017_00_DarkNation_Standard_AIBP_C_ReceiveTick");
static_assert(sizeof(EB0017_00_DarkNation_Standard_AIBP_C_ReceiveTick) == 0x000004, "Wrong size on EB0017_00_DarkNation_Standard_AIBP_C_ReceiveTick");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function EB0017_00_DarkNation_Standard_AIBP.EB0017_00_DarkNation_Standard_AIBP_C.OnProwlInvoke
// 0x0001 (0x0001 - 0x0000)
struct EB0017_00_DarkNation_Standard_AIBP_C_OnProwlInvoke final
{
public:
	EEndAIProwlCallType                           CallType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0017_00_DarkNation_Standard_AIBP_C_OnProwlInvoke) == 0x000001, "Wrong alignment on EB0017_00_DarkNation_Standard_AIBP_C_OnProwlInvoke");
static_assert(sizeof(EB0017_00_DarkNation_Standard_AIBP_C_OnProwlInvoke) == 0x000001, "Wrong size on EB0017_00_DarkNation_Standard_AIBP_C_OnProwlInvoke");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnProwlInvoke, CallType) == 0x000000, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnProwlInvoke::CallType' has a wrong offset!");

// Function EB0017_00_DarkNation_Standard_AIBP.EB0017_00_DarkNation_Standard_AIBP_C.OnActionInvoke
// 0x000C (0x000C - 0x0000)
struct EB0017_00_DarkNation_Standard_AIBP_C_OnActionInvoke final
{
public:
	EEndAIIntervalType                            IntervalType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ExtraIntervalId;                                   // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0017_00_DarkNation_Standard_AIBP_C_OnActionInvoke) == 0x000004, "Wrong alignment on EB0017_00_DarkNation_Standard_AIBP_C_OnActionInvoke");
static_assert(sizeof(EB0017_00_DarkNation_Standard_AIBP_C_OnActionInvoke) == 0x00000C, "Wrong size on EB0017_00_DarkNation_Standard_AIBP_C_OnActionInvoke");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnActionInvoke, IntervalType) == 0x000000, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnActionInvoke::IntervalType' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnActionInvoke, ExtraIntervalId) == 0x000004, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnActionInvoke::ExtraIntervalId' has a wrong offset!");

// Function EB0017_00_DarkNation_Standard_AIBP.EB0017_00_DarkNation_Standard_AIBP_C.OnActionTopPriorityInvoke
// 0x0008 (0x0008 - 0x0000)
struct EB0017_00_DarkNation_Standard_AIBP_C_OnActionTopPriorityInvoke final
{
public:
	class FName                                   TopPriorityActionId;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0017_00_DarkNation_Standard_AIBP_C_OnActionTopPriorityInvoke) == 0x000004, "Wrong alignment on EB0017_00_DarkNation_Standard_AIBP_C_OnActionTopPriorityInvoke");
static_assert(sizeof(EB0017_00_DarkNation_Standard_AIBP_C_OnActionTopPriorityInvoke) == 0x000008, "Wrong size on EB0017_00_DarkNation_Standard_AIBP_C_OnActionTopPriorityInvoke");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnActionTopPriorityInvoke, TopPriorityActionId) == 0x000000, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnActionTopPriorityInvoke::TopPriorityActionId' has a wrong offset!");

// Function EB0017_00_DarkNation_Standard_AIBP.EB0017_00_DarkNation_Standard_AIBP_C.OnGiveDamageInvoke
// 0x0038 (0x0038 - 0x0000)
struct EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          InTarget;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InName;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InBind;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InGuard;                                           // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          KeepOver;                                          // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InCounter;                                         // 0x001B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   InBoneName;                                        // 0x001C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InAttributeWeak;                                   // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InDamageSourceID;                                  // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InSteal;                                           // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          heal;                                              // 0x0031(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          kill;                                              // 0x0032(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          justGuard;                                         // 0x0033(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLock;                                             // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke) == 0x000008, "Wrong alignment on EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke");
static_assert(sizeof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke) == 0x000038, "Wrong size on EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke, Damage) == 0x000000, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke::Damage' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke, InTarget) == 0x000008, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke::InTarget' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke, InName) == 0x000010, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke::InName' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke, InBind) == 0x000018, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke::InBind' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke, InGuard) == 0x000019, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke::InGuard' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke, KeepOver) == 0x00001A, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke::KeepOver' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke, InCounter) == 0x00001B, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke::InCounter' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke, InBoneName) == 0x00001C, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke::InBoneName' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke, InAttributeWeak) == 0x000024, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke::InAttributeWeak' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke, InDamageSourceID) == 0x000028, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke::InDamageSourceID' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke, InSteal) == 0x000030, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke::InSteal' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke, heal) == 0x000031, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke::heal' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke, kill) == 0x000032, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke::kill' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke, justGuard) == 0x000033, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke::justGuard' has a wrong offset!");
static_assert(offsetof(EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke, bLock) == 0x000034, "Member 'EB0017_00_DarkNation_Standard_AIBP_C_OnGiveDamageInvoke::bLock' has a wrong offset!");

// Function EB0017_00_DarkNation_Standard_AIBP.EB0017_00_DarkNation_Standard_AIBP_C.ExecuteUbergraph_EB0017_00_DarkNation_Standard_AIBP
// 0x0D38 (0x0D38 - 0x0000)
struct EB0017_00_DarkNation_Standard_AIBP_C_ExecuteUbergraph_EB0017_00_DarkNation_Standard_AIBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestAction_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingAICombination_ReturnValue;       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSyncAction_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetFeetLocation_ReturnValue;              // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndNavModifierVolume*                  CallFunc_GetNavFromName_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlapPoint_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_2;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndNavModifierVolume*                  CallFunc_GetNavFromName_ReturnValue_1;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_3;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_4;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue_1;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_5;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFeetLocation_ReturnValue_1;            // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue_1;          // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AEndNavModifierVolume*                  CallFunc_GetNavFromName_ReturnValue_2;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlapPoint_ReturnValue_1;             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndNavModifierVolume*                  CallFunc_GetNavFromName_ReturnValue_3;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_6;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue_2;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndNavModifierVolume*                  CallFunc_GetNavFromName_ReturnValue_4;             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_7;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_8;               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharaHP_ReturnValue;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_9;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBreak_ReturnValue;                      // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBurst_ReturnValue;                      // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18B[0x5];                                      // 0x018B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue_3;             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_10;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_11;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_12;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_ConditionTag;                         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndNavModifierVolume*                  CallFunc_GetNavFromName_ReturnValue_5;             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_13;              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_LockTargetTag;                        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetFeetLocation_ReturnValue_2;            // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetGroupIndividualMember_ReturnValue;     // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InMotionName_2;                       // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InName_4;                             // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIntValue_2;                         // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InFloatValue_2;                       // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ActionDefTag_1;                       // 0x0224(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_3;                    // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ActionDefTag;                         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_SuspendAbilityId;                     // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSuspendSummonCutScene;               // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_4;                    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_AbilityID_1;                          // 0x0244(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_createdDamageSource;                  // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_suspended;                            // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_suspendedSummonCutScene;              // 0x024E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_5;                    // 0x024F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AEndCharacter*                          K2Node_Event_causerCharacter;                      // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue_4;             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InMotionName_1;                       // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InName_3;                             // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIntValue_1;                         // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InFloatValue_1;                       // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InTotalDuration;                      // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_6;                    // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_14;              // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InMotionName;                         // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InName_2;                             // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIntValue;                           // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InFloatValue;                         // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_7;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_15;              // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_16;              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue_5;             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_17;              // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_18;              // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_19;              // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBreak_ReturnValue_1;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBreak_ReturnValue_2;                    // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_20;              // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_21;              // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AbilityID;                            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_22;              // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_8;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetGroupIndividualMember_ReturnValue_1;   // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_4;                      // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_4;                     // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_4;                       // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_2;            // 0x0344(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_23;              // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_24;              // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_instant;                              // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_25;              // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_26;              // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue_6;             // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_27;              // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetPartyLeader_ReturnValue_7;             // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_5;                      // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_5;                     // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_5;                       // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSubclassOf<class UEndAIActionDefinition>> K2Node_MakeArray_Array;                            // 0x03B0(0x0010)(ReferenceParm)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x03C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_2;        // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_28;              // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_statusChangeID_1;                     // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Die_ReturnValue;                          // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E2[0x2];                                      // 0x03E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_statusChangeID;                       // 0x03E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_29;              // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x03F8(0x0018)(HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_30;              // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
