#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EB0016_00_Rufus_Standard_AIBP

#include "Basic.hpp"

#include "EndDataObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "EndDataBase_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_Insert_K2Node_InputKeyEvent_20
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Insert_K2Node_InputKeyEvent_20 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Insert_K2Node_InputKeyEvent_20) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Insert_K2Node_InputKeyEvent_20");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Insert_K2Node_InputKeyEvent_20) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Insert_K2Node_InputKeyEvent_20");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Insert_K2Node_InputKeyEvent_20, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Insert_K2Node_InputKeyEvent_20::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_Z_K2Node_InputKeyEvent_19
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Z_K2Node_InputKeyEvent_19 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Z_K2Node_InputKeyEvent_19) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Z_K2Node_InputKeyEvent_19");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Z_K2Node_InputKeyEvent_19) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Z_K2Node_InputKeyEvent_19");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Z_K2Node_InputKeyEvent_19, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Z_K2Node_InputKeyEvent_19::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_X_K2Node_InputKeyEvent_18
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_X_K2Node_InputKeyEvent_18 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_X_K2Node_InputKeyEvent_18) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_X_K2Node_InputKeyEvent_18");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_X_K2Node_InputKeyEvent_18) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_X_K2Node_InputKeyEvent_18");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_X_K2Node_InputKeyEvent_18, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_X_K2Node_InputKeyEvent_18::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_C_K2Node_InputKeyEvent_17
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_C_K2Node_InputKeyEvent_17 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_C_K2Node_InputKeyEvent_17) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_C_K2Node_InputKeyEvent_17");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_C_K2Node_InputKeyEvent_17) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_C_K2Node_InputKeyEvent_17");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_C_K2Node_InputKeyEvent_17, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_C_K2Node_InputKeyEvent_17::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_Y_K2Node_InputKeyEvent_16
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Y_K2Node_InputKeyEvent_16 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Y_K2Node_InputKeyEvent_16) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Y_K2Node_InputKeyEvent_16");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Y_K2Node_InputKeyEvent_16) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Y_K2Node_InputKeyEvent_16");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Y_K2Node_InputKeyEvent_16, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Y_K2Node_InputKeyEvent_16::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_U_K2Node_InputKeyEvent_15
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_U_K2Node_InputKeyEvent_15 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_U_K2Node_InputKeyEvent_15) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_U_K2Node_InputKeyEvent_15");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_U_K2Node_InputKeyEvent_15) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_U_K2Node_InputKeyEvent_15");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_U_K2Node_InputKeyEvent_15, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_U_K2Node_InputKeyEvent_15::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_LeftShift_K2Node_InputKeyEvent_14
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_14 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_14) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_14");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_14) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_14");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_14, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_14::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_BackSpace_K2Node_InputKeyEvent_13
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_BackSpace_K2Node_InputKeyEvent_13 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_BackSpace_K2Node_InputKeyEvent_13) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_BackSpace_K2Node_InputKeyEvent_13");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_BackSpace_K2Node_InputKeyEvent_13) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_BackSpace_K2Node_InputKeyEvent_13");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_BackSpace_K2Node_InputKeyEvent_13, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_BackSpace_K2Node_InputKeyEvent_13::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_Zero_K2Node_InputKeyEvent_12
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Zero_K2Node_InputKeyEvent_12 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Zero_K2Node_InputKeyEvent_12) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Zero_K2Node_InputKeyEvent_12");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Zero_K2Node_InputKeyEvent_12) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Zero_K2Node_InputKeyEvent_12");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Zero_K2Node_InputKeyEvent_12, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Zero_K2Node_InputKeyEvent_12::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_F_K2Node_InputKeyEvent_11
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_F_K2Node_InputKeyEvent_11 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_F_K2Node_InputKeyEvent_11) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_F_K2Node_InputKeyEvent_11");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_F_K2Node_InputKeyEvent_11) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_F_K2Node_InputKeyEvent_11");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_F_K2Node_InputKeyEvent_11, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_F_K2Node_InputKeyEvent_11::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_G_K2Node_InputKeyEvent_10
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_G_K2Node_InputKeyEvent_10 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_G_K2Node_InputKeyEvent_10) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_G_K2Node_InputKeyEvent_10");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_G_K2Node_InputKeyEvent_10) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_G_K2Node_InputKeyEvent_10");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_G_K2Node_InputKeyEvent_10, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_G_K2Node_InputKeyEvent_10::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_H_K2Node_InputKeyEvent_9
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_H_K2Node_InputKeyEvent_9 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_H_K2Node_InputKeyEvent_9) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_H_K2Node_InputKeyEvent_9");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_H_K2Node_InputKeyEvent_9) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_H_K2Node_InputKeyEvent_9");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_H_K2Node_InputKeyEvent_9, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_H_K2Node_InputKeyEvent_9::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_Up_K2Node_InputKeyEvent_8
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Up_K2Node_InputKeyEvent_8 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Up_K2Node_InputKeyEvent_8) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Up_K2Node_InputKeyEvent_8");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Up_K2Node_InputKeyEvent_8) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Up_K2Node_InputKeyEvent_8");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Up_K2Node_InputKeyEvent_8, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Up_K2Node_InputKeyEvent_8::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_Down_K2Node_InputKeyEvent_7
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Down_K2Node_InputKeyEvent_7 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Down_K2Node_InputKeyEvent_7) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Down_K2Node_InputKeyEvent_7");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Down_K2Node_InputKeyEvent_7) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Down_K2Node_InputKeyEvent_7");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Down_K2Node_InputKeyEvent_7, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Down_K2Node_InputKeyEvent_7::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_V_K2Node_InputKeyEvent_6
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_V_K2Node_InputKeyEvent_6 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_V_K2Node_InputKeyEvent_6) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_V_K2Node_InputKeyEvent_6");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_V_K2Node_InputKeyEvent_6) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_V_K2Node_InputKeyEvent_6");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_V_K2Node_InputKeyEvent_6, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_V_K2Node_InputKeyEvent_6::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_I_K2Node_InputKeyEvent_5
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_I_K2Node_InputKeyEvent_5 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_I_K2Node_InputKeyEvent_5) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_I_K2Node_InputKeyEvent_5");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_I_K2Node_InputKeyEvent_5) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_I_K2Node_InputKeyEvent_5");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_I_K2Node_InputKeyEvent_5, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_I_K2Node_InputKeyEvent_5::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_Left_K2Node_InputKeyEvent_4
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Left_K2Node_InputKeyEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Left_K2Node_InputKeyEvent_4) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Left_K2Node_InputKeyEvent_4");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Left_K2Node_InputKeyEvent_4) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Left_K2Node_InputKeyEvent_4");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Left_K2Node_InputKeyEvent_4, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_Left_K2Node_InputKeyEvent_4::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_B_K2Node_InputKeyEvent_3
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_B_K2Node_InputKeyEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_B_K2Node_InputKeyEvent_3) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_B_K2Node_InputKeyEvent_3");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_B_K2Node_InputKeyEvent_3) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_B_K2Node_InputKeyEvent_3");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_B_K2Node_InputKeyEvent_3, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_B_K2Node_InputKeyEvent_3::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_O_K2Node_InputKeyEvent_2
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_O_K2Node_InputKeyEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_O_K2Node_InputKeyEvent_2) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_O_K2Node_InputKeyEvent_2");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_O_K2Node_InputKeyEvent_2) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_O_K2Node_InputKeyEvent_2");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_O_K2Node_InputKeyEvent_2, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_O_K2Node_InputKeyEvent_2::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_P_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_P_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_P_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_P_K2Node_InputKeyEvent_1");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_P_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_P_K2Node_InputKeyEvent_1");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_P_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_P_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.InpActEvt_RightControl_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_RightControl_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_RightControl_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_RightControl_K2Node_InputKeyEvent_0");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_RightControl_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_RightControl_K2Node_InputKeyEvent_0");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_RightControl_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_InpActEvt_RightControl_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.OnTakeDamageInvoke
// 0x0090 (0x0090 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          InChara;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InName;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAbilityCommandType                  InCommandType;                                     // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InBind;                                            // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InGuard;                                           // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InBoneName;                                        // 0x001C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InAttributeWeak;                                   // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InDmgSrcID;                                        // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAttributeType                       appendAttribute;                                   // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         justHitRotYaw;                                     // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                hitPosition;                                       // 0x0038(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InHeal;                                            // 0x0044(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InCounter;                                         // 0x0045(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEndDataObjectBattleDamageSourceAccessor dataObjectBattleDamageSource;                      // 0x0048(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          useAbilityUCPC;                                    // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEndDataObjectBattleAbilityAccessor    dataObjectBattleAbility;                           // 0x0070(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke) == 0x000090, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, Damage) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::Damage' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, InChara) == 0x000008, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::InChara' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, InName) == 0x000010, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::InName' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, InCommandType) == 0x000018, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::InCommandType' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, InBind) == 0x000019, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::InBind' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, InGuard) == 0x00001A, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::InGuard' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, InBoneName) == 0x00001C, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::InBoneName' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, InAttributeWeak) == 0x000024, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::InAttributeWeak' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, InDmgSrcID) == 0x000028, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::InDmgSrcID' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, appendAttribute) == 0x000030, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::appendAttribute' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, justHitRotYaw) == 0x000034, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::justHitRotYaw' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, hitPosition) == 0x000038, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::hitPosition' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, InHeal) == 0x000044, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::InHeal' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, InCounter) == 0x000045, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::InCounter' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, dataObjectBattleDamageSource) == 0x000048, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::dataObjectBattleDamageSource' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, useAbilityUCPC) == 0x000068, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::useAbilityUCPC' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke, dataObjectBattleAbility) == 0x000070, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageInvoke::dataObjectBattleAbility' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.OnGiveDamageInvoke
// 0x0038 (0x0038 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          InTarget;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InName;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InBind;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InGuard;                                           // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          KeepOver;                                          // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InCounter;                                         // 0x001B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   InBoneName;                                        // 0x001C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InAttributeWeak;                                   // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InDamageSourceID;                                  // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InSteal;                                           // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          heal;                                              // 0x0031(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          kill;                                              // 0x0032(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          justGuard_0;                                       // 0x0033(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLock;                                             // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke) == 0x000038, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke, Damage) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke::Damage' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke, InTarget) == 0x000008, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke::InTarget' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke, InName) == 0x000010, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke::InName' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke, InBind) == 0x000018, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke::InBind' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke, InGuard) == 0x000019, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke::InGuard' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke, KeepOver) == 0x00001A, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke::KeepOver' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke, InCounter) == 0x00001B, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke::InCounter' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke, InBoneName) == 0x00001C, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke::InBoneName' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke, InAttributeWeak) == 0x000024, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke::InAttributeWeak' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke, InDamageSourceID) == 0x000028, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke::InDamageSourceID' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke, InSteal) == 0x000030, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke::InSteal' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke, heal) == 0x000031, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke::heal' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke, kill) == 0x000032, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke::kill' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke, justGuard_0) == 0x000033, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke::justGuard_0' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke, bLock) == 0x000034, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGiveDamageInvoke::bLock' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.OnMotionStateMessageEnd
// 0x0018 (0x0018 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageEnd final
{
public:
	class FName                                   InMotionName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InName;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InIntValue;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InFloatValue;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageEnd) == 0x000004, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageEnd");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageEnd) == 0x000018, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageEnd");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageEnd, InMotionName) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageEnd::InMotionName' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageEnd, InName) == 0x000008, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageEnd::InName' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageEnd, InIntValue) == 0x000010, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageEnd::InIntValue' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageEnd, InFloatValue) == 0x000014, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageEnd::InFloatValue' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.OnTakeDamageHPFirstInvoke
// 0x0038 (0x0038 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageHPFirstInvoke final
{
public:
	class AEndCharacter*                          causerCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AbilityId;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          attributeWeak;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndBattleAbilityCommandType                  AbilityCommandType;                                // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEndDataObjectBattleAbilityAccessor    dataObjectBattleAbility;                           // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageHPFirstInvoke) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageHPFirstInvoke");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageHPFirstInvoke) == 0x000038, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageHPFirstInvoke");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageHPFirstInvoke, causerCharacter) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageHPFirstInvoke::causerCharacter' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageHPFirstInvoke, AbilityId) == 0x000008, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageHPFirstInvoke::AbilityId' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageHPFirstInvoke, attributeWeak) == 0x000010, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageHPFirstInvoke::attributeWeak' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageHPFirstInvoke, AbilityCommandType) == 0x000011, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageHPFirstInvoke::AbilityCommandType' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageHPFirstInvoke, dataObjectBattleAbility) == 0x000018, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnTakeDamageHPFirstInvoke::dataObjectBattleAbility' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.OnMotionStateMessageBegin
// 0x001C (0x001C - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageBegin final
{
public:
	class FName                                   InMotionName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InName;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InIntValue;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InFloatValue;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InTotalDuration;                                   // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageBegin) == 0x000004, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageBegin");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageBegin) == 0x00001C, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageBegin");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageBegin, InMotionName) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageBegin::InMotionName' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageBegin, InName) == 0x000008, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageBegin::InName' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageBegin, InIntValue) == 0x000010, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageBegin::InIntValue' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageBegin, InFloatValue) == 0x000014, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageBegin::InFloatValue' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageBegin, InTotalDuration) == 0x000018, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnMotionStateMessageBegin::InTotalDuration' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.OnPreTakeDamage
// 0x0068 (0x0068 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage final
{
public:
	float                                         justHitRotYaw;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          ownerCharacter;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InName;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   hitBoneName;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DamageSourceID;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                hitPosition;                                       // 0x0028(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Damage;                                            // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InGuard;                                           // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndBattleAttributeType                       appendAttribute;                                   // 0x0039(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEndDataObjectBattleDamageSourceAccessor dataObjectBattleDamageSource;                      // 0x0040(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          heal;                                              // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage) == 0x000068, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage, justHitRotYaw) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage::justHitRotYaw' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage, ownerCharacter) == 0x000008, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage::ownerCharacter' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage, InName) == 0x000010, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage::InName' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage, hitBoneName) == 0x000018, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage::hitBoneName' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage, DamageSourceID) == 0x000020, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage::DamageSourceID' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage, hitPosition) == 0x000028, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage::hitPosition' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage, Damage) == 0x000034, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage::Damage' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage, InGuard) == 0x000038, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage::InGuard' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage, appendAttribute) == 0x000039, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage::appendAttribute' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage, dataObjectBattleDamageSource) == 0x000040, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage::dataObjectBattleDamageSource' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage, heal) == 0x000060, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnPreTakeDamage::heal' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.OnGroupMessageInvoke
// 0x0020 (0x0020 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_OnGroupMessageInvoke final
{
public:
	struct FEndAIBattleGroupNotifyInfo            NotifyInfo;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_OnGroupMessageInvoke) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_OnGroupMessageInvoke");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_OnGroupMessageInvoke) == 0x000020, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_OnGroupMessageInvoke");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnGroupMessageInvoke, NotifyInfo) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnGroupMessageInvoke::NotifyInfo' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.OnAICombinationInvoke
// 0x0010 (0x0010 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_OnAICombinationInvoke final
{
public:
	EEndAIEnemyCombinationNotify                  NotifyType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CombinationId_0;                                   // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_OnAICombinationInvoke) == 0x000004, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_OnAICombinationInvoke");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_OnAICombinationInvoke) == 0x000010, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_OnAICombinationInvoke");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnAICombinationInvoke, NotifyType) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnAICombinationInvoke::NotifyType' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnAICombinationInvoke, CombinationId_0) == 0x000004, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnAICombinationInvoke::CombinationId_0' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnAICombinationInvoke, Count) == 0x00000C, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnAICombinationInvoke::Count' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.OnEndAICombinationInvoke
// 0x0008 (0x0008 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_OnEndAICombinationInvoke final
{
public:
	class FName                                   CombinationId_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_OnEndAICombinationInvoke) == 0x000004, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_OnEndAICombinationInvoke");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_OnEndAICombinationInvoke) == 0x000008, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_OnEndAICombinationInvoke");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnEndAICombinationInvoke, CombinationId_0) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnEndAICombinationInvoke::CombinationId_0' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.OnExtraConditionInvoke
// 0x0008 (0x0008 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_OnExtraConditionInvoke final
{
public:
	class FName                                   ConditionTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_OnExtraConditionInvoke) == 0x000004, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_OnExtraConditionInvoke");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_OnExtraConditionInvoke) == 0x000008, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_OnExtraConditionInvoke");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnExtraConditionInvoke, ConditionTag) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnExtraConditionInvoke::ConditionTag' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.OnReactionSensingInvoke
// 0x0010 (0x0010 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingInvoke final
{
public:
	class AEndCharacter*                          CauserChara_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HandleId_0;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleReactionNotificationType            NotificationType;                                  // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAttackDirectionType                 AttackDirectionType;                               // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingInvoke) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingInvoke");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingInvoke) == 0x000010, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingInvoke");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingInvoke, CauserChara_0) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingInvoke::CauserChara_0' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingInvoke, HandleId_0) == 0x000008, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingInvoke::HandleId_0' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingInvoke, NotificationType) == 0x00000C, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingInvoke::NotificationType' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingInvoke, AttackDirectionType) == 0x00000D, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingInvoke::AttackDirectionType' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.OnReactionSensingTakeAbilityInvoke
// 0x0010 (0x0010 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingTakeAbilityInvoke final
{
public:
	class AEndCharacter*                          CauserChara_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HandleId_0;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingTakeAbilityInvoke) == 0x000008, "Wrong alignment on EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingTakeAbilityInvoke");
static_assert(sizeof(EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingTakeAbilityInvoke) == 0x000010, "Wrong size on EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingTakeAbilityInvoke");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingTakeAbilityInvoke, CauserChara_0) == 0x000000, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingTakeAbilityInvoke::CauserChara_0' has a wrong offset!");
static_assert(offsetof(EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingTakeAbilityInvoke, HandleId_0) == 0x000008, "Member 'EB0016_00_Rufus_Standard_AIBP_C_OnReactionSensingTakeAbilityInvoke::HandleId_0' has a wrong offset!");

// Function EB0016_00_Rufus_Standard_AIBP.EB0016_00_Rufus_Standard_AIBP_C.OnDefenseGuard
// 0x0040 (0x0040 - 0x0000)
struct EB0016_00_Rufus_Standard_AIBP_C_OnDefenseGuard final
{
public:
	class FName                                   battleDefenseID;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleDefenseGuardType                    defenseGuardType;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
