#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EB_Base_AIBP

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function EB_Base_AIBP.EB_Base_AIBP_C.ExecuteUbergraph_EB_Base_AIBP
// 0x0020 (0x0020 - 0x0000)
struct EB_Base_AIBP_C_ExecuteUbergraph_EB_Base_AIBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ToggleDebugEditMode_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0008(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(EB_Base_AIBP_C_ExecuteUbergraph_EB_Base_AIBP) == 0x000008, "Wrong alignment on EB_Base_AIBP_C_ExecuteUbergraph_EB_Base_AIBP");
static_assert(sizeof(EB_Base_AIBP_C_ExecuteUbergraph_EB_Base_AIBP) == 0x000020, "Wrong size on EB_Base_AIBP_C_ExecuteUbergraph_EB_Base_AIBP");
static_assert(offsetof(EB_Base_AIBP_C_ExecuteUbergraph_EB_Base_AIBP, EntryPoint) == 0x000000, "Member 'EB_Base_AIBP_C_ExecuteUbergraph_EB_Base_AIBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(EB_Base_AIBP_C_ExecuteUbergraph_EB_Base_AIBP, CallFunc_ToggleDebugEditMode_ReturnValue) == 0x000004, "Member 'EB_Base_AIBP_C_ExecuteUbergraph_EB_Base_AIBP::CallFunc_ToggleDebugEditMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(EB_Base_AIBP_C_ExecuteUbergraph_EB_Base_AIBP, K2Node_InputKeyEvent_Key) == 0x000008, "Member 'EB_Base_AIBP_C_ExecuteUbergraph_EB_Base_AIBP::K2Node_InputKeyEvent_Key' has a wrong offset!");

// Function EB_Base_AIBP.EB_Base_AIBP_C.InpActEvt_Home_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct EB_Base_AIBP_C_InpActEvt_Home_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB_Base_AIBP_C_InpActEvt_Home_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on EB_Base_AIBP_C_InpActEvt_Home_K2Node_InputKeyEvent_0");
static_assert(sizeof(EB_Base_AIBP_C_InpActEvt_Home_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on EB_Base_AIBP_C_InpActEvt_Home_K2Node_InputKeyEvent_0");
static_assert(offsetof(EB_Base_AIBP_C_InpActEvt_Home_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'EB_Base_AIBP_C_InpActEvt_Home_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

}

