#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EN0002_00_ShieldSoldier_Standard_AIBP

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function EN0002_00_ShieldSoldier_Standard_AIBP.EN0002_00_ShieldSoldier_Standard_AIBP_C.OnActionInvoke
// 0x000C (0x000C - 0x0000)
struct EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionInvoke final
{
public:
	EEndAIIntervalType                            IntervalType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ExtraIntervalId;                                   // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionInvoke) == 0x000004, "Wrong alignment on EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionInvoke");
static_assert(sizeof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionInvoke) == 0x00000C, "Wrong size on EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionInvoke");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionInvoke, IntervalType) == 0x000000, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionInvoke::IntervalType' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionInvoke, ExtraIntervalId) == 0x000004, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionInvoke::ExtraIntervalId' has a wrong offset!");

// Function EN0002_00_ShieldSoldier_Standard_AIBP.EN0002_00_ShieldSoldier_Standard_AIBP_C.OnBeginBreak
// 0x0008 (0x0008 - 0x0000)
struct EN0002_00_ShieldSoldier_Standard_AIBP_C_OnBeginBreak final
{
public:
	class AEndCharacter*                          causerCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnBeginBreak) == 0x000008, "Wrong alignment on EN0002_00_ShieldSoldier_Standard_AIBP_C_OnBeginBreak");
static_assert(sizeof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnBeginBreak) == 0x000008, "Wrong size on EN0002_00_ShieldSoldier_Standard_AIBP_C_OnBeginBreak");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnBeginBreak, causerCharacter) == 0x000000, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_OnBeginBreak::causerCharacter' has a wrong offset!");

// Function EN0002_00_ShieldSoldier_Standard_AIBP.EN0002_00_ShieldSoldier_Standard_AIBP_C.OnProwlInvoke
// 0x0001 (0x0001 - 0x0000)
struct EN0002_00_ShieldSoldier_Standard_AIBP_C_OnProwlInvoke final
{
public:
	EEndAIProwlCallType                           CallType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnProwlInvoke) == 0x000001, "Wrong alignment on EN0002_00_ShieldSoldier_Standard_AIBP_C_OnProwlInvoke");
static_assert(sizeof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnProwlInvoke) == 0x000001, "Wrong size on EN0002_00_ShieldSoldier_Standard_AIBP_C_OnProwlInvoke");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnProwlInvoke, CallType) == 0x000000, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_OnProwlInvoke::CallType' has a wrong offset!");

// Function EN0002_00_ShieldSoldier_Standard_AIBP.EN0002_00_ShieldSoldier_Standard_AIBP_C.OnActionTopPriorityInvoke
// 0x0008 (0x0008 - 0x0000)
struct EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionTopPriorityInvoke final
{
public:
	class FName                                   TopPriorityActionId;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionTopPriorityInvoke) == 0x000004, "Wrong alignment on EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionTopPriorityInvoke");
static_assert(sizeof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionTopPriorityInvoke) == 0x000008, "Wrong size on EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionTopPriorityInvoke");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionTopPriorityInvoke, TopPriorityActionId) == 0x000000, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_OnActionTopPriorityInvoke::TopPriorityActionId' has a wrong offset!");

// Function EN0002_00_ShieldSoldier_Standard_AIBP.EN0002_00_ShieldSoldier_Standard_AIBP_C.OnStartActionDefinitionInvoke
// 0x0008 (0x0008 - 0x0000)
struct EN0002_00_ShieldSoldier_Standard_AIBP_C_OnStartActionDefinitionInvoke final
{
public:
	class FName                                   ActionDefTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnStartActionDefinitionInvoke) == 0x000004, "Wrong alignment on EN0002_00_ShieldSoldier_Standard_AIBP_C_OnStartActionDefinitionInvoke");
static_assert(sizeof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnStartActionDefinitionInvoke) == 0x000008, "Wrong size on EN0002_00_ShieldSoldier_Standard_AIBP_C_OnStartActionDefinitionInvoke");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnStartActionDefinitionInvoke, ActionDefTag) == 0x000000, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_OnStartActionDefinitionInvoke::ActionDefTag' has a wrong offset!");

// Function EN0002_00_ShieldSoldier_Standard_AIBP.EN0002_00_ShieldSoldier_Standard_AIBP_C.OnMoveTimeOutInvoke
// 0x001C (0x001C - 0x0000)
struct EN0002_00_ShieldSoldier_Standard_AIBP_C_OnMoveTimeOutInvoke final
{
public:
	EEndAIActionMoveTimeOut                       TimeOutType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MoveDefTag;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ActionDefTag;                                      // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ComboDefTag;                                       // 0x0014(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnMoveTimeOutInvoke) == 0x000004, "Wrong alignment on EN0002_00_ShieldSoldier_Standard_AIBP_C_OnMoveTimeOutInvoke");
static_assert(sizeof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnMoveTimeOutInvoke) == 0x00001C, "Wrong size on EN0002_00_ShieldSoldier_Standard_AIBP_C_OnMoveTimeOutInvoke");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnMoveTimeOutInvoke, TimeOutType) == 0x000000, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_OnMoveTimeOutInvoke::TimeOutType' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnMoveTimeOutInvoke, MoveDefTag) == 0x000004, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_OnMoveTimeOutInvoke::MoveDefTag' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnMoveTimeOutInvoke, ActionDefTag) == 0x00000C, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_OnMoveTimeOutInvoke::ActionDefTag' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_OnMoveTimeOutInvoke, ComboDefTag) == 0x000014, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_OnMoveTimeOutInvoke::ComboDefTag' has a wrong offset!");

// Function EN0002_00_ShieldSoldier_Standard_AIBP.EN0002_00_ShieldSoldier_Standard_AIBP_C.ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP
// 0x00E8 (0x00E8 - 0x0000)
struct EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UEndAIActionDefinitionBase> Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UEndAIActionDefinitionBase> Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEndAIActionPackReturnInfo             CallFunc_RequestActionPack_ReturnValue;            // 0x001C(0x0014)(NoDestructor)
	EEndAIIntervalType                            K2Node_Event_IntervalType;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ExtraIntervalId;                      // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          K2Node_Event_causerCharacter;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_1;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSubclassOf<class UEndAIActionPackBase>> K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue_2;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndAIActionPackReturnInfo             CallFunc_RequestActionPackArray_ReturnValue;       // 0x0070(0x0014)(NoDestructor)
	struct FEndAIActionPackReturnInfo             CallFunc_RequestActionPack_ReturnValue_1;          // 0x0084(0x0014)(NoDestructor)
	EEndAIProwlCallType                           K2Node_Event_CallType;                             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_TopPriorityActionId;                  // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestActionTopPriority_ReturnValue;     // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RequestActionTopPriority_ReturnValue_1;   // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A7[0x1];                                       // 0x00A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UEndAIActionDefinitionBase> K2Node_Select_Default;                             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   K2Node_Event_ActionDefTag_1;                       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestActionTopPriority_ReturnValue_2;   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAIActionMoveTimeOut                       K2Node_Event_TimeOutType;                          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_MoveDefTag;                           // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_ActionDefTag;                         // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_ComboDefTag;                          // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP) == 0x000008, "Wrong alignment on EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP");
static_assert(sizeof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP) == 0x0000E8, "Wrong size on EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, EntryPoint) == 0x000000, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, Temp_class_Variable) == 0x000008, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, Temp_class_Variable_1) == 0x000010, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, CallFunc_NotEqual_NameName_ReturnValue) == 0x000018, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, CallFunc_RequestActionPack_ReturnValue) == 0x00001C, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::CallFunc_RequestActionPack_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, K2Node_Event_IntervalType) == 0x000030, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::K2Node_Event_IntervalType' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, K2Node_Event_ExtraIntervalId) == 0x000034, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::K2Node_Event_ExtraIntervalId' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, K2Node_SwitchEnum_CmpSuccess) == 0x00003C, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, K2Node_Event_causerCharacter) == 0x000040, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::K2Node_Event_causerCharacter' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, CallFunc_GetCharacter_ReturnValue) == 0x000048, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, CallFunc_GetCharacter_ReturnValue_1) == 0x000050, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::CallFunc_GetCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, K2Node_MakeArray_Array) == 0x000058, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, CallFunc_GetCharacter_ReturnValue_2) == 0x000068, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::CallFunc_GetCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, CallFunc_RequestActionPackArray_ReturnValue) == 0x000070, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::CallFunc_RequestActionPackArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, CallFunc_RequestActionPack_ReturnValue_1) == 0x000084, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::CallFunc_RequestActionPack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, K2Node_Event_CallType) == 0x000098, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::K2Node_Event_CallType' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, K2Node_Event_TopPriorityActionId) == 0x00009C, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::K2Node_Event_TopPriorityActionId' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, CallFunc_RequestActionTopPriority_ReturnValue) == 0x0000A4, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::CallFunc_RequestActionTopPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, CallFunc_RequestActionTopPriority_ReturnValue_1) == 0x0000A5, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::CallFunc_RequestActionTopPriority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, K2Node_SwitchName_CmpSuccess) == 0x0000A6, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000A8, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x0000AC, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, Temp_int_Variable) == 0x0000B0, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, K2Node_Select_Default) == 0x0000B8, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, K2Node_Event_ActionDefTag_1) == 0x0000C0, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::K2Node_Event_ActionDefTag_1' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, CallFunc_RequestActionTopPriority_ReturnValue_2) == 0x0000C8, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::CallFunc_RequestActionTopPriority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, K2Node_Event_TimeOutType) == 0x0000C9, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::K2Node_Event_TimeOutType' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, K2Node_Event_MoveDefTag) == 0x0000CC, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::K2Node_Event_MoveDefTag' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, K2Node_Event_ActionDefTag) == 0x0000D4, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::K2Node_Event_ActionDefTag' has a wrong offset!");
static_assert(offsetof(EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP, K2Node_Event_ComboDefTag) == 0x0000DC, "Member 'EN0002_00_ShieldSoldier_Standard_AIBP_C_ExecuteUbergraph_EN0002_00_ShieldSoldier_Standard_AIBP::K2Node_Event_ComboDefTag' has a wrong offset!");

}

