#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EN0000_00_SecuritySoldier_Standard_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function EN0000_00_SecuritySoldier_Standard_Animation.EN0000_00_SecuritySoldier_Standard_Animation_C.ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation
// 0x0134 (0x0134 - 0x0000)
struct EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_12;       // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_13;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAnimBehaviorMode                          Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue;  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_3;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_14;       // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_15;       // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_16;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_17;       // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_4;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_18;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_5;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_19;       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_20;       // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_4;          // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAnimBehaviorMode                          Temp_byte_Variable_1;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_21;       // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_22;       // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_23;       // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_6;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAnimBehaviorMode                          Temp_byte_Variable_2;                              // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_1; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndLocomotionAnimGroup                       CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue; // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_24;       // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_3;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_2; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_4;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_3; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_7;            // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndLocomotionAnimGroup                       CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue_1; // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_25;       // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_5;          // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_5;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_4; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_8;            // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_5; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndLocomotionAnimGroup                       CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue_2; // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_5;                             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_26;       // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_6;                              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_7;                              // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_6; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndLocomotionAnimGroup                       CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue_3; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_6;                             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_27;       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_3;                // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_8;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_8; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_9;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_28;       // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_9; // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_9;                              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_10;           // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_3;                           // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_5;         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_29;       // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_6;          // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_10; // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_11;           // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_30;       // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAnimBehaviorMode                          Temp_byte_Variable_10;                             // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x1];                                      // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_4;                           // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_7;                             // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_6;         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_8;                             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_9;                             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_11;                             // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_31;       // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_5;                           // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_12;           // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_32;       // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_33;       // 0x012F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_34;       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_35;       // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_36;       // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_7;          // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation) == 0x000004, "Wrong alignment on EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation");
static_assert(sizeof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation) == 0x000134, "Wrong size on EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, EntryPoint) == 0x000000, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::EntryPoint' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000005, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000006, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000007, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_BooleanOR_ReturnValue) == 0x000008, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000009, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00000A, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x00000B, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x00000C, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x00000D, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x00000E, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_BooleanOR_ReturnValue_1) == 0x00000F, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x000010, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_9) == 0x000011, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue) == 0x000012, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_10) == 0x000013, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_11) == 0x000015, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x000016, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_12) == 0x000017, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_13) == 0x000018, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x00001C, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000020, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x000024, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x000028, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, Temp_byte_Variable) == 0x000029, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue) == 0x00002C, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2) == 0x000030, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000034, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_3) == 0x000035, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_14) == 0x000036, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_15) == 0x000037, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_16) == 0x000038, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x000039, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_17) == 0x00003A, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3) == 0x00003C, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_4) == 0x000040, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_18) == 0x000041, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4) == 0x000044, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_5) == 0x000048, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_19) == 0x000049, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_20) == 0x00004A, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_NotEqual_ByteByte_ReturnValue_4) == 0x00004B, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_NotEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, Temp_byte_Variable_1) == 0x00004C, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_21) == 0x00004D, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_22) == 0x00004E, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_23) == 0x00004F, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5) == 0x000050, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_6) == 0x000054, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, Temp_byte_Variable_2) == 0x000055, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_1) == 0x000058, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue) == 0x00005C, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, Temp_float_Variable) == 0x000060, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_24) == 0x000064, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_SelectFloat_ReturnValue) == 0x000068, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, Temp_byte_Variable_3) == 0x00006C, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_2) == 0x000070, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, Temp_float_Variable_1) == 0x000074, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, Temp_float_Variable_2) == 0x000078, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, Temp_float_Variable_3) == 0x00007C, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, Temp_byte_Variable_4) == 0x000080, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6) == 0x000084, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_3) == 0x000088, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_7) == 0x00008C, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue_1) == 0x00008D, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_25) == 0x00008E, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_NotEqual_ByteByte_ReturnValue_5) == 0x00008F, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_NotEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_SelectFloat_ReturnValue_1) == 0x000090, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, Temp_float_Variable_4) == 0x000094, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, Temp_byte_Variable_5) == 0x000098, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_4) == 0x00009C, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7) == 0x0000A0, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0000A4, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_8) == 0x0000A5, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_5) == 0x0000A8, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue_2) == 0x0000AC, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, Temp_float_Variable_5) == 0x0000B0, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_26) == 0x0000B4, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_SelectFloat_ReturnValue_2) == 0x0000B8, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, Temp_byte_Variable_6) == 0x0000BC, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, Temp_byte_Variable_7) == 0x0000BD, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, K2Node_Select_Default) == 0x0000C0, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, K2Node_Select_Default_1) == 0x0000C4, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x0000C8, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x0000C9, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_6) == 0x0000CC, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue_3) == 0x0000D0, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation, Temp_float_Variable_6) == 0x0000D4, "Member 'EN0000_00_SecuritySoldier_Standard_Animation_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation::Temp_float_Variable_6' has a wrong offset!");
