#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function EN0000_00_SecuritySoldier_Standard_3100-FOREA_AIBP.EN0000_00_SecuritySoldier_Standard_3100-FOREA_AIBP_C.ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100-FOREA_AIBP
// 0x0060 (0x0060 - 0x0000)
struct EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_ConditionTag;                         // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_MoveDefTag;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_TopPriorityActionId;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RequestActionTopPriority_ReturnValue;     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ID;                                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetResidentParameterIntegerBP_ReturnValue; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetResidentParameterIntegerBP_ReturnValue_1; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP) == 0x000008, "Wrong alignment on EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP");
static_assert(sizeof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP) == 0x000060, "Wrong size on EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, EntryPoint) == 0x000000, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, K2Node_Event_ConditionTag) == 0x000004, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::K2Node_Event_ConditionTag' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00000C, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, K2Node_Event_MoveDefTag) == 0x000010, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::K2Node_Event_MoveDefTag' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, K2Node_Event_TopPriorityActionId) == 0x000018, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::K2Node_Event_TopPriorityActionId' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000020, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, CallFunc_RequestActionTopPriority_ReturnValue) == 0x000021, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::CallFunc_RequestActionTopPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, K2Node_Event_ID) == 0x000024, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::K2Node_Event_ID' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x00002C, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, CallFunc_GetResidentParameterIntegerBP_ReturnValue) == 0x000030, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::CallFunc_GetResidentParameterIntegerBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, CallFunc_Not_PreBool_ReturnValue) == 0x000034, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, CallFunc_BooleanAND_ReturnValue) == 0x000035, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, CallFunc_GetResidentParameterIntegerBP_ReturnValue_1) == 0x000038, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::CallFunc_GetResidentParameterIntegerBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003C, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, CallFunc_Not_PreBool_ReturnValue_2) == 0x00003D, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, CallFunc_Not_PreBool_ReturnValue_3) == 0x00003E, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, CallFunc_BooleanAND_ReturnValue_1) == 0x00003F, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, CallFunc_Not_PreBool_ReturnValue_4) == 0x000040, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, CallFunc_Not_PreBool_ReturnValue_5) == 0x000041, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, K2Node_MakeArray_Array) == 0x000048, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP, CallFunc_Array_Contains_ReturnValue) == 0x000058, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function EN0000_00_SecuritySoldier_Standard_3100-FOREA_AIBP.EN0000_00_SecuritySoldier_Standard_3100-FOREA_AIBP_C.OnAITimerInvoke
// 0x0008 (0x0008 - 0x0000)
struct EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnAITimerInvoke final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnAITimerInvoke) == 0x000004, "Wrong alignment on EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnAITimerInvoke");
static_assert(sizeof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnAITimerInvoke) == 0x000008, "Wrong size on EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnAITimerInvoke");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnAITimerInvoke, ID) == 0x000000, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnAITimerInvoke::ID' has a wrong offset!");

// Function EN0000_00_SecuritySoldier_Standard_3100-FOREA_AIBP.EN0000_00_SecuritySoldier_Standard_3100-FOREA_AIBP_C.OnActionTopPriorityInvoke
// 0x0008 (0x0008 - 0x0000)
struct EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnActionTopPriorityInvoke final
{
public:
	class FName                                   TopPriorityActionId;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnActionTopPriorityInvoke) == 0x000004, "Wrong alignment on EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnActionTopPriorityInvoke");
static_assert(sizeof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnActionTopPriorityInvoke) == 0x000008, "Wrong size on EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnActionTopPriorityInvoke");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnActionTopPriorityInvoke, TopPriorityActionId) == 0x000000, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnActionTopPriorityInvoke::TopPriorityActionId' has a wrong offset!");

// Function EN0000_00_SecuritySoldier_Standard_3100-FOREA_AIBP.EN0000_00_SecuritySoldier_Standard_3100-FOREA_AIBP_C.OnStartMoveDefinitionInvoke
// 0x0008 (0x0008 - 0x0000)
struct EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnStartMoveDefinitionInvoke final
{
public:
	class FName                                   MoveDefTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnStartMoveDefinitionInvoke) == 0x000004, "Wrong alignment on EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnStartMoveDefinitionInvoke");
static_assert(sizeof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnStartMoveDefinitionInvoke) == 0x000008, "Wrong size on EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnStartMoveDefinitionInvoke");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnStartMoveDefinitionInvoke, MoveDefTag) == 0x000000, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnStartMoveDefinitionInvoke::MoveDefTag' has a wrong offset!");

// Function EN0000_00_SecuritySoldier_Standard_3100-FOREA_AIBP.EN0000_00_SecuritySoldier_Standard_3100-FOREA_AIBP_C.OnExtraConditionInvoke
// 0x0008 (0x0008 - 0x0000)
struct EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnExtraConditionInvoke final
{
public:
	class FName                                   ConditionTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnExtraConditionInvoke) == 0x000004, "Wrong alignment on EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnExtraConditionInvoke");
static_assert(sizeof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnExtraConditionInvoke) == 0x000008, "Wrong size on EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnExtraConditionInvoke");
static_assert(offsetof(EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnExtraConditionInvoke, ConditionTag) == 0x000000, "Member 'EN0000_00_SecuritySoldier_Standard_3100_FOREA_AIBP_C_OnExtraConditionInvoke::ConditionTag' has a wrong offset!");

}

