#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EN2101_05_HereticRayleigh_SubspeciesEnd2

#include "Basic.hpp"

#include "EN2101_00_HereticRayleigh_Standard_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EN2101_05_HereticRayleigh_SubspeciesEnd2.EN2101_05_HereticRayleigh_SubspeciesEnd2_C
// 0x0090 (0x1680 - 0x15F0)
class AEN2101_05_HereticRayleigh_SubspeciesEnd2_C final : public AEN2101_00_HereticRayleigh_Standard_C
{
public:
	class UEndSwitchableSkeletalMeshComponent*    RTentacle;                                         // 0x15F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_TailEEnd;                                // 0x15F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_TailDEnd;                                // 0x1600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_TailCEnd;                                // 0x1608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_TailBEnd;                                // 0x1610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_TailAEnd;                                // 0x1618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_TailE;                                   // 0x1620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_TailD;                                   // 0x1628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_TailC;                                   // 0x1630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_TailB;                                   // 0x1638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_TailA;                                   // 0x1640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_Tail;                                    // 0x1648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_RHand;                                   // 0x1650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_LHand;                                   // 0x1658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_RArm;                                    // 0x1660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_LArm;                                    // 0x1668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_Body;                                    // 0x1670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             Collision_Head;                                    // 0x1678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EN2101_05_HereticRayleigh_SubspeciesEnd2_C">();
	}
	static class AEN2101_05_HereticRayleigh_SubspeciesEnd2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEN2101_05_HereticRayleigh_SubspeciesEnd2_C>();
	}
};
static_assert(alignof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C) == 0x000010, "Wrong alignment on AEN2101_05_HereticRayleigh_SubspeciesEnd2_C");
static_assert(sizeof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C) == 0x001680, "Wrong size on AEN2101_05_HereticRayleigh_SubspeciesEnd2_C");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, RTentacle) == 0x0015F0, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::RTentacle' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_TailEEnd) == 0x0015F8, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_TailEEnd' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_TailDEnd) == 0x001600, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_TailDEnd' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_TailCEnd) == 0x001608, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_TailCEnd' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_TailBEnd) == 0x001610, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_TailBEnd' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_TailAEnd) == 0x001618, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_TailAEnd' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_TailE) == 0x001620, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_TailE' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_TailD) == 0x001628, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_TailD' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_TailC) == 0x001630, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_TailC' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_TailB) == 0x001638, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_TailB' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_TailA) == 0x001640, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_TailA' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_Tail) == 0x001648, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_Tail' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_RHand) == 0x001650, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_RHand' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_LHand) == 0x001658, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_LHand' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_RArm) == 0x001660, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_RArm' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_LArm) == 0x001668, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_LArm' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_Body) == 0x001670, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_Body' has a wrong offset!");
static_assert(offsetof(AEN2101_05_HereticRayleigh_SubspeciesEnd2_C, Collision_Head) == 0x001678, "Member 'AEN2101_05_HereticRayleigh_SubspeciesEnd2_C::Collision_Head' has a wrong offset!");

}

