#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EN2211_01_Ogre_OrcEnd2_Animation

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass EN2211_01_Ogre_OrcEnd2_Animation.EN2211_01_Ogre_OrcEnd2_Animation_C
// 0x2E50 (0x45C0 - 0x1770)
class UEN2211_01_Ogre_OrcEnd2_Animation_C final : public UEndCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1770(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1778(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0x17A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0x17D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0x17F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0x1820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0x1848(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0x1870(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0x1898(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0x18C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0x18E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0x1910(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x1938(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x1960(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x1988(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x19B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x19D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x1A00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x1A28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x1A50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x1A78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x1AA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x1AC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x1AF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x1B18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x1B40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x1B68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x1B90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x1BB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x1BE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x1C08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x1C30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x1C58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x1C80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x1CA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x1CD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x1CF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x1D20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x1D48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x1D70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x1D98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x1DC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x1DE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x1E10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x1E38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x1E60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x1E88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x1EB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x1ED8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x1F00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x1F28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x1F50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x1F78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x1FA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x1FC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x1FF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x2018(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x2040(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x2068(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x2090(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x20B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x20E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x2108(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x2130(0x0028)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_15;      // 0x2158(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x2200(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x2230(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x2258(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x2280(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x22A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x22D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x22F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x2320(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x2348(0x0028)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_14;      // 0x2370(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x2418(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_13;      // 0x2448(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x24F0(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_12;      // 0x2520(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x25C8(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_11;      // 0x25F8(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x26A0(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x26D0(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x26E8(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_10;      // 0x2718(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x27C0(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_9;       // 0x27F0(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x2898(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_8;       // 0x28C8(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x2970(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_7;       // 0x29A0(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x2A48(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2A78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2AA0(0x0028)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_6;       // 0x2AC8(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x2B70(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_5;       // 0x2BA0(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x2C48(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_4;       // 0x2C78(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x2D20(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_3;       // 0x2D50(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x2DF8(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_2;       // 0x2E28(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x2ED0(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_1;       // 0x2F00(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2FA8(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer;         // 0x2FD8(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x3080(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x30B0(0x00B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x3160(0x0020)()
	struct FAnimNode_EndCharacterMovementExpression AnimGraphNode_EndCharacterMovementExpression;      // 0x3180(0x00F8)()
	struct FAnimNode_EndBehaviorAction            AnimGraphNode_EndBehaviorAction;                   // 0x3278(0x0028)()
	struct FAnimNode_EndInertialization           AnimGraphNode_EndInertialization;                  // 0x32A0(0x0090)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x3330(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x3378(0x0020)()
	uint8                                         Pad_3398[0x8];                                     // 0x3398(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_EndFacialSecondary           AnimGraphNode_EndFacialSecondary;                  // 0x33A0(0x03A0)()
	struct FAnimNode_EndFacialPrimary             AnimGraphNode_EndFacialPrimary;                    // 0x3740(0x0048)()
	uint8                                         Pad_3788[0x8];                                     // 0x3788(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_EndBodyDriver                AnimGraphNode_EndBodyDriver;                       // 0x3790(0x0A80)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x4210(0x0368)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x4578(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x4598(0x0020)()

public:
	void ExecuteUbergraph_EN2211_01_Ogre_OrcEnd2_Animation(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_EN2211_01_Ogre_OrcEnd2_Animation_AnimGraphNode_TransitionResult_2923203C494549061915CE9C8893950C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_EN2211_01_Ogre_OrcEnd2_Animation_AnimGraphNode_TransitionResult_C947B1924D7F73E13F2EB79395FC9684();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_EN2211_01_Ogre_OrcEnd2_Animation_AnimGraphNode_TransitionResult_80A7FD764C70FAB06E4159AAEEB07DDC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_EN2211_01_Ogre_OrcEnd2_Animation_AnimGraphNode_TransitionResult_939BE66741D64C6D290663BBAF04BFB6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_EN2211_01_Ogre_OrcEnd2_Animation_AnimGraphNode_TransitionResult_9EAE09A342619ABFFA9AD79C12B24903();
