#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EndDataObject

#include "Basic.hpp"

#include "EndDataObject_structs.hpp"


namespace SDK::Params
{

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetActionCategory
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetActionCategory final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetActionCategory) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetActionCategory");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetActionCategory) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetActionCategory");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetActionCategory, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetActionCategory::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetActionCategory, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetActionCategory::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAddAnimationEndBase
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBase final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         index0;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBase) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBase");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBase) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBase");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBase, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBase::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBase, index0) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBase::index0' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBase, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBase::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAddAnimationEndBaseSize
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBaseSize final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         dimension;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBaseSize) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBaseSize");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBaseSize) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBaseSize");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBaseSize, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBaseSize::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBaseSize, dimension) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBaseSize::dimension' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBaseSize, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationEndBaseSize::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAddAnimationIndex
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndex final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         index0;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndex) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndex");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndex) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndex");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndex, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndex::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndex, index0) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndex::index0' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndex, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndex::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAddAnimationIndexSize
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndexSize final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         dimension;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndexSize) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndexSize");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndexSize) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndexSize");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndexSize, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndexSize::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndexSize, dimension) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndexSize::dimension' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndexSize, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationIndexSize::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAddAnimationName
// 0x0030 (0x0030 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAddAnimationName final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         index0;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0024(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationName) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAddAnimationName");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationName) == 0x000030, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAddAnimationName");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationName, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationName::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationName, index0) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationName::index0' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationName, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationName::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAddAnimationNameSize
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAddAnimationNameSize final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         dimension;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationNameSize) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAddAnimationNameSize");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationNameSize) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAddAnimationNameSize");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationNameSize, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationNameSize::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationNameSize, dimension) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationNameSize::dimension' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationNameSize, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationNameSize::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAddAnimationPlayCount
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCount final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         index0;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCount) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCount");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCount) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCount");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCount, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCount::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCount, index0) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCount::index0' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCount, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCount::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAddAnimationPlayCountSize
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCountSize final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         dimension;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCountSize) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCountSize");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCountSize) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCountSize");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCountSize, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCountSize::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCountSize, dimension) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCountSize::dimension' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCountSize, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayCountSize::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAddAnimationPlayInterval
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayInterval final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         index0;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayInterval) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayInterval");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayInterval) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayInterval");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayInterval, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayInterval::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayInterval, index0) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayInterval::index0' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayInterval, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayInterval::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAddAnimationPlayIntervalSize
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayIntervalSize final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         dimension;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayIntervalSize) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayIntervalSize");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayIntervalSize) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayIntervalSize");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayIntervalSize, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayIntervalSize::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayIntervalSize, dimension) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayIntervalSize::dimension' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayIntervalSize, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAddAnimationPlayIntervalSize::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAfterTeleportRotationType
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAfterTeleportRotationType final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAfterTeleportRotationType) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAfterTeleportRotationType");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAfterTeleportRotationType) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAfterTeleportRotationType");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAfterTeleportRotationType, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAfterTeleportRotationType::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAfterTeleportRotationType, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAfterTeleportRotationType::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAfterWalkType
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAfterWalkType final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAfterWalkType) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAfterWalkType");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAfterWalkType) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAfterWalkType");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAfterWalkType, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAfterWalkType::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAfterWalkType, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAfterWalkType::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAnimationBoneFilterIndexBits0
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAnimationBoneFilterIndexBits0 final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAnimationBoneFilterIndexBits0) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAnimationBoneFilterIndexBits0");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAnimationBoneFilterIndexBits0) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAnimationBoneFilterIndexBits0");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationBoneFilterIndexBits0, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationBoneFilterIndexBits0::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationBoneFilterIndexBits0, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationBoneFilterIndexBits0::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAnimationParameter
// 0x0030 (0x0030 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAnimationParameter final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         index0;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         index1;                                            // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAnimationParameter) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAnimationParameter");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAnimationParameter) == 0x000030, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAnimationParameter");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationParameter, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationParameter::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationParameter, index0) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationParameter::index0' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationParameter, index1) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationParameter::index1' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationParameter, ReturnValue) == 0x000028, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationParameter::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAnimationParameterSize
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAnimationParameterSize final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         dimension;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAnimationParameterSize) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAnimationParameterSize");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAnimationParameterSize) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAnimationParameterSize");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationParameterSize, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationParameterSize::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationParameterSize, dimension) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationParameterSize::dimension' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationParameterSize, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationParameterSize::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAnimationSelectType
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAnimationSelectType final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         index0;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAnimationSelectType) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAnimationSelectType");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAnimationSelectType) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAnimationSelectType");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationSelectType, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationSelectType::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationSelectType, index0) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationSelectType::index0' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationSelectType, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationSelectType::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAnimationSelectTypeSize
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAnimationSelectTypeSize final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         dimension;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAnimationSelectTypeSize) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAnimationSelectTypeSize");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAnimationSelectTypeSize) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAnimationSelectTypeSize");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationSelectTypeSize, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationSelectTypeSize::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationSelectTypeSize, dimension) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationSelectTypeSize::dimension' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationSelectTypeSize, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationSelectTypeSize::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAnimationString
// 0x0030 (0x0030 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAnimationString final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         index0;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         index1;                                            // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAnimationString) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAnimationString");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAnimationString) == 0x000030, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAnimationString");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationString, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationString::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationString, index0) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationString::index0' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationString, index1) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationString::index1' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationString, ReturnValue) == 0x000028, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationString::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAnimationStringSize
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAnimationStringSize final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         dimension;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAnimationStringSize) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAnimationStringSize");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAnimationStringSize) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAnimationStringSize");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationStringSize, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationStringSize::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationStringSize, dimension) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationStringSize::dimension' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationStringSize, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationStringSize::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAnimationUpperBodyName
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAnimationUpperBodyName final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAnimationUpperBodyName) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAnimationUpperBodyName");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAnimationUpperBodyName) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAnimationUpperBodyName");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationUpperBodyName, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationUpperBodyName::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimationUpperBodyName, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimationUpperBodyName::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetAnimResourceReferenceBattleCharaSpecID
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetAnimResourceReferenceBattleCharaSpecID final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetAnimResourceReferenceBattleCharaSpecID) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetAnimResourceReferenceBattleCharaSpecID");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetAnimResourceReferenceBattleCharaSpecID) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetAnimResourceReferenceBattleCharaSpecID");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimResourceReferenceBattleCharaSpecID, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimResourceReferenceBattleCharaSpecID::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetAnimResourceReferenceBattleCharaSpecID, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetAnimResourceReferenceBattleCharaSpecID::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetATB
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetATB final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetATB) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetATB");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetATB) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetATB");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetATB, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetATB::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetATB, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetATB::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetCameraSequenceID
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetCameraSequenceID final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetCameraSequenceID) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetCameraSequenceID");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetCameraSequenceID) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetCameraSequenceID");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCameraSequenceID, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetCameraSequenceID::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCameraSequenceID, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetCameraSequenceID::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetCameraSequenceNotify
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetCameraSequenceNotify final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetCameraSequenceNotify) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetCameraSequenceNotify");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetCameraSequenceNotify) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetCameraSequenceNotify");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCameraSequenceNotify, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetCameraSequenceNotify::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCameraSequenceNotify, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetCameraSequenceNotify::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetCancelNumber
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetCancelNumber final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         index0;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetCancelNumber) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetCancelNumber");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetCancelNumber) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetCancelNumber");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCancelNumber, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetCancelNumber::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCancelNumber, index0) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetCancelNumber::index0' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCancelNumber, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetCancelNumber::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetCancelNumberSize
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetCancelNumberSize final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         dimension;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetCancelNumberSize) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetCancelNumberSize");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetCancelNumberSize) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetCancelNumberSize");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCancelNumberSize, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetCancelNumberSize::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCancelNumberSize, dimension) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetCancelNumberSize::dimension' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCancelNumberSize, ReturnValue) == 0x000024, "Member 'EndDataObjectBattleAbilityBlueprint_GetCancelNumberSize::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetCastMagicEffectType
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetCastMagicEffectType final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetCastMagicEffectType) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetCastMagicEffectType");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetCastMagicEffectType) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetCastMagicEffectType");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCastMagicEffectType, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetCastMagicEffectType::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCastMagicEffectType, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetCastMagicEffectType::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetCommandTargetType
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetCommandTargetType final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetCommandTargetType) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetCommandTargetType");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetCommandTargetType) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetCommandTargetType");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCommandTargetType, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetCommandTargetType::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCommandTargetType, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetCommandTargetType::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetCommandType
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetCommandType final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetCommandType) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetCommandType");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetCommandType) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetCommandType");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCommandType, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetCommandType::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetCommandType, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetCommandType::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetDamageCreateMoveCollisionObjectOff
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetDamageCreateMoveCollisionObjectOff final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetDamageCreateMoveCollisionObjectOff) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetDamageCreateMoveCollisionObjectOff");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetDamageCreateMoveCollisionObjectOff) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetDamageCreateMoveCollisionObjectOff");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetDamageCreateMoveCollisionObjectOff, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetDamageCreateMoveCollisionObjectOff::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetDamageCreateMoveCollisionObjectOff, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetDamageCreateMoveCollisionObjectOff::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetDistFeelType
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetDistFeelType final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetDistFeelType) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetDistFeelType");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetDistFeelType) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetDistFeelType");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetDistFeelType, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetDistFeelType::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetDistFeelType, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetDistFeelType::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetExplanation
// 0x0030 (0x0030 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetExplanation final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetExplanation) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetExplanation");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetExplanation) == 0x000030, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetExplanation");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetExplanation, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetExplanation::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetExplanation, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetExplanation::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetFlag0
// 0x0028 (0x0028 - 0x0000)
struct EndDataObjectBattleAbilityBlueprint_GetFlag0 final
{
public:
	struct FEndDataObjectBattleAbilityAccessor    Instance;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndDataObjectBattleAbilityBlueprint_GetFlag0) == 0x000008, "Wrong alignment on EndDataObjectBattleAbilityBlueprint_GetFlag0");
static_assert(sizeof(EndDataObjectBattleAbilityBlueprint_GetFlag0) == 0x000028, "Wrong size on EndDataObjectBattleAbilityBlueprint_GetFlag0");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetFlag0, Instance) == 0x000000, "Member 'EndDataObjectBattleAbilityBlueprint_GetFlag0::Instance' has a wrong offset!");
static_assert(offsetof(EndDataObjectBattleAbilityBlueprint_GetFlag0, ReturnValue) == 0x000020, "Member 'EndDataObjectBattleAbilityBlueprint_GetFlag0::ReturnValue' has a wrong offset!");

// Function EndDataObject.EndDataObjectBattleAbilityBlueprint.GetForceDamageDisplayToOne
