#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EndDataObject

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class EndDataObject.EndDataObjectBase
// 0x0010 (0x0058 - 0x0048)
class UEndDataObjectBase : public UMemoryMappedAsset
{
public:
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBase">();
	}
	static class UEndDataObjectBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBase>();
	}
};
static_assert(alignof(UEndDataObjectBase) == 0x000008, "Wrong alignment on UEndDataObjectBase");
static_assert(sizeof(UEndDataObjectBase) == 0x000058, "Wrong size on UEndDataObjectBase");

// Class EndDataObject.EndDataObjectQuestTask
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectQuestTask final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectQuestTask">();
	}
	static class UEndDataObjectQuestTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectQuestTask>();
	}
};
static_assert(alignof(UEndDataObjectQuestTask) == 0x000008, "Wrong alignment on UEndDataObjectQuestTask");
static_assert(sizeof(UEndDataObjectQuestTask) == 0x000068, "Wrong size on UEndDataObjectQuestTask");

// Class EndDataObject.EndDataObjectAction
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAction final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAction">();
	}
	static class UEndDataObjectAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAction>();
	}
};
static_assert(alignof(UEndDataObjectAction) == 0x000008, "Wrong alignment on UEndDataObjectAction");
static_assert(sizeof(UEndDataObjectAction) == 0x000068, "Wrong size on UEndDataObjectAction");

// Class EndDataObject.EndDataObjectResidentWork
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectResidentWork final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectResidentWork">();
	}
	static class UEndDataObjectResidentWork* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectResidentWork>();
	}
};
static_assert(alignof(UEndDataObjectResidentWork) == 0x000008, "Wrong alignment on UEndDataObjectResidentWork");
static_assert(sizeof(UEndDataObjectResidentWork) == 0x000068, "Wrong size on UEndDataObjectResidentWork");

// Class EndDataObject.EndDataObjectActionGroup
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectActionGroup final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectActionGroup">();
	}
	static class UEndDataObjectActionGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectActionGroup>();
	}
};
static_assert(alignof(UEndDataObjectActionGroup) == 0x000008, "Wrong alignment on UEndDataObjectActionGroup");
static_assert(sizeof(UEndDataObjectActionGroup) == 0x000068, "Wrong size on UEndDataObjectActionGroup");

// Class EndDataObject.EndDataObjectActionLimit
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectActionLimit final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectActionLimit">();
	}
	static class UEndDataObjectActionLimit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectActionLimit>();
	}
};
static_assert(alignof(UEndDataObjectActionLimit) == 0x000008, "Wrong alignment on UEndDataObjectActionLimit");
static_assert(sizeof(UEndDataObjectActionLimit) == 0x000068, "Wrong size on UEndDataObjectActionLimit");

// Class EndDataObject.EndDataObjectNaviMapClear
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectNaviMapClear final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectNaviMapClear">();
	}
	static class UEndDataObjectNaviMapClear* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectNaviMapClear>();
	}
};
static_assert(alignof(UEndDataObjectNaviMapClear) == 0x000008, "Wrong alignment on UEndDataObjectNaviMapClear");
static_assert(sizeof(UEndDataObjectNaviMapClear) == 0x000068, "Wrong size on UEndDataObjectNaviMapClear");

// Class EndDataObject.EndDataObjectActionTest
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectActionTest final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectActionTest">();
	}
	static class UEndDataObjectActionTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectActionTest>();
	}
};
static_assert(alignof(UEndDataObjectActionTest) == 0x000008, "Wrong alignment on UEndDataObjectActionTest");
static_assert(sizeof(UEndDataObjectActionTest) == 0x000068, "Wrong size on UEndDataObjectActionTest");

// Class EndDataObject.EndDataObjectActorGroup
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectActorGroup final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectActorGroup">();
	}
	static class UEndDataObjectActorGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectActorGroup>();
	}
};
static_assert(alignof(UEndDataObjectActorGroup) == 0x000008, "Wrong alignment on UEndDataObjectActorGroup");
static_assert(sizeof(UEndDataObjectActorGroup) == 0x000068, "Wrong size on UEndDataObjectActorGroup");

// Class EndDataObject.EndDataObjectShopList
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectShopList final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectShopList">();
	}
	static class UEndDataObjectShopList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectShopList>();
	}
};
static_assert(alignof(UEndDataObjectShopList) == 0x000008, "Wrong alignment on UEndDataObjectShopList");
static_assert(sizeof(UEndDataObjectShopList) == 0x000068, "Wrong size on UEndDataObjectShopList");

// Class EndDataObject.EndDataObjectAIParameter
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAIParameter final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAIParameter">();
	}
	static class UEndDataObjectAIParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAIParameter>();
	}
};
static_assert(alignof(UEndDataObjectAIParameter) == 0x000008, "Wrong alignment on UEndDataObjectAIParameter");
static_assert(sizeof(UEndDataObjectAIParameter) == 0x000068, "Wrong size on UEndDataObjectAIParameter");

// Class EndDataObject.EndDataObjectAIStateGroup
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAIStateGroup final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAIStateGroup">();
	}
	static class UEndDataObjectAIStateGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAIStateGroup>();
	}
};
static_assert(alignof(UEndDataObjectAIStateGroup) == 0x000008, "Wrong alignment on UEndDataObjectAIStateGroup");
static_assert(sizeof(UEndDataObjectAIStateGroup) == 0x000068, "Wrong size on UEndDataObjectAIStateGroup");

// Class EndDataObject.EndDataObjectObject
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectObject final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectObject">();
	}
	static class UEndDataObjectObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectObject>();
	}
};
static_assert(alignof(UEndDataObjectObject) == 0x000008, "Wrong alignment on UEndDataObjectObject");
static_assert(sizeof(UEndDataObjectObject) == 0x000068, "Wrong size on UEndDataObjectObject");

// Class EndDataObject.EndDataObjectAppContent
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAppContent final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAppContent">();
	}
	static class UEndDataObjectAppContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAppContent>();
	}
};
static_assert(alignof(UEndDataObjectAppContent) == 0x000008, "Wrong alignment on UEndDataObjectAppContent");
static_assert(sizeof(UEndDataObjectAppContent) == 0x000068, "Wrong size on UEndDataObjectAppContent");

// Class EndDataObject.EndDataObjectAreaReport
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAreaReport final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAreaReport">();
	}
	static class UEndDataObjectAreaReport* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAreaReport>();
	}
};
static_assert(alignof(UEndDataObjectAreaReport) == 0x000008, "Wrong alignment on UEndDataObjectAreaReport");
static_assert(sizeof(UEndDataObjectAreaReport) == 0x000068, "Wrong size on UEndDataObjectAreaReport");

// Class EndDataObject.EndDataObjectShakeCharaProperty
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectShakeCharaProperty final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectShakeCharaProperty">();
	}
	static class UEndDataObjectShakeCharaProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectShakeCharaProperty>();
	}
};
static_assert(alignof(UEndDataObjectShakeCharaProperty) == 0x000008, "Wrong alignment on UEndDataObjectShakeCharaProperty");
static_assert(sizeof(UEndDataObjectShakeCharaProperty) == 0x000068, "Wrong size on UEndDataObjectShakeCharaProperty");

// Class EndDataObject.EndDataObjectAssignStateChange
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAssignStateChange final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAssignStateChange">();
	}
	static class UEndDataObjectAssignStateChange* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAssignStateChange>();
	}
};
static_assert(alignof(UEndDataObjectAssignStateChange) == 0x000008, "Wrong alignment on UEndDataObjectAssignStateChange");
static_assert(sizeof(UEndDataObjectAssignStateChange) == 0x000068, "Wrong size on UEndDataObjectAssignStateChange");

// Class EndDataObject.EndDataObjectAutoAbilityParameter
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAutoAbilityParameter final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAutoAbilityParameter">();
	}
	static class UEndDataObjectAutoAbilityParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAutoAbilityParameter>();
	}
};
static_assert(alignof(UEndDataObjectAutoAbilityParameter) == 0x000008, "Wrong alignment on UEndDataObjectAutoAbilityParameter");
static_assert(sizeof(UEndDataObjectAutoAbilityParameter) == 0x000068, "Wrong size on UEndDataObjectAutoAbilityParameter");

// Class EndDataObject.EndDataObjectObjectEnemyTerritory
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectObjectEnemyTerritory final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectObjectEnemyTerritory">();
	}
	static class UEndDataObjectObjectEnemyTerritory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectObjectEnemyTerritory>();
	}
};
static_assert(alignof(UEndDataObjectObjectEnemyTerritory) == 0x000008, "Wrong alignment on UEndDataObjectObjectEnemyTerritory");
static_assert(sizeof(UEndDataObjectObjectEnemyTerritory) == 0x000068, "Wrong size on UEndDataObjectObjectEnemyTerritory");

// Class EndDataObject.EndDataObjectAutoCameraGroup
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAutoCameraGroup final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAutoCameraGroup">();
	}
	static class UEndDataObjectAutoCameraGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAutoCameraGroup>();
	}
};
static_assert(alignof(UEndDataObjectAutoCameraGroup) == 0x000008, "Wrong alignment on UEndDataObjectAutoCameraGroup");
static_assert(sizeof(UEndDataObjectAutoCameraGroup) == 0x000068, "Wrong size on UEndDataObjectAutoCameraGroup");

// Class EndDataObject.EndDataObjectAutoCameraImaginaryLineLogic
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAutoCameraImaginaryLineLogic final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAutoCameraImaginaryLineLogic">();
	}
	static class UEndDataObjectAutoCameraImaginaryLineLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAutoCameraImaginaryLineLogic>();
	}
};
static_assert(alignof(UEndDataObjectAutoCameraImaginaryLineLogic) == 0x000008, "Wrong alignment on UEndDataObjectAutoCameraImaginaryLineLogic");
static_assert(sizeof(UEndDataObjectAutoCameraImaginaryLineLogic) == 0x000068, "Wrong size on UEndDataObjectAutoCameraImaginaryLineLogic");

// Class EndDataObject.EndDataObjectSteeringGroup
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectSteeringGroup final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectSteeringGroup">();
	}
	static class UEndDataObjectSteeringGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectSteeringGroup>();
	}
};
static_assert(alignof(UEndDataObjectSteeringGroup) == 0x000008, "Wrong alignment on UEndDataObjectSteeringGroup");
static_assert(sizeof(UEndDataObjectSteeringGroup) == 0x000068, "Wrong size on UEndDataObjectSteeringGroup");

// Class EndDataObject.EndDataObjectAutoCameraLightGroup
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAutoCameraLightGroup final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAutoCameraLightGroup">();
	}
	static class UEndDataObjectAutoCameraLightGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAutoCameraLightGroup>();
	}
};
static_assert(alignof(UEndDataObjectAutoCameraLightGroup) == 0x000008, "Wrong alignment on UEndDataObjectAutoCameraLightGroup");
static_assert(sizeof(UEndDataObjectAutoCameraLightGroup) == 0x000068, "Wrong size on UEndDataObjectAutoCameraLightGroup");

// Class EndDataObject.EndDataObjectAutoCameraLightInfo
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAutoCameraLightInfo final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAutoCameraLightInfo">();
	}
	static class UEndDataObjectAutoCameraLightInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAutoCameraLightInfo>();
	}
};
static_assert(alignof(UEndDataObjectAutoCameraLightInfo) == 0x000008, "Wrong alignment on UEndDataObjectAutoCameraLightInfo");
static_assert(sizeof(UEndDataObjectAutoCameraLightInfo) == 0x000068, "Wrong size on UEndDataObjectAutoCameraLightInfo");

// Class EndDataObject.EndDataObjectObjectLayout
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectObjectLayout final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectObjectLayout">();
	}
	static class UEndDataObjectObjectLayout* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectObjectLayout>();
	}
};
static_assert(alignof(UEndDataObjectObjectLayout) == 0x000008, "Wrong alignment on UEndDataObjectObjectLayout");
static_assert(sizeof(UEndDataObjectObjectLayout) == 0x000068, "Wrong size on UEndDataObjectObjectLayout");

// Class EndDataObject.EndDataObjectAutoCameraPositionInfo
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAutoCameraPositionInfo final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAutoCameraPositionInfo">();
	}
	static class UEndDataObjectAutoCameraPositionInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAutoCameraPositionInfo>();
	}
};
static_assert(alignof(UEndDataObjectAutoCameraPositionInfo) == 0x000008, "Wrong alignment on UEndDataObjectAutoCameraPositionInfo");
static_assert(sizeof(UEndDataObjectAutoCameraPositionInfo) == 0x000068, "Wrong size on UEndDataObjectAutoCameraPositionInfo");

// Class EndDataObject.EndDataObjectAutoCameraPositionLogic
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAutoCameraPositionLogic final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAutoCameraPositionLogic">();
	}
	static class UEndDataObjectAutoCameraPositionLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAutoCameraPositionLogic>();
	}
};
static_assert(alignof(UEndDataObjectAutoCameraPositionLogic) == 0x000008, "Wrong alignment on UEndDataObjectAutoCameraPositionLogic");
static_assert(sizeof(UEndDataObjectAutoCameraPositionLogic) == 0x000068, "Wrong size on UEndDataObjectAutoCameraPositionLogic");

// Class EndDataObject.EndDataObjectShootingGameTargetParam
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectShootingGameTargetParam final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectShootingGameTargetParam">();
	}
	static class UEndDataObjectShootingGameTargetParam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectShootingGameTargetParam>();
	}
};
static_assert(alignof(UEndDataObjectShootingGameTargetParam) == 0x000008, "Wrong alignment on UEndDataObjectShootingGameTargetParam");
static_assert(sizeof(UEndDataObjectShootingGameTargetParam) == 0x000068, "Wrong size on UEndDataObjectShootingGameTargetParam");

// Class EndDataObject.EndDataObjectAutoCameraShotInfo
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAutoCameraShotInfo final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAutoCameraShotInfo">();
	}
	static class UEndDataObjectAutoCameraShotInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAutoCameraShotInfo>();
	}
};
static_assert(alignof(UEndDataObjectAutoCameraShotInfo) == 0x000008, "Wrong alignment on UEndDataObjectAutoCameraShotInfo");
static_assert(sizeof(UEndDataObjectAutoCameraShotInfo) == 0x000068, "Wrong size on UEndDataObjectAutoCameraShotInfo");

// Class EndDataObject.EndDataObjectAutoCameraShotLogic
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAutoCameraShotLogic final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAutoCameraShotLogic">();
	}
	static class UEndDataObjectAutoCameraShotLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAutoCameraShotLogic>();
	}
};
static_assert(alignof(UEndDataObjectAutoCameraShotLogic) == 0x000008, "Wrong alignment on UEndDataObjectAutoCameraShotLogic");
static_assert(sizeof(UEndDataObjectAutoCameraShotLogic) == 0x000068, "Wrong size on UEndDataObjectAutoCameraShotLogic");

// Class EndDataObject.EndDataObjectSceneChanger
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectSceneChanger final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectSceneChanger">();
	}
	static class UEndDataObjectSceneChanger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectSceneChanger>();
	}
};
static_assert(alignof(UEndDataObjectSceneChanger) == 0x000008, "Wrong alignment on UEndDataObjectSceneChanger");
static_assert(sizeof(UEndDataObjectSceneChanger) == 0x000068, "Wrong size on UEndDataObjectSceneChanger");

// Class EndDataObject.EndDataObjectAutoMagicGroup
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAutoMagicGroup final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAutoMagicGroup">();
	}
	static class UEndDataObjectAutoMagicGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAutoMagicGroup>();
	}
};
static_assert(alignof(UEndDataObjectAutoMagicGroup) == 0x000008, "Wrong alignment on UEndDataObjectAutoMagicGroup");
static_assert(sizeof(UEndDataObjectAutoMagicGroup) == 0x000068, "Wrong size on UEndDataObjectAutoMagicGroup");

// Class EndDataObject.EndDataObjectAutoWeaponAbility
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectAutoWeaponAbility final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectAutoWeaponAbility">();
	}
	static class UEndDataObjectAutoWeaponAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectAutoWeaponAbility>();
	}
};
static_assert(alignof(UEndDataObjectAutoWeaponAbility) == 0x000008, "Wrong alignment on UEndDataObjectAutoWeaponAbility");
static_assert(sizeof(UEndDataObjectAutoWeaponAbility) == 0x000068, "Wrong size on UEndDataObjectAutoWeaponAbility");

// Class EndDataObject.EndDataObjectSubStory
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectSubStory final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectSubStory">();
	}
	static class UEndDataObjectSubStory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectSubStory>();
	}
};
static_assert(alignof(UEndDataObjectSubStory) == 0x000008, "Wrong alignment on UEndDataObjectSubStory");
static_assert(sizeof(UEndDataObjectSubStory) == 0x000068, "Wrong size on UEndDataObjectSubStory");

// Class EndDataObject.EndDataObjectBattleAbility
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleAbility final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleAbility">();
	}
	static class UEndDataObjectBattleAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleAbility>();
	}
};
static_assert(alignof(UEndDataObjectBattleAbility) == 0x000008, "Wrong alignment on UEndDataObjectBattleAbility");
static_assert(sizeof(UEndDataObjectBattleAbility) == 0x000068, "Wrong size on UEndDataObjectBattleAbility");

// Class EndDataObject.EndDataObjectBattleAbilityBlueprint
// 0x0000 (0x0028 - 0x0028)
class UEndDataObjectBattleAbilityBlueprint final : public UBlueprintFunctionLibrary
{
public:
	static uint8 GetActionCategory(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetAddAnimationEndBase(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0);
	static int32 GetAddAnimationEndBaseSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static uint8 GetAddAnimationIndex(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0);
	static int32 GetAddAnimationIndexSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static class FName GetAddAnimationName(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0);
	static int32 GetAddAnimationNameSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static uint8 GetAddAnimationPlayCount(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0);
	static int32 GetAddAnimationPlayCountSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static float GetAddAnimationPlayInterval(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0);
	static int32 GetAddAnimationPlayIntervalSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static uint8 GetAfterTeleportRotationType(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetAfterWalkType(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetAnimationBoneFilterIndexBits0(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static float GetAnimationParameter(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0, int32 index1);
	static int32 GetAnimationParameterSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static uint8 GetAnimationSelectType(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0);
	static int32 GetAnimationSelectTypeSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static class FName GetAnimationString(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0, int32 index1);
	static int32 GetAnimationStringSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static class FName GetAnimationUpperBodyName(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static class FName GetAnimResourceReferenceBattleCharaSpecID(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static float GetATB(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static class FName GetCameraSequenceID(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetCameraSequenceNotify(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetCancelNumber(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0);
	static int32 GetCancelNumberSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static uint8 GetCastMagicEffectType(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetCommandTargetType(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetCommandType(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetDamageCreateMoveCollisionObjectOff(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetDistFeelType(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static class FString GetExplanation(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static int64 GetFlag0(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetForceDamageDisplayToOne(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static float GetInputBufferTime(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetKeepValue(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static int32 GetMP(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static class FString GetName(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static float GetRange(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetReactionCondition(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0);
	static uint8 GetReactionConditionNotifyIndex(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0);
	static int32 GetReactionConditionNotifyIndexSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static float GetReactionConditionParameterValue(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0, int32 index1);
	static int32 GetReactionConditionParameterValueSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static int32 GetReactionConditionSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static class FName GetReactionInfluenceID(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static class FName GetReactionParameterString(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0, int32 index1);
	static int32 GetReactionParameterStringSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static float GetReactionParameterValue(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0, int32 index1);
	static int32 GetReactionParameterValueSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static uint8 GetReactionType(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0);
	static int32 GetReactionTypeSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static class FString GetReplaceDamageSourceID(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static class FName GetResourceID(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0);
	static int32 GetResourceIDSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static class FName GetResourceName(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 index0);
	static int32 GetResourceNameSize(const struct FEndDataObjectBattleAbilityAccessor& Instance, int32 dimension);
	static float GetSameCharacterDamageHitDamageCoefficient(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static float GetSameCharacterDamageHitDamageCoefficientMin(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetShowName(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static float GetShowNameSecond(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetSkeletonControlType(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static int32 GetSortId(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetStrengthenNumber(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetTargetAimPosition(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetTargetCloseMove(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetTargetCorrectionDirectionImmediatelyType(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetTargetCount(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static float GetTeleportMinDistance(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static float GetTeleportParam(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetTeleportType(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static int32 GetUniqueID(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetUsePlace(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static uint8 GetUseSoundResourceCategory(const struct FEndDataObjectBattleAbilityAccessor& Instance);
	static class FName GetUseSoundResourceName(const struct FEndDataObjectBattleAbilityAccessor& Instance);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleAbilityBlueprint">();
	}
	static class UEndDataObjectBattleAbilityBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleAbilityBlueprint>();
	}
};
static_assert(alignof(UEndDataObjectBattleAbilityBlueprint) == 0x000008, "Wrong alignment on UEndDataObjectBattleAbilityBlueprint");
static_assert(sizeof(UEndDataObjectBattleAbilityBlueprint) == 0x000028, "Wrong size on UEndDataObjectBattleAbilityBlueprint");

// Class EndDataObject.EndDataObjectShootingCoasterEnemyGroupScoreData
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectShootingCoasterEnemyGroupScoreData final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectShootingCoasterEnemyGroupScoreData">();
	}
	static class UEndDataObjectShootingCoasterEnemyGroupScoreData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectShootingCoasterEnemyGroupScoreData>();
	}
};
static_assert(alignof(UEndDataObjectShootingCoasterEnemyGroupScoreData) == 0x000008, "Wrong alignment on UEndDataObjectShootingCoasterEnemyGroupScoreData");
static_assert(sizeof(UEndDataObjectShootingCoasterEnemyGroupScoreData) == 0x000068, "Wrong size on UEndDataObjectShootingCoasterEnemyGroupScoreData");

// Class EndDataObject.EndDataObjectBattleAbilityReactionInfluence
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleAbilityReactionInfluence final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleAbilityReactionInfluence">();
	}
	static class UEndDataObjectBattleAbilityReactionInfluence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleAbilityReactionInfluence>();
	}
};
static_assert(alignof(UEndDataObjectBattleAbilityReactionInfluence) == 0x000008, "Wrong alignment on UEndDataObjectBattleAbilityReactionInfluence");
static_assert(sizeof(UEndDataObjectBattleAbilityReactionInfluence) == 0x000068, "Wrong size on UEndDataObjectBattleAbilityReactionInfluence");

// Class EndDataObject.EndDataObjectBattleAbilityResource
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleAbilityResource final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleAbilityResource">();
	}
	static class UEndDataObjectBattleAbilityResource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleAbilityResource>();
	}
};
static_assert(alignof(UEndDataObjectBattleAbilityResource) == 0x000008, "Wrong alignment on UEndDataObjectBattleAbilityResource");
static_assert(sizeof(UEndDataObjectBattleAbilityResource) == 0x000068, "Wrong size on UEndDataObjectBattleAbilityResource");

// Class EndDataObject.EndDataObjectStateAttribute
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectStateAttribute final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectStateAttribute">();
	}
	static class UEndDataObjectStateAttribute* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectStateAttribute>();
	}
};
static_assert(alignof(UEndDataObjectStateAttribute) == 0x000008, "Wrong alignment on UEndDataObjectStateAttribute");
static_assert(sizeof(UEndDataObjectStateAttribute) == 0x000068, "Wrong size on UEndDataObjectStateAttribute");

// Class EndDataObject.EndDataObjectBattleBreak
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleBreak final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleBreak">();
	}
	static class UEndDataObjectBattleBreak* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleBreak>();
	}
};
static_assert(alignof(UEndDataObjectBattleBreak) == 0x000008, "Wrong alignment on UEndDataObjectBattleBreak");
static_assert(sizeof(UEndDataObjectBattleBreak) == 0x000068, "Wrong size on UEndDataObjectBattleBreak");

// Class EndDataObject.EndDataObjectBattleBreakable
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleBreakable final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleBreakable">();
	}
	static class UEndDataObjectBattleBreakable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleBreakable>();
	}
};
static_assert(alignof(UEndDataObjectBattleBreakable) == 0x000008, "Wrong alignment on UEndDataObjectBattleBreakable");
static_assert(sizeof(UEndDataObjectBattleBreakable) == 0x000068, "Wrong size on UEndDataObjectBattleBreakable");

// Class EndDataObject.EndDataObjectShootingCoasterNormalEnemyData
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectShootingCoasterNormalEnemyData final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectShootingCoasterNormalEnemyData">();
	}
	static class UEndDataObjectShootingCoasterNormalEnemyData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectShootingCoasterNormalEnemyData>();
	}
};
static_assert(alignof(UEndDataObjectShootingCoasterNormalEnemyData) == 0x000008, "Wrong alignment on UEndDataObjectShootingCoasterNormalEnemyData");
static_assert(sizeof(UEndDataObjectShootingCoasterNormalEnemyData) == 0x000068, "Wrong size on UEndDataObjectShootingCoasterNormalEnemyData");

// Class EndDataObject.EndDataObjectBattleCaitSithSlotReel
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleCaitSithSlotReel final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleCaitSithSlotReel">();
	}
	static class UEndDataObjectBattleCaitSithSlotReel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleCaitSithSlotReel>();
	}
};
static_assert(alignof(UEndDataObjectBattleCaitSithSlotReel) == 0x000008, "Wrong alignment on UEndDataObjectBattleCaitSithSlotReel");
static_assert(sizeof(UEndDataObjectBattleCaitSithSlotReel) == 0x000068, "Wrong size on UEndDataObjectBattleCaitSithSlotReel");

// Class EndDataObject.EndDataObjectBattleCameraSequence
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleCameraSequence final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleCameraSequence">();
	}
	static class UEndDataObjectBattleCameraSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleCameraSequence>();
	}
};
static_assert(alignof(UEndDataObjectBattleCameraSequence) == 0x000008, "Wrong alignment on UEndDataObjectBattleCameraSequence");
static_assert(sizeof(UEndDataObjectBattleCameraSequence) == 0x000068, "Wrong size on UEndDataObjectBattleCameraSequence");

// Class EndDataObject.EndDataObjectPointWarpObject
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectPointWarpObject final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectPointWarpObject">();
	}
	static class UEndDataObjectPointWarpObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectPointWarpObject>();
	}
};
static_assert(alignof(UEndDataObjectPointWarpObject) == 0x000008, "Wrong alignment on UEndDataObjectPointWarpObject");
static_assert(sizeof(UEndDataObjectPointWarpObject) == 0x000068, "Wrong size on UEndDataObjectPointWarpObject");

// Class EndDataObject.EndDataObjectBattleCharaAttach
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleCharaAttach final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleCharaAttach">();
	}
	static class UEndDataObjectBattleCharaAttach* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleCharaAttach>();
	}
};
static_assert(alignof(UEndDataObjectBattleCharaAttach) == 0x000008, "Wrong alignment on UEndDataObjectBattleCharaAttach");
static_assert(sizeof(UEndDataObjectBattleCharaAttach) == 0x000068, "Wrong size on UEndDataObjectBattleCharaAttach");

// Class EndDataObject.EndDataObjectBattleCharaCameraModuleID
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleCharaCameraModuleID final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleCharaCameraModuleID">();
	}
	static class UEndDataObjectBattleCharaCameraModuleID* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleCharaCameraModuleID>();
	}
};
static_assert(alignof(UEndDataObjectBattleCharaCameraModuleID) == 0x000008, "Wrong alignment on UEndDataObjectBattleCharaCameraModuleID");
static_assert(sizeof(UEndDataObjectBattleCharaCameraModuleID) == 0x000068, "Wrong size on UEndDataObjectBattleCharaCameraModuleID");

// Class EndDataObject.EndDataObjectShopLayoutData
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectShopLayoutData final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectShopLayoutData">();
	}
	static class UEndDataObjectShopLayoutData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectShopLayoutData>();
	}
};
static_assert(alignof(UEndDataObjectShopLayoutData) == 0x000008, "Wrong alignment on UEndDataObjectShopLayoutData");
static_assert(sizeof(UEndDataObjectShopLayoutData) == 0x000068, "Wrong size on UEndDataObjectShopLayoutData");

// Class EndDataObject.EndDataObjectBattleCharaCategory
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleCharaCategory final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleCharaCategory">();
	}
	static class UEndDataObjectBattleCharaCategory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleCharaCategory>();
	}
};
static_assert(alignof(UEndDataObjectBattleCharaCategory) == 0x000008, "Wrong alignment on UEndDataObjectBattleCharaCategory");
static_assert(sizeof(UEndDataObjectBattleCharaCategory) == 0x000068, "Wrong size on UEndDataObjectBattleCharaCategory");

// Class EndDataObject.EndDataObjectBattleCharaLevel
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleCharaLevel final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleCharaLevel">();
	}
	static class UEndDataObjectBattleCharaLevel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleCharaLevel>();
	}
};
static_assert(alignof(UEndDataObjectBattleCharaLevel) == 0x000008, "Wrong alignment on UEndDataObjectBattleCharaLevel");
static_assert(sizeof(UEndDataObjectBattleCharaLevel) == 0x000068, "Wrong size on UEndDataObjectBattleCharaLevel");

// Class EndDataObject.EndDataObjectStoryFlag
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectStoryFlag final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectStoryFlag">();
	}
	static class UEndDataObjectStoryFlag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectStoryFlag>();
	}
};
static_assert(alignof(UEndDataObjectStoryFlag) == 0x000008, "Wrong alignment on UEndDataObjectStoryFlag");
static_assert(sizeof(UEndDataObjectStoryFlag) == 0x000068, "Wrong size on UEndDataObjectStoryFlag");

// Class EndDataObject.EndDataObjectBattleCharaPartsSpec
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleCharaPartsSpec final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleCharaPartsSpec">();
	}
	static class UEndDataObjectBattleCharaPartsSpec* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleCharaPartsSpec>();
	}
};
static_assert(alignof(UEndDataObjectBattleCharaPartsSpec) == 0x000008, "Wrong alignment on UEndDataObjectBattleCharaPartsSpec");
static_assert(sizeof(UEndDataObjectBattleCharaPartsSpec) == 0x000068, "Wrong size on UEndDataObjectBattleCharaPartsSpec");

// Class EndDataObject.EndDataObjectColosseumFadeParameter
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectColosseumFadeParameter final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectColosseumFadeParameter">();
	}
	static class UEndDataObjectColosseumFadeParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectColosseumFadeParameter>();
	}
};
static_assert(alignof(UEndDataObjectColosseumFadeParameter) == 0x000008, "Wrong alignment on UEndDataObjectColosseumFadeParameter");
static_assert(sizeof(UEndDataObjectColosseumFadeParameter) == 0x000068, "Wrong size on UEndDataObjectColosseumFadeParameter");

// Class EndDataObject.EndDataObjectBattleCharaSpec
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleCharaSpec final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleCharaSpec">();
	}
	static class UEndDataObjectBattleCharaSpec* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleCharaSpec>();
	}
};
static_assert(alignof(UEndDataObjectBattleCharaSpec) == 0x000008, "Wrong alignment on UEndDataObjectBattleCharaSpec");
static_assert(sizeof(UEndDataObjectBattleCharaSpec) == 0x000068, "Wrong size on UEndDataObjectBattleCharaSpec");

// Class EndDataObject.EndDataObjectBattleCombinationAbility
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleCombinationAbility final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleCombinationAbility">();
	}
	static class UEndDataObjectBattleCombinationAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleCombinationAbility>();
	}
};
static_assert(alignof(UEndDataObjectBattleCombinationAbility) == 0x000008, "Wrong alignment on UEndDataObjectBattleCombinationAbility");
static_assert(sizeof(UEndDataObjectBattleCombinationAbility) == 0x000068, "Wrong size on UEndDataObjectBattleCombinationAbility");

// Class EndDataObject.EndDataObjectChocoboRaceRivalRunSetting
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectChocoboRaceRivalRunSetting final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectChocoboRaceRivalRunSetting">();
	}
	static class UEndDataObjectChocoboRaceRivalRunSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectChocoboRaceRivalRunSetting>();
	}
};
static_assert(alignof(UEndDataObjectChocoboRaceRivalRunSetting) == 0x000008, "Wrong alignment on UEndDataObjectChocoboRaceRivalRunSetting");
static_assert(sizeof(UEndDataObjectChocoboRaceRivalRunSetting) == 0x000068, "Wrong size on UEndDataObjectChocoboRaceRivalRunSetting");

// Class EndDataObject.EndDataObjectBattleCombinationTable
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleCombinationTable final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleCombinationTable">();
	}
	static class UEndDataObjectBattleCombinationTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleCombinationTable>();
	}
};
static_assert(alignof(UEndDataObjectBattleCombinationTable) == 0x000008, "Wrong alignment on UEndDataObjectBattleCombinationTable");
static_assert(sizeof(UEndDataObjectBattleCombinationTable) == 0x000068, "Wrong size on UEndDataObjectBattleCombinationTable");

// Class EndDataObject.EndDataObjectBattleConditionTrigger
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleConditionTrigger final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleConditionTrigger">();
	}
	static class UEndDataObjectBattleConditionTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleConditionTrigger>();
	}
};
static_assert(alignof(UEndDataObjectBattleConditionTrigger) == 0x000008, "Wrong alignment on UEndDataObjectBattleConditionTrigger");
static_assert(sizeof(UEndDataObjectBattleConditionTrigger) == 0x000068, "Wrong size on UEndDataObjectBattleConditionTrigger");

// Class EndDataObject.EndDataObjectCommonSaveDataConfig
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectCommonSaveDataConfig final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectCommonSaveDataConfig">();
	}
	static class UEndDataObjectCommonSaveDataConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectCommonSaveDataConfig>();
	}
};
static_assert(alignof(UEndDataObjectCommonSaveDataConfig) == 0x000008, "Wrong alignment on UEndDataObjectCommonSaveDataConfig");
static_assert(sizeof(UEndDataObjectCommonSaveDataConfig) == 0x000068, "Wrong size on UEndDataObjectCommonSaveDataConfig");

// Class EndDataObject.EndDataObjectBattleConditionTriggerEasyCondition
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleConditionTriggerEasyCondition final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleConditionTriggerEasyCondition">();
	}
	static class UEndDataObjectBattleConditionTriggerEasyCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleConditionTriggerEasyCondition>();
	}
};
static_assert(alignof(UEndDataObjectBattleConditionTriggerEasyCondition) == 0x000008, "Wrong alignment on UEndDataObjectBattleConditionTriggerEasyCondition");
static_assert(sizeof(UEndDataObjectBattleConditionTriggerEasyCondition) == 0x000068, "Wrong size on UEndDataObjectBattleConditionTriggerEasyCondition");

// Class EndDataObject.EndDataObjectBattleConditionTriggerGroup
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectBattleConditionTriggerGroup final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectBattleConditionTriggerGroup">();
	}
	static class UEndDataObjectBattleConditionTriggerGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectBattleConditionTriggerGroup>();
	}
};
static_assert(alignof(UEndDataObjectBattleConditionTriggerGroup) == 0x000008, "Wrong alignment on UEndDataObjectBattleConditionTriggerGroup");
static_assert(sizeof(UEndDataObjectBattleConditionTriggerGroup) == 0x000068, "Wrong size on UEndDataObjectBattleConditionTriggerGroup");

// Class EndDataObject.EndDataObjectEnemyParameter
// 0x0010 (0x0068 - 0x0058)
class UEndDataObjectEnemyParameter final : public UEndDataObjectBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndDataObjectEnemyParameter">();
	}
	static class UEndDataObjectEnemyParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndDataObjectEnemyParameter>();
	}
};
static_assert(alignof(UEndDataObjectEnemyParameter) == 0x000008, "Wrong alignment on UEndDataObjectEnemyParameter");
static_assert(sizeof(UEndDataObjectEnemyParameter) == 0x000068, "Wrong size on UEndDataObjectEnemyParameter");

// Class EndDataObject.EndDataObjectBattleDamageReaction
