#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EndTextResource

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class EndTextResource.EndTextResource
// 0x0060 (0x0088 - 0x0028)
class UEndTextResource final : public UObject
{
public:
	class FString                                 Language;                                          // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString GetText(const class FString& InTextId) const;
	struct FEndTextResourceInfo GetTextInfo(const class FString& InTextId) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndTextResource">();
	}
	static class UEndTextResource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndTextResource>();
	}
};
static_assert(alignof(UEndTextResource) == 0x000008, "Wrong alignment on UEndTextResource");
static_assert(sizeof(UEndTextResource) == 0x000088, "Wrong size on UEndTextResource");
static_assert(offsetof(UEndTextResource, Language) == 0x000028, "Member 'UEndTextResource::Language' has a wrong offset!");

// Class EndTextResource.EndTextResourceAPI
// 0x0000 (0x0028 - 0x0028)
class UEndTextResourceAPI final : public UObject
{
public:
	static struct FEndTextResourceInfo GetTextResourceInfo(const class FString& InTextId, const class FString& InLanguage);
	static class FString GetTextResourceText(const class FString& InTextId, const class FString& InLanguage);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndTextResourceAPI">();
	}
	static class UEndTextResourceAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndTextResourceAPI>();
	}
};
static_assert(alignof(UEndTextResourceAPI) == 0x000008, "Wrong alignment on UEndTextResourceAPI");
static_assert(sizeof(UEndTextResourceAPI) == 0x000028, "Wrong size on UEndTextResourceAPI");

}

