#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnemyStatus

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EnemyStatus.EnemyStatus_C
// 0x01C0 (0x05B8 - 0x03F8)
class UEnemyStatus_C final : public UEndEnemyStatusIcon
{
public:
	class UWidgetAnimation*                       BPHead_Decrease;                                   // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BPHead_Loop;                                       // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BPRegen_In;                                        // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BurstReset_75;                                     // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BurstReset_50;                                     // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BurstReset_25;                                     // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BurstReset;                                        // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Phase;                                             // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BurstDown_Out;                                     // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BurstDown_In;                                      // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BurstDown_Loop;                                    // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DamageShake;                                       // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_EnemyStatus;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommandLinkage_C*                      CommandLinkage;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndGauge*                              Gauge_Down;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndGauge*                              Gauge_HP_Boss;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndGauge*                              Gauge_HP_New;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_NG;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_00;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_01;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_02;                                    // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_03;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_04;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_05;                                    // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BurstRest_00;                                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Down_Effect_00;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Down_Effect_01;                                // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_DownGauge_Base;                                // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_DownGauge_Effect_00;                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_DownGaugeCover;                                // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_06;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_06_25;                                  // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_06_50;                                  // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Effect_Particle;                               // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Effect_Particle_25;                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_FrameEffect_00;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_GaugeHead_00;                                  // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_GaugeHead_01;                                  // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_GaugeHead_02;                                  // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_GaugeHead_03;                                  // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_HPGauge_Base;                                  // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_HPGaugeBoss_Base;                              // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_HPGaugeCover;                                  // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_NameBase;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Effect_00;                                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Particle_00;                                       // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Particle_01;                                       // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Particle_02;                                       // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Particle_03;                                       // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Particle_04;                                       // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Particle_05;                                       // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Particle_06;                                       // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEnemyPartsIcon_C*                      PartsIcon;                                         // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_EnemyStatus;                                   // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_Icon_Status;                                   // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EnemyStatus_C">();
	}
	static class UEnemyStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnemyStatus_C>();
	}
};
static_assert(alignof(UEnemyStatus_C) == 0x000008, "Wrong alignment on UEnemyStatus_C");
static_assert(sizeof(UEnemyStatus_C) == 0x0005B8, "Wrong size on UEnemyStatus_C");
static_assert(offsetof(UEnemyStatus_C, BPHead_Decrease) == 0x0003F8, "Member 'UEnemyStatus_C::BPHead_Decrease' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, BPHead_Loop) == 0x000400, "Member 'UEnemyStatus_C::BPHead_Loop' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, BPRegen_In) == 0x000408, "Member 'UEnemyStatus_C::BPRegen_In' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, BurstReset_75) == 0x000410, "Member 'UEnemyStatus_C::BurstReset_75' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, BurstReset_50) == 0x000418, "Member 'UEnemyStatus_C::BurstReset_50' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, BurstReset_25) == 0x000420, "Member 'UEnemyStatus_C::BurstReset_25' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, BurstReset) == 0x000428, "Member 'UEnemyStatus_C::BurstReset' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Phase) == 0x000430, "Member 'UEnemyStatus_C::Phase' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, BurstDown_Out) == 0x000438, "Member 'UEnemyStatus_C::BurstDown_Out' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, BurstDown_In) == 0x000440, "Member 'UEnemyStatus_C::BurstDown_In' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, BurstDown_Loop) == 0x000448, "Member 'UEnemyStatus_C::BurstDown_Loop' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, DamageShake) == 0x000450, "Member 'UEnemyStatus_C::DamageShake' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, All_EnemyStatus) == 0x000458, "Member 'UEnemyStatus_C::All_EnemyStatus' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, CommandLinkage) == 0x000460, "Member 'UEnemyStatus_C::CommandLinkage' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Gauge_Down) == 0x000468, "Member 'UEnemyStatus_C::Gauge_Down' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Gauge_HP_Boss) == 0x000470, "Member 'UEnemyStatus_C::Gauge_HP_Boss' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Gauge_HP_New) == 0x000478, "Member 'UEnemyStatus_C::Gauge_HP_New' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Icon_NG) == 0x000480, "Member 'UEnemyStatus_C::Icon_NG' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Icon_Status_00) == 0x000488, "Member 'UEnemyStatus_C::Icon_Status_00' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Icon_Status_01) == 0x000490, "Member 'UEnemyStatus_C::Icon_Status_01' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Icon_Status_02) == 0x000498, "Member 'UEnemyStatus_C::Icon_Status_02' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Icon_Status_03) == 0x0004A0, "Member 'UEnemyStatus_C::Icon_Status_03' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Icon_Status_04) == 0x0004A8, "Member 'UEnemyStatus_C::Icon_Status_04' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Icon_Status_05) == 0x0004B0, "Member 'UEnemyStatus_C::Icon_Status_05' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_BurstRest_00) == 0x0004B8, "Member 'UEnemyStatus_C::Img_BurstRest_00' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_Down_Effect_00) == 0x0004C0, "Member 'UEnemyStatus_C::Img_Down_Effect_00' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_Down_Effect_01) == 0x0004C8, "Member 'UEnemyStatus_C::Img_Down_Effect_01' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_DownGauge_Base) == 0x0004D0, "Member 'UEnemyStatus_C::Img_DownGauge_Base' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_DownGauge_Effect_00) == 0x0004D8, "Member 'UEnemyStatus_C::Img_DownGauge_Effect_00' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_DownGaugeCover) == 0x0004E0, "Member 'UEnemyStatus_C::Img_DownGaugeCover' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_Effect_00) == 0x0004E8, "Member 'UEnemyStatus_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_Effect_06) == 0x0004F0, "Member 'UEnemyStatus_C::Img_Effect_06' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_Effect_06_25) == 0x0004F8, "Member 'UEnemyStatus_C::Img_Effect_06_25' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_Effect_06_50) == 0x000500, "Member 'UEnemyStatus_C::Img_Effect_06_50' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_Effect_Particle) == 0x000508, "Member 'UEnemyStatus_C::Img_Effect_Particle' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_Effect_Particle_25) == 0x000510, "Member 'UEnemyStatus_C::Img_Effect_Particle_25' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_FrameEffect_00) == 0x000518, "Member 'UEnemyStatus_C::Img_FrameEffect_00' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_GaugeHead_00) == 0x000520, "Member 'UEnemyStatus_C::Img_GaugeHead_00' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_GaugeHead_01) == 0x000528, "Member 'UEnemyStatus_C::Img_GaugeHead_01' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_GaugeHead_02) == 0x000530, "Member 'UEnemyStatus_C::Img_GaugeHead_02' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_GaugeHead_03) == 0x000538, "Member 'UEnemyStatus_C::Img_GaugeHead_03' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_HPGauge_Base) == 0x000540, "Member 'UEnemyStatus_C::Img_HPGauge_Base' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_HPGaugeBoss_Base) == 0x000548, "Member 'UEnemyStatus_C::Img_HPGaugeBoss_Base' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_HPGaugeCover) == 0x000550, "Member 'UEnemyStatus_C::Img_HPGaugeCover' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Img_NameBase) == 0x000558, "Member 'UEnemyStatus_C::Img_NameBase' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Ims_Effect_00) == 0x000560, "Member 'UEnemyStatus_C::Ims_Effect_00' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Particle_00) == 0x000568, "Member 'UEnemyStatus_C::Particle_00' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Particle_01) == 0x000570, "Member 'UEnemyStatus_C::Particle_01' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Particle_02) == 0x000578, "Member 'UEnemyStatus_C::Particle_02' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Particle_03) == 0x000580, "Member 'UEnemyStatus_C::Particle_03' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Particle_04) == 0x000588, "Member 'UEnemyStatus_C::Particle_04' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Particle_05) == 0x000590, "Member 'UEnemyStatus_C::Particle_05' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Particle_06) == 0x000598, "Member 'UEnemyStatus_C::Particle_06' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, PartsIcon) == 0x0005A0, "Member 'UEnemyStatus_C::PartsIcon' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Pnl_EnemyStatus) == 0x0005A8, "Member 'UEnemyStatus_C::Pnl_EnemyStatus' has a wrong offset!");
static_assert(offsetof(UEnemyStatus_C, Pnl_Icon_Status) == 0x0005B0, "Member 'UEnemyStatus_C::Pnl_Icon_Status' has a wrong offset!");

}

