#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipStatus

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EquipStatus.EquipStatus_C
// 0x0038 (0x0448 - 0x0410)
class UEquipStatus_C final : public UEndEquipStatus
{
public:
	class UEndImage*                              Bg;                                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_1;                                              // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_107;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_1;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_2;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_StatusValue;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EquipStatus_C">();
	}
	static class UEquipStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquipStatus_C>();
	}
};
static_assert(alignof(UEquipStatus_C) == 0x000008, "Wrong alignment on UEquipStatus_C");
static_assert(sizeof(UEquipStatus_C) == 0x000448, "Wrong size on UEquipStatus_C");
static_assert(offsetof(UEquipStatus_C, Bg) == 0x000410, "Member 'UEquipStatus_C::Bg' has a wrong offset!");
static_assert(offsetof(UEquipStatus_C, Bg_1) == 0x000418, "Member 'UEquipStatus_C::Bg_1' has a wrong offset!");
static_assert(offsetof(UEquipStatus_C, EndImage) == 0x000420, "Member 'UEquipStatus_C::EndImage' has a wrong offset!");
static_assert(offsetof(UEquipStatus_C, EndImage_107) == 0x000428, "Member 'UEquipStatus_C::EndImage_107' has a wrong offset!");
static_assert(offsetof(UEquipStatus_C, ListPoint_1) == 0x000430, "Member 'UEquipStatus_C::ListPoint_1' has a wrong offset!");
static_assert(offsetof(UEquipStatus_C, ListPoint_2) == 0x000438, "Member 'UEquipStatus_C::ListPoint_2' has a wrong offset!");
static_assert(offsetof(UEquipStatus_C, Pnl_StatusValue) == 0x000440, "Member 'UEquipStatus_C::Pnl_StatusValue' has a wrong offset!");

}

