#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipInfoDetail_Core

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EquipInfoDetail_Core.EquipInfoDetail_Core_C
// 0x0060 (0x0438 - 0x03D8)
class UEquipInfoDetail_Core_C final : public UEndEquipInfoDetailCore
{
public:
	class UEndImage*                              EndImage_58;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_79;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_170;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_InfoWindowBg_C*               InfoWindowBg;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_1;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_3;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_4;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_5;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_6;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_7;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_8;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EquipInfoDetail_Core_C">();
	}
	static class UEquipInfoDetail_Core_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquipInfoDetail_Core_C>();
	}
};
static_assert(alignof(UEquipInfoDetail_Core_C) == 0x000008, "Wrong alignment on UEquipInfoDetail_Core_C");
static_assert(sizeof(UEquipInfoDetail_Core_C) == 0x000438, "Wrong size on UEquipInfoDetail_Core_C");
static_assert(offsetof(UEquipInfoDetail_Core_C, EndImage_58) == 0x0003D8, "Member 'UEquipInfoDetail_Core_C::EndImage_58' has a wrong offset!");
static_assert(offsetof(UEquipInfoDetail_Core_C, EndImage_79) == 0x0003E0, "Member 'UEquipInfoDetail_Core_C::EndImage_79' has a wrong offset!");
static_assert(offsetof(UEquipInfoDetail_Core_C, EndImage_170) == 0x0003E8, "Member 'UEquipInfoDetail_Core_C::EndImage_170' has a wrong offset!");
static_assert(offsetof(UEquipInfoDetail_Core_C, InfoWindowBg) == 0x0003F0, "Member 'UEquipInfoDetail_Core_C::InfoWindowBg' has a wrong offset!");
static_assert(offsetof(UEquipInfoDetail_Core_C, Line_1) == 0x0003F8, "Member 'UEquipInfoDetail_Core_C::Line_1' has a wrong offset!");
static_assert(offsetof(UEquipInfoDetail_Core_C, ListPoint_3) == 0x000400, "Member 'UEquipInfoDetail_Core_C::ListPoint_3' has a wrong offset!");
static_assert(offsetof(UEquipInfoDetail_Core_C, ListPoint_4) == 0x000408, "Member 'UEquipInfoDetail_Core_C::ListPoint_4' has a wrong offset!");
static_assert(offsetof(UEquipInfoDetail_Core_C, ListPoint_5) == 0x000410, "Member 'UEquipInfoDetail_Core_C::ListPoint_5' has a wrong offset!");
static_assert(offsetof(UEquipInfoDetail_Core_C, ListPoint_6) == 0x000418, "Member 'UEquipInfoDetail_Core_C::ListPoint_6' has a wrong offset!");
static_assert(offsetof(UEquipInfoDetail_Core_C, ListPoint_7) == 0x000420, "Member 'UEquipInfoDetail_Core_C::ListPoint_7' has a wrong offset!");
static_assert(offsetof(UEquipInfoDetail_Core_C, ListPoint_8) == 0x000428, "Member 'UEquipInfoDetail_Core_C::ListPoint_8' has a wrong offset!");
static_assert(offsetof(UEquipInfoDetail_Core_C, Txt_Title) == 0x000430, "Member 'UEquipInfoDetail_Core_C::Txt_Title' has a wrong offset!");

}

