#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Equip

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Equip.Equip_C
// 0x0108 (0x2218 - 0x2110)
class UEquip_C final : public UEndEquipWindow
{
public:
	class UWidgetAnimation*                       AutoSettingList_In;                                // 0x2110(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EquipInfoDetail_Core_In;                           // 0x2118(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MateriaSelect_In;                                  // 0x2120(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ArmorSelect_In;                                    // 0x2128(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AccessorySelect_In;                                // 0x2130(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Sort_In;                                           // 0x2138(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MateriaSelectList_In;                              // 0x2140(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WeaponSelect_In;                                   // 0x2148(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CategoryMenu_In;                                   // 0x2150(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x2158(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x2160(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_MateriaList;                                    // 0x2168(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase1;                                          // 0x2170(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            CategoryTitle_Member_Bg;                           // 0x2178(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_1;                                            // 0x2180(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_2;                                            // 0x2188(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_3;                                            // 0x2190(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_4;                                            // 0x2198(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_5;                                            // 0x21A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_6;                                            // 0x21A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_7;                                            // 0x21B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_8;                                            // 0x21B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_9;                                            // 0x21C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_10;                                           // 0x21C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1;                                             // 0x21D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2;                                             // 0x21D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListTitle_C*                           ListTitle_Category;                                // 0x21E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListTitle_C*                           ListTitle_MateriaList;                             // 0x21E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListTitle_C*                           ListTitle_Status;                                  // 0x21F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateriaSet_All_C*                      MateriaSet_All;                                    // 0x21F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgLeft_C*              System_BgLeft;                                     // 0x2200(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_AutoSetting;                                   // 0x2208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ListTitle_Status;                              // 0x2210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Equip_C">();
	}
	static class UEquip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquip_C>();
	}
};
static_assert(alignof(UEquip_C) == 0x000008, "Wrong alignment on UEquip_C");
static_assert(sizeof(UEquip_C) == 0x002218, "Wrong size on UEquip_C");
static_assert(offsetof(UEquip_C, AutoSettingList_In) == 0x002110, "Member 'UEquip_C::AutoSettingList_In' has a wrong offset!");
static_assert(offsetof(UEquip_C, EquipInfoDetail_Core_In) == 0x002118, "Member 'UEquip_C::EquipInfoDetail_Core_In' has a wrong offset!");
static_assert(offsetof(UEquip_C, MateriaSelect_In) == 0x002120, "Member 'UEquip_C::MateriaSelect_In' has a wrong offset!");
static_assert(offsetof(UEquip_C, ArmorSelect_In) == 0x002128, "Member 'UEquip_C::ArmorSelect_In' has a wrong offset!");
static_assert(offsetof(UEquip_C, AccessorySelect_In) == 0x002130, "Member 'UEquip_C::AccessorySelect_In' has a wrong offset!");
static_assert(offsetof(UEquip_C, Sort_In) == 0x002138, "Member 'UEquip_C::Sort_In' has a wrong offset!");
static_assert(offsetof(UEquip_C, MateriaSelectList_In) == 0x002140, "Member 'UEquip_C::MateriaSelectList_In' has a wrong offset!");
static_assert(offsetof(UEquip_C, WeaponSelect_In) == 0x002148, "Member 'UEquip_C::WeaponSelect_In' has a wrong offset!");
static_assert(offsetof(UEquip_C, CategoryMenu_In) == 0x002150, "Member 'UEquip_C::CategoryMenu_In' has a wrong offset!");
static_assert(offsetof(UEquip_C, In) == 0x002158, "Member 'UEquip_C::In' has a wrong offset!");
static_assert(offsetof(UEquip_C, Bg) == 0x002160, "Member 'UEquip_C::Bg' has a wrong offset!");
static_assert(offsetof(UEquip_C, Bg_MateriaList) == 0x002168, "Member 'UEquip_C::Bg_MateriaList' has a wrong offset!");
static_assert(offsetof(UEquip_C, BtnBase1) == 0x002170, "Member 'UEquip_C::BtnBase1' has a wrong offset!");
static_assert(offsetof(UEquip_C, CategoryTitle_Member_Bg) == 0x002178, "Member 'UEquip_C::CategoryTitle_Member_Bg' has a wrong offset!");
static_assert(offsetof(UEquip_C, Line_1) == 0x002180, "Member 'UEquip_C::Line_1' has a wrong offset!");
static_assert(offsetof(UEquip_C, Line_2) == 0x002188, "Member 'UEquip_C::Line_2' has a wrong offset!");
static_assert(offsetof(UEquip_C, Line_3) == 0x002190, "Member 'UEquip_C::Line_3' has a wrong offset!");
static_assert(offsetof(UEquip_C, Line_4) == 0x002198, "Member 'UEquip_C::Line_4' has a wrong offset!");
static_assert(offsetof(UEquip_C, Line_5) == 0x0021A0, "Member 'UEquip_C::Line_5' has a wrong offset!");
static_assert(offsetof(UEquip_C, Line_6) == 0x0021A8, "Member 'UEquip_C::Line_6' has a wrong offset!");
static_assert(offsetof(UEquip_C, Line_7) == 0x0021B0, "Member 'UEquip_C::Line_7' has a wrong offset!");
static_assert(offsetof(UEquip_C, Line_8) == 0x0021B8, "Member 'UEquip_C::Line_8' has a wrong offset!");
static_assert(offsetof(UEquip_C, Line_9) == 0x0021C0, "Member 'UEquip_C::Line_9' has a wrong offset!");
static_assert(offsetof(UEquip_C, Line_10) == 0x0021C8, "Member 'UEquip_C::Line_10' has a wrong offset!");
static_assert(offsetof(UEquip_C, Line1) == 0x0021D0, "Member 'UEquip_C::Line1' has a wrong offset!");
static_assert(offsetof(UEquip_C, Line2) == 0x0021D8, "Member 'UEquip_C::Line2' has a wrong offset!");
static_assert(offsetof(UEquip_C, ListTitle_Category) == 0x0021E0, "Member 'UEquip_C::ListTitle_Category' has a wrong offset!");
static_assert(offsetof(UEquip_C, ListTitle_MateriaList) == 0x0021E8, "Member 'UEquip_C::ListTitle_MateriaList' has a wrong offset!");
static_assert(offsetof(UEquip_C, ListTitle_Status) == 0x0021F0, "Member 'UEquip_C::ListTitle_Status' has a wrong offset!");
static_assert(offsetof(UEquip_C, MateriaSet_All) == 0x0021F8, "Member 'UEquip_C::MateriaSet_All' has a wrong offset!");
static_assert(offsetof(UEquip_C, System_BgLeft) == 0x002200, "Member 'UEquip_C::System_BgLeft' has a wrong offset!");
static_assert(offsetof(UEquip_C, Txt_AutoSetting) == 0x002208, "Member 'UEquip_C::Txt_AutoSetting' has a wrong offset!");
static_assert(offsetof(UEquip_C, Txt_ListTitle_Status) == 0x002210, "Member 'UEquip_C::Txt_ListTitle_Status' has a wrong offset!");

}

