#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Equip_CategoryList

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Equip_CategoryList.Equip_CategoryList_C
// 0x0020 (0x0410 - 0x03F0)
class UEquip_CategoryList_C final : public UEndEquipCategoryList
{
public:
	class UEndImage*                              BtnBase1;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_AutoSetting;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_SpTitle;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_SpTitle_1;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Equip_CategoryList_C">();
	}
	static class UEquip_CategoryList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquip_CategoryList_C>();
	}
};
static_assert(alignof(UEquip_CategoryList_C) == 0x000008, "Wrong alignment on UEquip_CategoryList_C");
static_assert(sizeof(UEquip_CategoryList_C) == 0x000410, "Wrong size on UEquip_CategoryList_C");
static_assert(offsetof(UEquip_CategoryList_C, BtnBase1) == 0x0003F0, "Member 'UEquip_CategoryList_C::BtnBase1' has a wrong offset!");
static_assert(offsetof(UEquip_CategoryList_C, Txt_AutoSetting) == 0x0003F8, "Member 'UEquip_CategoryList_C::Txt_AutoSetting' has a wrong offset!");
static_assert(offsetof(UEquip_CategoryList_C, Txt_SpTitle) == 0x000400, "Member 'UEquip_CategoryList_C::Txt_SpTitle' has a wrong offset!");
static_assert(offsetof(UEquip_CategoryList_C, Txt_SpTitle_1) == 0x000408, "Member 'UEquip_CategoryList_C::Txt_SpTitle_1' has a wrong offset!");

}

