#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Equip_CategoryCell

#include "Basic.hpp"


namespace SDK::Params
{

// Function Equip_CategoryCell.Equip_CategoryCell_C.ExecuteUbergraph_Equip_CategoryCell
// 0x0008 (0x0008 - 0x0000)
struct Equip_CategoryCell_C_ExecuteUbergraph_Equip_CategoryCell final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Equip_CategoryCell_C_ExecuteUbergraph_Equip_CategoryCell) == 0x000004, "Wrong alignment on Equip_CategoryCell_C_ExecuteUbergraph_Equip_CategoryCell");
static_assert(sizeof(Equip_CategoryCell_C_ExecuteUbergraph_Equip_CategoryCell) == 0x000008, "Wrong size on Equip_CategoryCell_C_ExecuteUbergraph_Equip_CategoryCell");
static_assert(offsetof(Equip_CategoryCell_C_ExecuteUbergraph_Equip_CategoryCell, EntryPoint) == 0x000000, "Member 'Equip_CategoryCell_C_ExecuteUbergraph_Equip_CategoryCell::EntryPoint' has a wrong offset!");
static_assert(offsetof(Equip_CategoryCell_C_ExecuteUbergraph_Equip_CategoryCell, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'Equip_CategoryCell_C_ExecuteUbergraph_Equip_CategoryCell::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Equip_CategoryCell_C_ExecuteUbergraph_Equip_CategoryCell, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000005, "Member 'Equip_CategoryCell_C_ExecuteUbergraph_Equip_CategoryCell::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");

}

