#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Equip_CategoryCell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Equip_CategoryCell.Equip_CategoryCell_C
// 0x0058 (0x0438 - 0x03E0)
class UEquip_CategoryCell_C final : public UEndEquipCategoryCell
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Normal;                                            // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Lock;                                     // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Lock;                                              // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_Blue;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Ring;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_301;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Lock;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Equip_CategoryCell(int32 EntryPoint);
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_16_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Equip_CategoryCell_C">();
	}
	static class UEquip_CategoryCell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquip_CategoryCell_C>();
	}
};
static_assert(alignof(UEquip_CategoryCell_C) == 0x000008, "Wrong alignment on UEquip_CategoryCell_C");
static_assert(sizeof(UEquip_CategoryCell_C) == 0x000438, "Wrong size on UEquip_CategoryCell_C");
static_assert(offsetof(UEquip_CategoryCell_C, UberGraphFrame) == 0x0003E0, "Member 'UEquip_CategoryCell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEquip_CategoryCell_C, Normal) == 0x0003E8, "Member 'UEquip_CategoryCell_C::Normal' has a wrong offset!");
static_assert(offsetof(UEquip_CategoryCell_C, BtnHover_Lock) == 0x0003F0, "Member 'UEquip_CategoryCell_C::BtnHover_Lock' has a wrong offset!");
static_assert(offsetof(UEquip_CategoryCell_C, Lock) == 0x0003F8, "Member 'UEquip_CategoryCell_C::Lock' has a wrong offset!");
static_assert(offsetof(UEquip_CategoryCell_C, BtnHover) == 0x000400, "Member 'UEquip_CategoryCell_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UEquip_CategoryCell_C, Base_Blue) == 0x000408, "Member 'UEquip_CategoryCell_C::Base_Blue' has a wrong offset!");
static_assert(offsetof(UEquip_CategoryCell_C, Base_Ring) == 0x000410, "Member 'UEquip_CategoryCell_C::Base_Ring' has a wrong offset!");
static_assert(offsetof(UEquip_CategoryCell_C, EndImage) == 0x000418, "Member 'UEquip_CategoryCell_C::EndImage' has a wrong offset!");
static_assert(offsetof(UEquip_CategoryCell_C, EndImage_301) == 0x000420, "Member 'UEquip_CategoryCell_C::EndImage_301' has a wrong offset!");
static_assert(offsetof(UEquip_CategoryCell_C, Icon_Lock) == 0x000428, "Member 'UEquip_CategoryCell_C::Icon_Lock' has a wrong offset!");
static_assert(offsetof(UEquip_CategoryCell_C, MainMenu_Btn) == 0x000430, "Member 'UEquip_CategoryCell_C::MainMenu_Btn' has a wrong offset!");

}

