#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventProgress_01

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventProgress_01.EventProgress_01_C
// 0x0248 (0x0610 - 0x03C8)
class UEventProgress_01_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       TwondTime_Out;                                     // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TwondTime_In;                                      // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AncientMatter_Color;                               // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AncientMatterComplete_Out;                         // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AncientMatterComplete_In;                          // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AncientMatter_Out;                                 // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AncientMatter_In;                                  // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AreaComplete_Out;                                  // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AreaComplete_In;                                   // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Complete_Out;                                      // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Complete_In;                                       // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AreaReport_Color;                                  // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WorldReport_Color2;                                // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SubQuest_Color2;                                   // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AreaReport_Out;                                    // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AreaReport_In;                                     // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Treasure_Color;                                    // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       VRRelease_Out;                                     // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       VRRelease_Color;                                   // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MissionAllClear_Out;                               // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MissionAllClear_Color;                             // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       VRRelease_In;                                      // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MissionAllClear_In;                                // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MissionClear_In;                                   // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Accepted_In;                                       // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PerfectClear_Out;                                  // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PerfectClear_In;                                   // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Important_Shift;                                   // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Important_Out;                                     // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Important_In;                                      // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WorldReport_Color;                                 // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TargetDiscovered_Color;                            // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BattleReport_Color;                                // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SubQuest_Color;                                    // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SideStory_Color;                                   // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAddValue_C*                            AddValue;                                          // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_4;                                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Category;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Frame;                                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_StatusTxt_00;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_StatusTxt_01;                                 // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_StatusTxt_02;                                 // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_StatusTxt_03;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_StatusTxt_04;                                 // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_AllCompleat;                             // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Symbol;                                  // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventProgress_Parts_02_C*              Deco_Accepted;                                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventProgress_Parts_00_C*              Deco_Complete_00;                                  // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventProgress_Parts_01_C*              Deco_Complete_01;                                  // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DecoBG_L;                                          // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DecoBG_R;                                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Deco_BG;                                    // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Deco_Light;                                 // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_StatusTxtBG;                                // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_00;                                          // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gauge_BG;                                          // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gauge_BG_1;                                        // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_ChadleyPoint_C*                   Icon_ChadleyPoint;                                 // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Perfect;                                      // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BG;                                            // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BG_1;                                          // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line;                                          // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Effect_StatusTxt;                              // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_LineEffect_00;                                 // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Bottom_Left;                                  // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Bottom_Right;                                 // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Top_Left;                                     // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Top_Right;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Squere_Bottom;                                     // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Squere_Top;                                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ChadleyValue;                                  // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventProgress_01_C">();
	}
	static class UEventProgress_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventProgress_01_C>();
	}
};
static_assert(alignof(UEventProgress_01_C) == 0x000008, "Wrong alignment on UEventProgress_01_C");
static_assert(sizeof(UEventProgress_01_C) == 0x000610, "Wrong size on UEventProgress_01_C");
static_assert(offsetof(UEventProgress_01_C, TwondTime_Out) == 0x0003C8, "Member 'UEventProgress_01_C::TwondTime_Out' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, TwondTime_In) == 0x0003D0, "Member 'UEventProgress_01_C::TwondTime_In' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, AncientMatter_Color) == 0x0003D8, "Member 'UEventProgress_01_C::AncientMatter_Color' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, AncientMatterComplete_Out) == 0x0003E0, "Member 'UEventProgress_01_C::AncientMatterComplete_Out' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, AncientMatterComplete_In) == 0x0003E8, "Member 'UEventProgress_01_C::AncientMatterComplete_In' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, AncientMatter_Out) == 0x0003F0, "Member 'UEventProgress_01_C::AncientMatter_Out' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, AncientMatter_In) == 0x0003F8, "Member 'UEventProgress_01_C::AncientMatter_In' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, AreaComplete_Out) == 0x000400, "Member 'UEventProgress_01_C::AreaComplete_Out' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, AreaComplete_In) == 0x000408, "Member 'UEventProgress_01_C::AreaComplete_In' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Complete_Out) == 0x000410, "Member 'UEventProgress_01_C::Complete_Out' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Complete_In) == 0x000418, "Member 'UEventProgress_01_C::Complete_In' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, AreaReport_Color) == 0x000420, "Member 'UEventProgress_01_C::AreaReport_Color' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, WorldReport_Color2) == 0x000428, "Member 'UEventProgress_01_C::WorldReport_Color2' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, SubQuest_Color2) == 0x000430, "Member 'UEventProgress_01_C::SubQuest_Color2' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, AreaReport_Out) == 0x000438, "Member 'UEventProgress_01_C::AreaReport_Out' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, AreaReport_In) == 0x000440, "Member 'UEventProgress_01_C::AreaReport_In' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Treasure_Color) == 0x000448, "Member 'UEventProgress_01_C::Treasure_Color' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, VRRelease_Out) == 0x000450, "Member 'UEventProgress_01_C::VRRelease_Out' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, VRRelease_Color) == 0x000458, "Member 'UEventProgress_01_C::VRRelease_Color' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, MissionAllClear_Out) == 0x000460, "Member 'UEventProgress_01_C::MissionAllClear_Out' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, MissionAllClear_Color) == 0x000468, "Member 'UEventProgress_01_C::MissionAllClear_Color' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, VRRelease_In) == 0x000470, "Member 'UEventProgress_01_C::VRRelease_In' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, MissionAllClear_In) == 0x000478, "Member 'UEventProgress_01_C::MissionAllClear_In' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, MissionClear_In) == 0x000480, "Member 'UEventProgress_01_C::MissionClear_In' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Accepted_In) == 0x000488, "Member 'UEventProgress_01_C::Accepted_In' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, PerfectClear_Out) == 0x000490, "Member 'UEventProgress_01_C::PerfectClear_Out' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, PerfectClear_In) == 0x000498, "Member 'UEventProgress_01_C::PerfectClear_In' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Important_Shift) == 0x0004A0, "Member 'UEventProgress_01_C::Important_Shift' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Important_Out) == 0x0004A8, "Member 'UEventProgress_01_C::Important_Out' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Important_In) == 0x0004B0, "Member 'UEventProgress_01_C::Important_In' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, WorldReport_Color) == 0x0004B8, "Member 'UEventProgress_01_C::WorldReport_Color' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, TargetDiscovered_Color) == 0x0004C0, "Member 'UEventProgress_01_C::TargetDiscovered_Color' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, BattleReport_Color) == 0x0004C8, "Member 'UEventProgress_01_C::BattleReport_Color' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, SubQuest_Color) == 0x0004D0, "Member 'UEventProgress_01_C::SubQuest_Color' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, SideStory_Color) == 0x0004D8, "Member 'UEventProgress_01_C::SideStory_Color' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Out) == 0x0004E0, "Member 'UEventProgress_01_C::Out' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, In) == 0x0004E8, "Member 'UEventProgress_01_C::In' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, AddValue) == 0x0004F0, "Member 'UEventProgress_01_C::AddValue' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Base1_4) == 0x0004F8, "Member 'UEventProgress_01_C::Base1_4' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Base_Category) == 0x000500, "Member 'UEventProgress_01_C::Base_Category' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Base_Frame) == 0x000508, "Member 'UEventProgress_01_C::Base_Frame' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Base_StatusTxt_00) == 0x000510, "Member 'UEventProgress_01_C::Base_StatusTxt_00' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Base_StatusTxt_01) == 0x000518, "Member 'UEventProgress_01_C::Base_StatusTxt_01' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Base_StatusTxt_02) == 0x000520, "Member 'UEventProgress_01_C::Base_StatusTxt_02' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Base_StatusTxt_03) == 0x000528, "Member 'UEventProgress_01_C::Base_StatusTxt_03' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Base_StatusTxt_04) == 0x000530, "Member 'UEventProgress_01_C::Base_StatusTxt_04' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Billboard_AllCompleat) == 0x000538, "Member 'UEventProgress_01_C::Billboard_AllCompleat' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Billboard_Symbol) == 0x000540, "Member 'UEventProgress_01_C::Billboard_Symbol' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Deco_Accepted) == 0x000548, "Member 'UEventProgress_01_C::Deco_Accepted' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Deco_Complete_00) == 0x000550, "Member 'UEventProgress_01_C::Deco_Complete_00' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Deco_Complete_01) == 0x000558, "Member 'UEventProgress_01_C::Deco_Complete_01' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, DecoBG_L) == 0x000560, "Member 'UEventProgress_01_C::DecoBG_L' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, DecoBG_R) == 0x000568, "Member 'UEventProgress_01_C::DecoBG_R' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Effect_Deco_BG) == 0x000570, "Member 'UEventProgress_01_C::Effect_Deco_BG' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Effect_Deco_Light) == 0x000578, "Member 'UEventProgress_01_C::Effect_Deco_Light' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Effect_StatusTxtBG) == 0x000580, "Member 'UEventProgress_01_C::Effect_StatusTxtBG' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Gauge_00) == 0x000588, "Member 'UEventProgress_01_C::Gauge_00' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Gauge_BG) == 0x000590, "Member 'UEventProgress_01_C::Gauge_BG' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Gauge_BG_1) == 0x000598, "Member 'UEventProgress_01_C::Gauge_BG_1' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Icon_ChadleyPoint) == 0x0005A0, "Member 'UEventProgress_01_C::Icon_ChadleyPoint' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Icon_Perfect) == 0x0005A8, "Member 'UEventProgress_01_C::Icon_Perfect' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Img_BG) == 0x0005B0, "Member 'UEventProgress_01_C::Img_BG' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Img_BG_1) == 0x0005B8, "Member 'UEventProgress_01_C::Img_BG_1' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Img_Line) == 0x0005C0, "Member 'UEventProgress_01_C::Img_Line' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Ims_Effect_StatusTxt) == 0x0005C8, "Member 'UEventProgress_01_C::Ims_Effect_StatusTxt' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Ims_LineEffect_00) == 0x0005D0, "Member 'UEventProgress_01_C::Ims_LineEffect_00' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Line_Bottom_Left) == 0x0005D8, "Member 'UEventProgress_01_C::Line_Bottom_Left' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Line_Bottom_Right) == 0x0005E0, "Member 'UEventProgress_01_C::Line_Bottom_Right' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Line_Top_Left) == 0x0005E8, "Member 'UEventProgress_01_C::Line_Top_Left' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Line_Top_Right) == 0x0005F0, "Member 'UEventProgress_01_C::Line_Top_Right' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Squere_Bottom) == 0x0005F8, "Member 'UEventProgress_01_C::Squere_Bottom' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Squere_Top) == 0x000600, "Member 'UEventProgress_01_C::Squere_Top' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Txt_ChadleyValue) == 0x000608, "Member 'UEventProgress_01_C::Txt_ChadleyValue' has a wrong offset!");

}

