#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventProgress_Stone

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventProgress_Stone.EventProgress_Stone_C
// 0x0078 (0x0440 - 0x03C8)
class UEventProgress_Stone_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       OneSetClear;                                       // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unreleased;                                        // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Closed;                                            // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Release;                                           // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Clear;                                             // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base1_6;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_00;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Stone;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Stone_01;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_76;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Current_1;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Currentbg;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Stone;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Stone_1;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Stone_Shadow;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventProgress_Stone_C">();
	}
	static class UEventProgress_Stone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventProgress_Stone_C>();
	}
};
static_assert(alignof(UEventProgress_Stone_C) == 0x000008, "Wrong alignment on UEventProgress_Stone_C");
static_assert(sizeof(UEventProgress_Stone_C) == 0x000440, "Wrong size on UEventProgress_Stone_C");
static_assert(offsetof(UEventProgress_Stone_C, OneSetClear) == 0x0003C8, "Member 'UEventProgress_Stone_C::OneSetClear' has a wrong offset!");
static_assert(offsetof(UEventProgress_Stone_C, Unreleased) == 0x0003D0, "Member 'UEventProgress_Stone_C::Unreleased' has a wrong offset!");
static_assert(offsetof(UEventProgress_Stone_C, Closed) == 0x0003D8, "Member 'UEventProgress_Stone_C::Closed' has a wrong offset!");
static_assert(offsetof(UEventProgress_Stone_C, Release) == 0x0003E0, "Member 'UEventProgress_Stone_C::Release' has a wrong offset!");
static_assert(offsetof(UEventProgress_Stone_C, Clear) == 0x0003E8, "Member 'UEventProgress_Stone_C::Clear' has a wrong offset!");
static_assert(offsetof(UEventProgress_Stone_C, Base1_6) == 0x0003F0, "Member 'UEventProgress_Stone_C::Base1_6' has a wrong offset!");
static_assert(offsetof(UEventProgress_Stone_C, Effect_00) == 0x0003F8, "Member 'UEventProgress_Stone_C::Effect_00' has a wrong offset!");
static_assert(offsetof(UEventProgress_Stone_C, Effect_Stone) == 0x000400, "Member 'UEventProgress_Stone_C::Effect_Stone' has a wrong offset!");
static_assert(offsetof(UEventProgress_Stone_C, Effect_Stone_01) == 0x000408, "Member 'UEventProgress_Stone_C::Effect_Stone_01' has a wrong offset!");
static_assert(offsetof(UEventProgress_Stone_C, EndImage_76) == 0x000410, "Member 'UEventProgress_Stone_C::EndImage_76' has a wrong offset!");
static_assert(offsetof(UEventProgress_Stone_C, Icon_Current_1) == 0x000418, "Member 'UEventProgress_Stone_C::Icon_Current_1' has a wrong offset!");
static_assert(offsetof(UEventProgress_Stone_C, Icon_Currentbg) == 0x000420, "Member 'UEventProgress_Stone_C::Icon_Currentbg' has a wrong offset!");
static_assert(offsetof(UEventProgress_Stone_C, Icon_Stone) == 0x000428, "Member 'UEventProgress_Stone_C::Icon_Stone' has a wrong offset!");
static_assert(offsetof(UEventProgress_Stone_C, Icon_Stone_1) == 0x000430, "Member 'UEventProgress_Stone_C::Icon_Stone_1' has a wrong offset!");
static_assert(offsetof(UEventProgress_Stone_C, Stone_Shadow) == 0x000438, "Member 'UEventProgress_Stone_C::Stone_Shadow' has a wrong offset!");

}

