#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FA0052_01_Dummy_Character_Animation

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass FA0052_01_Dummy_Character_Animation.FA0052_01_Dummy_Character_Animation_C
// 0x0330 (0x1AA0 - 0x1770)
class UFA0052_01_Dummy_Character_Animation_C final : public UEndCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1770(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1778(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x17A8(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x17D0(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x17E8(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer;         // 0x1818(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x18C0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x18F0(0x00B0)()
	struct FAnimNode_EndBehaviorAction            AnimGraphNode_EndBehaviorAction;                   // 0x19A0(0x0028)()
	struct FAnimNode_EndInertialization           AnimGraphNode_EndInertialization;                  // 0x19C8(0x0090)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1A58(0x0048)()

public:
	void ExecuteUbergraph_FA0052_01_Dummy_Character_Animation(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FA0052_01_Dummy_Character_Animation_C">();
	}
	static class UFA0052_01_Dummy_Character_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFA0052_01_Dummy_Character_Animation_C>();
	}
};
static_assert(alignof(UFA0052_01_Dummy_Character_Animation_C) == 0x000010, "Wrong alignment on UFA0052_01_Dummy_Character_Animation_C");
static_assert(sizeof(UFA0052_01_Dummy_Character_Animation_C) == 0x001AA0, "Wrong size on UFA0052_01_Dummy_Character_Animation_C");
static_assert(offsetof(UFA0052_01_Dummy_Character_Animation_C, UberGraphFrame) == 0x001770, "Member 'UFA0052_01_Dummy_Character_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFA0052_01_Dummy_Character_Animation_C, AnimGraphNode_Root) == 0x001778, "Member 'UFA0052_01_Dummy_Character_Animation_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFA0052_01_Dummy_Character_Animation_C, AnimGraphNode_TransitionResult) == 0x0017A8, "Member 'UFA0052_01_Dummy_Character_Animation_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UFA0052_01_Dummy_Character_Animation_C, AnimGraphNode_LocalRefPose) == 0x0017D0, "Member 'UFA0052_01_Dummy_Character_Animation_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UFA0052_01_Dummy_Character_Animation_C, AnimGraphNode_StateResult_1) == 0x0017E8, "Member 'UFA0052_01_Dummy_Character_Animation_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UFA0052_01_Dummy_Character_Animation_C, AnimGraphNode_EndLocomotionSequencePlayer) == 0x001818, "Member 'UFA0052_01_Dummy_Character_Animation_C::AnimGraphNode_EndLocomotionSequencePlayer' has a wrong offset!");
static_assert(offsetof(UFA0052_01_Dummy_Character_Animation_C, AnimGraphNode_StateResult) == 0x0018C0, "Member 'UFA0052_01_Dummy_Character_Animation_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UFA0052_01_Dummy_Character_Animation_C, AnimGraphNode_StateMachine) == 0x0018F0, "Member 'UFA0052_01_Dummy_Character_Animation_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UFA0052_01_Dummy_Character_Animation_C, AnimGraphNode_EndBehaviorAction) == 0x0019A0, "Member 'UFA0052_01_Dummy_Character_Animation_C::AnimGraphNode_EndBehaviorAction' has a wrong offset!");
static_assert(offsetof(UFA0052_01_Dummy_Character_Animation_C, AnimGraphNode_EndInertialization) == 0x0019C8, "Member 'UFA0052_01_Dummy_Character_Animation_C::AnimGraphNode_EndInertialization' has a wrong offset!");
static_assert(offsetof(UFA0052_01_Dummy_Character_Animation_C, AnimGraphNode_Slot) == 0x001A58, "Member 'UFA0052_01_Dummy_Character_Animation_C::AnimGraphNode_Slot' has a wrong offset!");

}

