#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FA0052_01_Dummy_Character_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FA0052_01_Dummy_Character_Animation.FA0052_01_Dummy_Character_Animation_C.ExecuteUbergraph_FA0052_01_Dummy_Character_Animation
// 0x0004 (0x0004 - 0x0000)
struct FA0052_01_Dummy_Character_Animation_C_ExecuteUbergraph_FA0052_01_Dummy_Character_Animation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FA0052_01_Dummy_Character_Animation_C_ExecuteUbergraph_FA0052_01_Dummy_Character_Animation) == 0x000004, "Wrong alignment on FA0052_01_Dummy_Character_Animation_C_ExecuteUbergraph_FA0052_01_Dummy_Character_Animation");
static_assert(sizeof(FA0052_01_Dummy_Character_Animation_C_ExecuteUbergraph_FA0052_01_Dummy_Character_Animation) == 0x000004, "Wrong size on FA0052_01_Dummy_Character_Animation_C_ExecuteUbergraph_FA0052_01_Dummy_Character_Animation");
static_assert(offsetof(FA0052_01_Dummy_Character_Animation_C_ExecuteUbergraph_FA0052_01_Dummy_Character_Animation, EntryPoint) == 0x000000, "Member 'FA0052_01_Dummy_Character_Animation_C_ExecuteUbergraph_FA0052_01_Dummy_Character_Animation::EntryPoint' has a wrong offset!");

// Function FA0052_01_Dummy_Character_Animation.FA0052_01_Dummy_Character_Animation_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct FA0052_01_Dummy_Character_Animation_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(FA0052_01_Dummy_Character_Animation_C_AnimGraph) == 0x000008, "Wrong alignment on FA0052_01_Dummy_Character_Animation_C_AnimGraph");
static_assert(sizeof(FA0052_01_Dummy_Character_Animation_C_AnimGraph) == 0x000010, "Wrong size on FA0052_01_Dummy_Character_Animation_C_AnimGraph");
static_assert(offsetof(FA0052_01_Dummy_Character_Animation_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'FA0052_01_Dummy_Character_Animation_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

