#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FA0584_00_CartPlug_Standard_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass FA0584_00_CartPlug_Standard_Animation.FA0584_00_CartPlug_Standard_Animation_C
// 0x0420 (0x0C20 - 0x0800)
class UFA0584_00_CartPlug_Standard_Animation_C final : public UEndRopeAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0800(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0808(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0828(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0848(0x0018)()
	struct FAnimNode_EndRope                      AnimGraphNode_EndRope;                             // 0x0860(0x0390)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0BF0(0x0030)()

public:
	void ExecuteUbergraph_FA0584_00_CartPlug_Standard_Animation(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FA0584_00_CartPlug_Standard_Animation_C">();
	}
	static class UFA0584_00_CartPlug_Standard_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFA0584_00_CartPlug_Standard_Animation_C>();
	}
};
static_assert(alignof(UFA0584_00_CartPlug_Standard_Animation_C) == 0x000010, "Wrong alignment on UFA0584_00_CartPlug_Standard_Animation_C");
static_assert(sizeof(UFA0584_00_CartPlug_Standard_Animation_C) == 0x000C20, "Wrong size on UFA0584_00_CartPlug_Standard_Animation_C");
static_assert(offsetof(UFA0584_00_CartPlug_Standard_Animation_C, UberGraphFrame) == 0x000800, "Member 'UFA0584_00_CartPlug_Standard_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFA0584_00_CartPlug_Standard_Animation_C, AnimGraphNode_ComponentToLocalSpace) == 0x000808, "Member 'UFA0584_00_CartPlug_Standard_Animation_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UFA0584_00_CartPlug_Standard_Animation_C, AnimGraphNode_LocalToComponentSpace) == 0x000828, "Member 'UFA0584_00_CartPlug_Standard_Animation_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UFA0584_00_CartPlug_Standard_Animation_C, AnimGraphNode_LocalRefPose) == 0x000848, "Member 'UFA0584_00_CartPlug_Standard_Animation_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UFA0584_00_CartPlug_Standard_Animation_C, AnimGraphNode_EndRope) == 0x000860, "Member 'UFA0584_00_CartPlug_Standard_Animation_C::AnimGraphNode_EndRope' has a wrong offset!");
static_assert(offsetof(UFA0584_00_CartPlug_Standard_Animation_C, AnimGraphNode_Root) == 0x000BF0, "Member 'UFA0584_00_CartPlug_Standard_Animation_C::AnimGraphNode_Root' has a wrong offset!");

}

