#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FA2212_00_ChocoboPartsBody00_Standard_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass FA2212_00_ChocoboPartsBody00_Standard_Animation.FA2212_00_ChocoboPartsBody00_Standard_Animation_C
// 0x03B0 (0x0BA0 - 0x07F0)
class UFA2212_00_ChocoboPartsBody00_Standard_Animation_C final : public UEndSkeletalMeshActorAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	uint8                                         Pad_7F8[0x8];                                      // 0x07F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_EndReins                     AnimGraphNode_EndReins;                            // 0x0800(0x0270)(ContainsInstancedReference)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0A70(0x0020)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x0A90(0x0010)()
	struct FAnimNode_EndCopyBoneTransforms        AnimGraphNode_EndCopyBoneTransforms;               // 0x0AA0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0B68(0x0030)()

public:
	void ExecuteUbergraph_FA2212_00_ChocoboPartsBody00_Standard_Animation(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FA2212_00_ChocoboPartsBody00_Standard_Animation_C">();
	}
	static class UFA2212_00_ChocoboPartsBody00_Standard_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFA2212_00_ChocoboPartsBody00_Standard_Animation_C>();
	}
};
static_assert(alignof(UFA2212_00_ChocoboPartsBody00_Standard_Animation_C) == 0x000010, "Wrong alignment on UFA2212_00_ChocoboPartsBody00_Standard_Animation_C");
static_assert(sizeof(UFA2212_00_ChocoboPartsBody00_Standard_Animation_C) == 0x000BA0, "Wrong size on UFA2212_00_ChocoboPartsBody00_Standard_Animation_C");
static_assert(offsetof(UFA2212_00_ChocoboPartsBody00_Standard_Animation_C, UberGraphFrame) == 0x0007F0, "Member 'UFA2212_00_ChocoboPartsBody00_Standard_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFA2212_00_ChocoboPartsBody00_Standard_Animation_C, AnimGraphNode_EndReins) == 0x000800, "Member 'UFA2212_00_ChocoboPartsBody00_Standard_Animation_C::AnimGraphNode_EndReins' has a wrong offset!");
static_assert(offsetof(UFA2212_00_ChocoboPartsBody00_Standard_Animation_C, AnimGraphNode_ComponentToLocalSpace) == 0x000A70, "Member 'UFA2212_00_ChocoboPartsBody00_Standard_Animation_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UFA2212_00_ChocoboPartsBody00_Standard_Animation_C, AnimGraphNode_MeshRefPose) == 0x000A90, "Member 'UFA2212_00_ChocoboPartsBody00_Standard_Animation_C::AnimGraphNode_MeshRefPose' has a wrong offset!");
static_assert(offsetof(UFA2212_00_ChocoboPartsBody00_Standard_Animation_C, AnimGraphNode_EndCopyBoneTransforms) == 0x000AA0, "Member 'UFA2212_00_ChocoboPartsBody00_Standard_Animation_C::AnimGraphNode_EndCopyBoneTransforms' has a wrong offset!");
static_assert(offsetof(UFA2212_00_ChocoboPartsBody00_Standard_Animation_C, AnimGraphNode_Root) == 0x000B68, "Member 'UFA2212_00_ChocoboPartsBody00_Standard_Animation_C::AnimGraphNode_Root' has a wrong offset!");

}

