#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FastTravel

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FastTravel.FastTravel_C
// 0x0020 (0x04E0 - 0x04C0)
class UFastTravel_C final : public UEndPointWarpMenu
{
public:
	class UWidgetAnimation*                       Menu_In;                                           // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFastTravel_Map_C*                      FastTravel_Map;                                    // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFastTravel_Menu_C*                     FastTravel_Menu;                                   // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Footer_C*                         Shop_Foot;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FastTravel_C">();
	}
	static class UFastTravel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFastTravel_C>();
	}
};
static_assert(alignof(UFastTravel_C) == 0x000008, "Wrong alignment on UFastTravel_C");
static_assert(sizeof(UFastTravel_C) == 0x0004E0, "Wrong size on UFastTravel_C");
static_assert(offsetof(UFastTravel_C, Menu_In) == 0x0004C0, "Member 'UFastTravel_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UFastTravel_C, FastTravel_Map) == 0x0004C8, "Member 'UFastTravel_C::FastTravel_Map' has a wrong offset!");
static_assert(offsetof(UFastTravel_C, FastTravel_Menu) == 0x0004D0, "Member 'UFastTravel_C::FastTravel_Menu' has a wrong offset!");
static_assert(offsetof(UFastTravel_C, Shop_Foot) == 0x0004D8, "Member 'UFastTravel_C::Shop_Foot' has a wrong offset!");

}

