#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FastTravel_Menu

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FastTravel_Menu.FastTravel_Menu_C
// 0x00D8 (0x04A0 - 0x03C8)
class UFastTravel_Menu_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Johnny;                                            // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ship;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CosmoCanyon;                                       // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Chocobo;                                           // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tinybronco;                                        // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GoldSaucer;                                        // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndBillboard*                          Banner_Billboard;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_3;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_1;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseLine1;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseLine2;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_GS;                                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_Left;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_235;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Photo_Billboard;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Photo_Line_GS1;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Photo_Line_GS2;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TitleBaseLight1;                                   // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TitleBaseLight2;                                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TitleBaseLight2_1;                                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TitleLine1;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TitleLine2;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title_1;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FastTravel_Menu_C">();
	}
	static class UFastTravel_Menu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFastTravel_Menu_C>();
	}
};
static_assert(alignof(UFastTravel_Menu_C) == 0x000008, "Wrong alignment on UFastTravel_Menu_C");
static_assert(sizeof(UFastTravel_Menu_C) == 0x0004A0, "Wrong size on UFastTravel_Menu_C");
static_assert(offsetof(UFastTravel_Menu_C, Johnny) == 0x0003C8, "Member 'UFastTravel_Menu_C::Johnny' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, Ship) == 0x0003D0, "Member 'UFastTravel_Menu_C::Ship' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, CosmoCanyon) == 0x0003D8, "Member 'UFastTravel_Menu_C::CosmoCanyon' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, Chocobo) == 0x0003E0, "Member 'UFastTravel_Menu_C::Chocobo' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, Tinybronco) == 0x0003E8, "Member 'UFastTravel_Menu_C::Tinybronco' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, GoldSaucer) == 0x0003F0, "Member 'UFastTravel_Menu_C::GoldSaucer' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, Menu_In) == 0x0003F8, "Member 'UFastTravel_Menu_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, Banner_Billboard) == 0x000400, "Member 'UFastTravel_Menu_C::Banner_Billboard' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, Base_3) == 0x000408, "Member 'UFastTravel_Menu_C::Base_3' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, Base1) == 0x000410, "Member 'UFastTravel_Menu_C::Base1' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, Base1_1) == 0x000418, "Member 'UFastTravel_Menu_C::Base1_1' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, BaseLine1) == 0x000420, "Member 'UFastTravel_Menu_C::BaseLine1' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, BaseLine2) == 0x000428, "Member 'UFastTravel_Menu_C::BaseLine2' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, Bg) == 0x000430, "Member 'UFastTravel_Menu_C::Bg' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, Bg_GS) == 0x000438, "Member 'UFastTravel_Menu_C::Bg_GS' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, Bg_Left) == 0x000440, "Member 'UFastTravel_Menu_C::Bg_Left' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, EndImage_235) == 0x000448, "Member 'UFastTravel_Menu_C::EndImage_235' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, ListBg2) == 0x000450, "Member 'UFastTravel_Menu_C::ListBg2' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, Photo_Billboard) == 0x000458, "Member 'UFastTravel_Menu_C::Photo_Billboard' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, Photo_Line_GS1) == 0x000460, "Member 'UFastTravel_Menu_C::Photo_Line_GS1' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, Photo_Line_GS2) == 0x000468, "Member 'UFastTravel_Menu_C::Photo_Line_GS2' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, TitleBaseLight1) == 0x000470, "Member 'UFastTravel_Menu_C::TitleBaseLight1' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, TitleBaseLight2) == 0x000478, "Member 'UFastTravel_Menu_C::TitleBaseLight2' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, TitleBaseLight2_1) == 0x000480, "Member 'UFastTravel_Menu_C::TitleBaseLight2_1' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, TitleLine1) == 0x000488, "Member 'UFastTravel_Menu_C::TitleLine1' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, TitleLine2) == 0x000490, "Member 'UFastTravel_Menu_C::TitleLine2' has a wrong offset!");
static_assert(offsetof(UFastTravel_Menu_C, Txt_Title_1) == 0x000498, "Member 'UFastTravel_Menu_C::Txt_Title_1' has a wrong offset!");

}

