#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FastTravel_Loca

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FastTravel_Loca.FastTravel_Loca_C
// 0x00C8 (0x0490 - 0x03C8)
class UFastTravel_Loca_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Johnny;                                            // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Target_Out;                                        // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Target_In;                                         // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ship;                                              // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Chocobo;                                           // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CosmoCanyon;                                       // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tinybronco;                                        // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GoldSaucer;                                        // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Closed;                                            // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NotRelease;                                        // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Current;                                           // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Target_Loop;                                       // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Cursor_00;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_01;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_81;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Base;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Current_set;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Face_C*                           Icon_Face;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Notice;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Point_Set;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Target;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_circle_01;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Target_Base;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FastTravel_Loca_C">();
	}
	static class UFastTravel_Loca_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFastTravel_Loca_C>();
	}
};
static_assert(alignof(UFastTravel_Loca_C) == 0x000008, "Wrong alignment on UFastTravel_Loca_C");
static_assert(sizeof(UFastTravel_Loca_C) == 0x000490, "Wrong size on UFastTravel_Loca_C");
static_assert(offsetof(UFastTravel_Loca_C, Johnny) == 0x0003C8, "Member 'UFastTravel_Loca_C::Johnny' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Target_Out) == 0x0003D0, "Member 'UFastTravel_Loca_C::Target_Out' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Target_In) == 0x0003D8, "Member 'UFastTravel_Loca_C::Target_In' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Ship) == 0x0003E0, "Member 'UFastTravel_Loca_C::Ship' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Chocobo) == 0x0003E8, "Member 'UFastTravel_Loca_C::Chocobo' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, CosmoCanyon) == 0x0003F0, "Member 'UFastTravel_Loca_C::CosmoCanyon' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Tinybronco) == 0x0003F8, "Member 'UFastTravel_Loca_C::Tinybronco' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, GoldSaucer) == 0x000400, "Member 'UFastTravel_Loca_C::GoldSaucer' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Closed) == 0x000408, "Member 'UFastTravel_Loca_C::Closed' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, NotRelease) == 0x000410, "Member 'UFastTravel_Loca_C::NotRelease' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Normal) == 0x000418, "Member 'UFastTravel_Loca_C::Normal' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Current) == 0x000420, "Member 'UFastTravel_Loca_C::Current' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Menu_In) == 0x000428, "Member 'UFastTravel_Loca_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Target_Loop) == 0x000430, "Member 'UFastTravel_Loca_C::Target_Loop' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Cursor_00) == 0x000438, "Member 'UFastTravel_Loca_C::Cursor_00' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Cursor_01) == 0x000440, "Member 'UFastTravel_Loca_C::Cursor_01' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, EndImage_81) == 0x000448, "Member 'UFastTravel_Loca_C::EndImage_81' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Icon_Base) == 0x000450, "Member 'UFastTravel_Loca_C::Icon_Base' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Icon_Current_set) == 0x000458, "Member 'UFastTravel_Loca_C::Icon_Current_set' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Icon_Face) == 0x000460, "Member 'UFastTravel_Loca_C::Icon_Face' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Icon_Notice) == 0x000468, "Member 'UFastTravel_Loca_C::Icon_Notice' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Icon_Point_Set) == 0x000470, "Member 'UFastTravel_Loca_C::Icon_Point_Set' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Icon_Target) == 0x000478, "Member 'UFastTravel_Loca_C::Icon_Target' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Img_circle_01) == 0x000480, "Member 'UFastTravel_Loca_C::Img_circle_01' has a wrong offset!");
static_assert(offsetof(UFastTravel_Loca_C, Target_Base) == 0x000488, "Member 'UFastTravel_Loca_C::Target_Base' has a wrong offset!");

}

