#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldTargetSearch_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FieldTargetSearch_02.FieldTargetSearch_02_C
// 0x0028 (0x03F0 - 0x03C8)
class UFieldTargetSearch_02_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       In;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_InLine;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_OutLine;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FieldTargetSearch_02(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FieldTargetSearch_02_C">();
	}
	static class UFieldTargetSearch_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFieldTargetSearch_02_C>();
	}
};
static_assert(alignof(UFieldTargetSearch_02_C) == 0x000008, "Wrong alignment on UFieldTargetSearch_02_C");
static_assert(sizeof(UFieldTargetSearch_02_C) == 0x0003F0, "Wrong size on UFieldTargetSearch_02_C");
static_assert(offsetof(UFieldTargetSearch_02_C, UberGraphFrame) == 0x0003C8, "Member 'UFieldTargetSearch_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFieldTargetSearch_02_C, In) == 0x0003D0, "Member 'UFieldTargetSearch_02_C::In' has a wrong offset!");
static_assert(offsetof(UFieldTargetSearch_02_C, Loop) == 0x0003D8, "Member 'UFieldTargetSearch_02_C::Loop' has a wrong offset!");
static_assert(offsetof(UFieldTargetSearch_02_C, Ims_InLine) == 0x0003E0, "Member 'UFieldTargetSearch_02_C::Ims_InLine' has a wrong offset!");
static_assert(offsetof(UFieldTargetSearch_02_C, Ims_OutLine) == 0x0003E8, "Member 'UFieldTargetSearch_02_C::Ims_OutLine' has a wrong offset!");

}

