#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Field_RewardList

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Field_RewardList.Field_RewardList_C
// 0x0040 (0x0408 - 0x03C8)
class UField_RewardList_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UField_CurrencyList_C*                  CurrencyList;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gradation;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_InfoWindowBg2_C*              InfoWindowBg2;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTalkMenu_ItemList_Cell_C*              ItemList_Cell;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ModeIcon;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TitleBase;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Field_RewardList_C">();
	}
	static class UField_RewardList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UField_RewardList_C>();
	}
};
static_assert(alignof(UField_RewardList_C) == 0x000008, "Wrong alignment on UField_RewardList_C");
static_assert(sizeof(UField_RewardList_C) == 0x000408, "Wrong size on UField_RewardList_C");
static_assert(offsetof(UField_RewardList_C, Out) == 0x0003C8, "Member 'UField_RewardList_C::Out' has a wrong offset!");
static_assert(offsetof(UField_RewardList_C, Menu_In) == 0x0003D0, "Member 'UField_RewardList_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UField_RewardList_C, CurrencyList) == 0x0003D8, "Member 'UField_RewardList_C::CurrencyList' has a wrong offset!");
static_assert(offsetof(UField_RewardList_C, Gradation) == 0x0003E0, "Member 'UField_RewardList_C::Gradation' has a wrong offset!");
static_assert(offsetof(UField_RewardList_C, InfoWindowBg2) == 0x0003E8, "Member 'UField_RewardList_C::InfoWindowBg2' has a wrong offset!");
static_assert(offsetof(UField_RewardList_C, ItemList_Cell) == 0x0003F0, "Member 'UField_RewardList_C::ItemList_Cell' has a wrong offset!");
static_assert(offsetof(UField_RewardList_C, ModeIcon) == 0x0003F8, "Member 'UField_RewardList_C::ModeIcon' has a wrong offset!");
static_assert(offsetof(UField_RewardList_C, TitleBase) == 0x000400, "Member 'UField_RewardList_C::TitleBase' has a wrong offset!");

}

