#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldAction_Command

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FieldAction_Command.FieldAction_Command_C
// 0x0088 (0x04C0 - 0x0438)
class UFieldAction_Command_C final : public UEndFieldActionIcon
{
public:
	class UWidgetAnimation*                       Highlight_Loop;                                    // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CommandOpen;                                       // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Running;                                           // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Shift;                                             // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pressed;                                           // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Deco_00;                                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco_Highlight;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Highlight;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Ring;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        EndProgressBar_144;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_01;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight_1;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Effect_00;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_02;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FieldAction_Command_C">();
	}
	static class UFieldAction_Command_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFieldAction_Command_C>();
	}
};
static_assert(alignof(UFieldAction_Command_C) == 0x000008, "Wrong alignment on UFieldAction_Command_C");
static_assert(sizeof(UFieldAction_Command_C) == 0x0004C0, "Wrong size on UFieldAction_Command_C");
static_assert(offsetof(UFieldAction_Command_C, Highlight_Loop) == 0x000438, "Member 'UFieldAction_Command_C::Highlight_Loop' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, CommandOpen) == 0x000440, "Member 'UFieldAction_Command_C::CommandOpen' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, In) == 0x000448, "Member 'UFieldAction_Command_C::In' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Running) == 0x000450, "Member 'UFieldAction_Command_C::Running' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Shift) == 0x000458, "Member 'UFieldAction_Command_C::Shift' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Pressed) == 0x000460, "Member 'UFieldAction_Command_C::Pressed' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Deco_00) == 0x000468, "Member 'UFieldAction_Command_C::Deco_00' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Deco_Highlight) == 0x000470, "Member 'UFieldAction_Command_C::Deco_Highlight' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Effect_Highlight) == 0x000478, "Member 'UFieldAction_Command_C::Effect_Highlight' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Effect_Ring) == 0x000480, "Member 'UFieldAction_Command_C::Effect_Ring' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, EndProgressBar_144) == 0x000488, "Member 'UFieldAction_Command_C::EndProgressBar_144' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Img_Base) == 0x000490, "Member 'UFieldAction_Command_C::Img_Base' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Img_Base_01) == 0x000498, "Member 'UFieldAction_Command_C::Img_Base_01' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Img_BtnLight) == 0x0004A0, "Member 'UFieldAction_Command_C::Img_BtnLight' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Img_BtnLight_1) == 0x0004A8, "Member 'UFieldAction_Command_C::Img_BtnLight_1' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Img_Effect_00) == 0x0004B0, "Member 'UFieldAction_Command_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Img_Effect_02) == 0x0004B8, "Member 'UFieldAction_Command_C::Img_Effect_02' has a wrong offset!");

}

