#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldMemo

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FieldMemo.FieldMemo_C
// 0x0020 (0x03E8 - 0x03C8)
class UFieldMemo_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_00;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_187;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FieldMemo_C">();
	}
	static class UFieldMemo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFieldMemo_C>();
	}
};
static_assert(alignof(UFieldMemo_C) == 0x000008, "Wrong alignment on UFieldMemo_C");
static_assert(sizeof(UFieldMemo_C) == 0x0003E8, "Wrong size on UFieldMemo_C");
static_assert(offsetof(UFieldMemo_C, Out) == 0x0003C8, "Member 'UFieldMemo_C::Out' has a wrong offset!");
static_assert(offsetof(UFieldMemo_C, In) == 0x0003D0, "Member 'UFieldMemo_C::In' has a wrong offset!");
static_assert(offsetof(UFieldMemo_C, Billboard_00) == 0x0003D8, "Member 'UFieldMemo_C::Billboard_00' has a wrong offset!");
static_assert(offsetof(UFieldMemo_C, EndImage_187) == 0x0003E0, "Member 'UFieldMemo_C::EndImage_187' has a wrong offset!");

}

