#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldActionAlternately

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FieldActionAlternately.FieldActionAlternately_C
// 0x0018 (0x03E0 - 0x03C8)
class UFieldActionAlternately_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       In;                                                // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFieldActionAlternately_Btn_C*          Left_Btn;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFieldActionAlternately_Btn_C*          Right_Btn;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FieldActionAlternately_C">();
	}
	static class UFieldActionAlternately_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFieldActionAlternately_C>();
	}
};
static_assert(alignof(UFieldActionAlternately_C) == 0x000008, "Wrong alignment on UFieldActionAlternately_C");
static_assert(sizeof(UFieldActionAlternately_C) == 0x0003E0, "Wrong size on UFieldActionAlternately_C");
static_assert(offsetof(UFieldActionAlternately_C, In) == 0x0003C8, "Member 'UFieldActionAlternately_C::In' has a wrong offset!");
static_assert(offsetof(UFieldActionAlternately_C, Left_Btn) == 0x0003D0, "Member 'UFieldActionAlternately_C::Left_Btn' has a wrong offset!");
static_assert(offsetof(UFieldActionAlternately_C, Right_Btn) == 0x0003D8, "Member 'UFieldActionAlternately_C::Right_Btn' has a wrong offset!");

}

