#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldTargetRange_Arrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FieldTargetRange_Arrow.FieldTargetRange_Arrow_C
// 0x0018 (0x03E0 - 0x03C8)
class UFieldTargetRange_Arrow_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Arrow_00;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FieldTargetRange_Arrow(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FieldTargetRange_Arrow_C">();
	}
	static class UFieldTargetRange_Arrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFieldTargetRange_Arrow_C>();
	}
};
static_assert(alignof(UFieldTargetRange_Arrow_C) == 0x000008, "Wrong alignment on UFieldTargetRange_Arrow_C");
static_assert(sizeof(UFieldTargetRange_Arrow_C) == 0x0003E0, "Wrong size on UFieldTargetRange_Arrow_C");
static_assert(offsetof(UFieldTargetRange_Arrow_C, UberGraphFrame) == 0x0003C8, "Member 'UFieldTargetRange_Arrow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFieldTargetRange_Arrow_C, Loop) == 0x0003D0, "Member 'UFieldTargetRange_Arrow_C::Loop' has a wrong offset!");
static_assert(offsetof(UFieldTargetRange_Arrow_C, Arrow_00) == 0x0003D8, "Member 'UFieldTargetRange_Arrow_C::Arrow_00' has a wrong offset!");

}

