#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldQuestIcon

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FieldQuestIcon.FieldQuestIcon_C
// 0x0040 (0x0420 - 0x03E0)
class UFieldQuestIcon_C final : public UEndFieldQuestIcon
{
public:
	class UWidgetAnimation*                       Favor_up;                                          // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Favor_7;                                           // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Favor_6;                                           // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Icon_Effect_1;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Effect_2;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Effect_3;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_QuestIcon;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FieldQuestIcon_C">();
	}
	static class UFieldQuestIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFieldQuestIcon_C>();
	}
};
static_assert(alignof(UFieldQuestIcon_C) == 0x000008, "Wrong alignment on UFieldQuestIcon_C");
static_assert(sizeof(UFieldQuestIcon_C) == 0x000420, "Wrong size on UFieldQuestIcon_C");
static_assert(offsetof(UFieldQuestIcon_C, Favor_up) == 0x0003E0, "Member 'UFieldQuestIcon_C::Favor_up' has a wrong offset!");
static_assert(offsetof(UFieldQuestIcon_C, Favor_7) == 0x0003E8, "Member 'UFieldQuestIcon_C::Favor_7' has a wrong offset!");
static_assert(offsetof(UFieldQuestIcon_C, Favor_6) == 0x0003F0, "Member 'UFieldQuestIcon_C::Favor_6' has a wrong offset!");
static_assert(offsetof(UFieldQuestIcon_C, Icon_Effect_1) == 0x0003F8, "Member 'UFieldQuestIcon_C::Icon_Effect_1' has a wrong offset!");
static_assert(offsetof(UFieldQuestIcon_C, Icon_Effect_2) == 0x000400, "Member 'UFieldQuestIcon_C::Icon_Effect_2' has a wrong offset!");
static_assert(offsetof(UFieldQuestIcon_C, Icon_Effect_3) == 0x000408, "Member 'UFieldQuestIcon_C::Icon_Effect_3' has a wrong offset!");
static_assert(offsetof(UFieldQuestIcon_C, Img_Line) == 0x000410, "Member 'UFieldQuestIcon_C::Img_Line' has a wrong offset!");
static_assert(offsetof(UFieldQuestIcon_C, Ims_QuestIcon) == 0x000418, "Member 'UFieldQuestIcon_C::Ims_QuestIcon' has a wrong offset!");

}

