#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldTargetSearch_02_Icon

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FieldTargetSearch_02_Icon.FieldTargetSearch_02_Icon_C
// 0x0018 (0x03E0 - 0x03C8)
class UFieldTargetSearch_02_Icon_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       In;                                                // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Icon_00;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Icon;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FieldTargetSearch_02_Icon_C">();
	}
	static class UFieldTargetSearch_02_Icon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFieldTargetSearch_02_Icon_C>();
	}
};
static_assert(alignof(UFieldTargetSearch_02_Icon_C) == 0x000008, "Wrong alignment on UFieldTargetSearch_02_Icon_C");
static_assert(sizeof(UFieldTargetSearch_02_Icon_C) == 0x0003E0, "Wrong size on UFieldTargetSearch_02_Icon_C");
static_assert(offsetof(UFieldTargetSearch_02_Icon_C, In) == 0x0003C8, "Member 'UFieldTargetSearch_02_Icon_C::In' has a wrong offset!");
static_assert(offsetof(UFieldTargetSearch_02_Icon_C, Icon_00) == 0x0003D0, "Member 'UFieldTargetSearch_02_Icon_C::Icon_00' has a wrong offset!");
static_assert(offsetof(UFieldTargetSearch_02_Icon_C, Ims_Icon) == 0x0003D8, "Member 'UFieldTargetSearch_02_Icon_C::Ims_Icon' has a wrong offset!");

}

