#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldActionAlternately_Btn

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FieldActionAlternately_Btn.FieldActionAlternately_Btn_C
// 0x0018 (0x03E0 - 0x03C8)
class UFieldActionAlternately_Btn_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Off;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       On;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              BG_00;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FieldActionAlternately_Btn_C">();
	}
	static class UFieldActionAlternately_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFieldActionAlternately_Btn_C>();
	}
};
static_assert(alignof(UFieldActionAlternately_Btn_C) == 0x000008, "Wrong alignment on UFieldActionAlternately_Btn_C");
static_assert(sizeof(UFieldActionAlternately_Btn_C) == 0x0003E0, "Wrong size on UFieldActionAlternately_Btn_C");
static_assert(offsetof(UFieldActionAlternately_Btn_C, Off) == 0x0003C8, "Member 'UFieldActionAlternately_Btn_C::Off' has a wrong offset!");
static_assert(offsetof(UFieldActionAlternately_Btn_C, On) == 0x0003D0, "Member 'UFieldActionAlternately_Btn_C::On' has a wrong offset!");
static_assert(offsetof(UFieldActionAlternately_Btn_C, BG_00) == 0x0003D8, "Member 'UFieldActionAlternately_Btn_C::BG_00' has a wrong offset!");

}

