#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Field_Card_BouterRank

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Field_Card_BouterRank.Field_Card_BouterRank_C
// 0x0018 (0x03E0 - 0x03C8)
class UField_Card_BouterRank_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMainMenu_Card_BouterRank_C*            BouterRank;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Field_Card_BouterRank_C">();
	}
	static class UField_Card_BouterRank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UField_Card_BouterRank_C>();
	}
};
static_assert(alignof(UField_Card_BouterRank_C) == 0x000008, "Wrong alignment on UField_Card_BouterRank_C");
static_assert(sizeof(UField_Card_BouterRank_C) == 0x0003E0, "Wrong size on UField_Card_BouterRank_C");
static_assert(offsetof(UField_Card_BouterRank_C, Out) == 0x0003C8, "Member 'UField_Card_BouterRank_C::Out' has a wrong offset!");
static_assert(offsetof(UField_Card_BouterRank_C, Menu_In) == 0x0003D0, "Member 'UField_Card_BouterRank_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UField_Card_BouterRank_C, BouterRank) == 0x0003D8, "Member 'UField_Card_BouterRank_C::BouterRank' has a wrong offset!");

}

