#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Foot

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Foot.Foot_C
// 0x0040 (0x0450 - 0x0410)
class UFoot_C final : public UEndFootWindow
{
public:
	class UWidgetAnimation*                       Guide_In;                                          // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_62;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Left;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Left_s;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Right;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Txt_Bg;                                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Foot_C">();
	}
	static class UFoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFoot_C>();
	}
};
static_assert(alignof(UFoot_C) == 0x000008, "Wrong alignment on UFoot_C");
static_assert(sizeof(UFoot_C) == 0x000450, "Wrong size on UFoot_C");
static_assert(offsetof(UFoot_C, Guide_In) == 0x000410, "Member 'UFoot_C::Guide_In' has a wrong offset!");
static_assert(offsetof(UFoot_C, In) == 0x000418, "Member 'UFoot_C::In' has a wrong offset!");
static_assert(offsetof(UFoot_C, Base) == 0x000420, "Member 'UFoot_C::Base' has a wrong offset!");
static_assert(offsetof(UFoot_C, EndImage_62) == 0x000428, "Member 'UFoot_C::EndImage_62' has a wrong offset!");
static_assert(offsetof(UFoot_C, Line_Left) == 0x000430, "Member 'UFoot_C::Line_Left' has a wrong offset!");
static_assert(offsetof(UFoot_C, Line_Left_s) == 0x000438, "Member 'UFoot_C::Line_Left_s' has a wrong offset!");
static_assert(offsetof(UFoot_C, Line_Right) == 0x000440, "Member 'UFoot_C::Line_Right' has a wrong offset!");
static_assert(offsetof(UFoot_C, Txt_Bg) == 0x000448, "Member 'UFoot_C::Txt_Bg' has a wrong offset!");

}

