#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Formation_Result_Top

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Formation_Result_Top.Formation_Result_Top_C
// 0x0018 (0x03E0 - 0x03C8)
class UFormation_Result_Top_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       In;                                                // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFormation_Result_Bad_C*                Result_Bad;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFormation_Result_Good_C*               Result_Good;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Formation_Result_Top_C">();
	}
	static class UFormation_Result_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFormation_Result_Top_C>();
	}
};
static_assert(alignof(UFormation_Result_Top_C) == 0x000008, "Wrong alignment on UFormation_Result_Top_C");
static_assert(sizeof(UFormation_Result_Top_C) == 0x0003E0, "Wrong size on UFormation_Result_Top_C");
static_assert(offsetof(UFormation_Result_Top_C, In) == 0x0003C8, "Member 'UFormation_Result_Top_C::In' has a wrong offset!");
static_assert(offsetof(UFormation_Result_Top_C, Result_Bad) == 0x0003D0, "Member 'UFormation_Result_Top_C::Result_Bad' has a wrong offset!");
static_assert(offsetof(UFormation_Result_Top_C, Result_Good) == 0x0003D8, "Member 'UFormation_Result_Top_C::Result_Good' has a wrong offset!");

}

