#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Formation_BtnTxt

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Formation_BtnTxt.Formation_BtnTxt_C
// 0x0028 (0x03F0 - 0x03C8)
class UFormation_BtnTxt_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Mash;                                              // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hold;                                              // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Formation_BtnTxt_C">();
	}
	static class UFormation_BtnTxt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFormation_BtnTxt_C>();
	}
};
static_assert(alignof(UFormation_BtnTxt_C) == 0x000008, "Wrong alignment on UFormation_BtnTxt_C");
static_assert(sizeof(UFormation_BtnTxt_C) == 0x0003F0, "Wrong size on UFormation_BtnTxt_C");
static_assert(offsetof(UFormation_BtnTxt_C, Out) == 0x0003C8, "Member 'UFormation_BtnTxt_C::Out' has a wrong offset!");
static_assert(offsetof(UFormation_BtnTxt_C, In) == 0x0003D0, "Member 'UFormation_BtnTxt_C::In' has a wrong offset!");
static_assert(offsetof(UFormation_BtnTxt_C, Mash) == 0x0003D8, "Member 'UFormation_BtnTxt_C::Mash' has a wrong offset!");
static_assert(offsetof(UFormation_BtnTxt_C, Hold) == 0x0003E0, "Member 'UFormation_BtnTxt_C::Hold' has a wrong offset!");
static_assert(offsetof(UFormation_BtnTxt_C, Base) == 0x0003E8, "Member 'UFormation_BtnTxt_C::Base' has a wrong offset!");

}

