#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Formation_Top

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Formation_Top.Formation_Top_C
// 0x00C8 (0x04E8 - 0x0420)
class UFormation_Top_C final : public UEndSoldierFormationMenu
{
public:
	class UWidgetAnimation*                       FormationBouns;                                    // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_NoPreview;                                      // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NoPreview;                                         // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_4;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BounsBase;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_64;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFormation_Leader_C*                    Formation_Leader;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon1;                                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon2;                                             // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCom_Loading_Simple2_C*                 Loading_Simple;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LogoBg;                                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFormation_Preview_C*                   Preview1;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFormation_Preview_C*                   Preview2;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFormation_Preview_C*                   Preview3;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow1;                                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow1_1;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Message;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title_Edit;                                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title_Reserve;                                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              UnderLine;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Formation_Top_C">();
	}
	static class UFormation_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFormation_Top_C>();
	}
};
static_assert(alignof(UFormation_Top_C) == 0x000008, "Wrong alignment on UFormation_Top_C");
static_assert(sizeof(UFormation_Top_C) == 0x0004E8, "Wrong size on UFormation_Top_C");
static_assert(offsetof(UFormation_Top_C, FormationBouns) == 0x000420, "Member 'UFormation_Top_C::FormationBouns' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, In_NoPreview) == 0x000428, "Member 'UFormation_Top_C::In_NoPreview' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, NoPreview) == 0x000430, "Member 'UFormation_Top_C::NoPreview' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, In) == 0x000438, "Member 'UFormation_Top_C::In' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Base) == 0x000440, "Member 'UFormation_Top_C::Base' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Base1_4) == 0x000448, "Member 'UFormation_Top_C::Base1_4' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Base2) == 0x000450, "Member 'UFormation_Top_C::Base2' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Bg) == 0x000458, "Member 'UFormation_Top_C::Bg' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, BounsBase) == 0x000460, "Member 'UFormation_Top_C::BounsBase' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, EndImage_64) == 0x000468, "Member 'UFormation_Top_C::EndImage_64' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Formation_Leader) == 0x000470, "Member 'UFormation_Top_C::Formation_Leader' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Frame) == 0x000478, "Member 'UFormation_Top_C::Frame' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Icon1) == 0x000480, "Member 'UFormation_Top_C::Icon1' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Icon2) == 0x000488, "Member 'UFormation_Top_C::Icon2' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Loading_Simple) == 0x000490, "Member 'UFormation_Top_C::Loading_Simple' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, LogoBg) == 0x000498, "Member 'UFormation_Top_C::LogoBg' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Preview1) == 0x0004A0, "Member 'UFormation_Top_C::Preview1' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Preview2) == 0x0004A8, "Member 'UFormation_Top_C::Preview2' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Preview3) == 0x0004B0, "Member 'UFormation_Top_C::Preview3' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Shadow1) == 0x0004B8, "Member 'UFormation_Top_C::Shadow1' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Shadow1_1) == 0x0004C0, "Member 'UFormation_Top_C::Shadow1_1' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Txt_Message) == 0x0004C8, "Member 'UFormation_Top_C::Txt_Message' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Txt_Title_Edit) == 0x0004D0, "Member 'UFormation_Top_C::Txt_Title_Edit' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, Txt_Title_Reserve) == 0x0004D8, "Member 'UFormation_Top_C::Txt_Title_Reserve' has a wrong offset!");
static_assert(offsetof(UFormation_Top_C, UnderLine) == 0x0004E0, "Member 'UFormation_Top_C::UnderLine' has a wrong offset!");

}

