#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Formation_EditBtn

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Formation_EditBtn.Formation_EditBtn_C
// 0x0060 (0x0428 - 0x03C8)
class UFormation_EditBtn_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       NoFormationBouns;                                  // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FormationBouns;                                    // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Cursor_Frame;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFormation_Cursor_C*                    Formation_Cursor;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Change;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Link_Frame;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Link_Line;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           ThumbnailSet;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Unit;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Formation_EditBtn_C">();
	}
	static class UFormation_EditBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFormation_EditBtn_C>();
	}
};
static_assert(alignof(UFormation_EditBtn_C) == 0x000008, "Wrong alignment on UFormation_EditBtn_C");
static_assert(sizeof(UFormation_EditBtn_C) == 0x000428, "Wrong size on UFormation_EditBtn_C");
static_assert(offsetof(UFormation_EditBtn_C, NoFormationBouns) == 0x0003C8, "Member 'UFormation_EditBtn_C::NoFormationBouns' has a wrong offset!");
static_assert(offsetof(UFormation_EditBtn_C, FormationBouns) == 0x0003D0, "Member 'UFormation_EditBtn_C::FormationBouns' has a wrong offset!");
static_assert(offsetof(UFormation_EditBtn_C, Selected) == 0x0003D8, "Member 'UFormation_EditBtn_C::Selected' has a wrong offset!");
static_assert(offsetof(UFormation_EditBtn_C, Normal) == 0x0003E0, "Member 'UFormation_EditBtn_C::Normal' has a wrong offset!");
static_assert(offsetof(UFormation_EditBtn_C, Hover) == 0x0003E8, "Member 'UFormation_EditBtn_C::Hover' has a wrong offset!");
static_assert(offsetof(UFormation_EditBtn_C, Cursor_Frame) == 0x0003F0, "Member 'UFormation_EditBtn_C::Cursor_Frame' has a wrong offset!");
static_assert(offsetof(UFormation_EditBtn_C, Formation_Cursor) == 0x0003F8, "Member 'UFormation_EditBtn_C::Formation_Cursor' has a wrong offset!");
static_assert(offsetof(UFormation_EditBtn_C, Icon_Change) == 0x000400, "Member 'UFormation_EditBtn_C::Icon_Change' has a wrong offset!");
static_assert(offsetof(UFormation_EditBtn_C, Link_Frame) == 0x000408, "Member 'UFormation_EditBtn_C::Link_Frame' has a wrong offset!");
static_assert(offsetof(UFormation_EditBtn_C, Link_Line) == 0x000410, "Member 'UFormation_EditBtn_C::Link_Line' has a wrong offset!");
static_assert(offsetof(UFormation_EditBtn_C, ThumbnailSet) == 0x000418, "Member 'UFormation_EditBtn_C::ThumbnailSet' has a wrong offset!");
static_assert(offsetof(UFormation_EditBtn_C, Txt_Unit) == 0x000420, "Member 'UFormation_EditBtn_C::Txt_Unit' has a wrong offset!");

}

