#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FriendStatus

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FriendStatus.FriendStatus_C
// 0x0058 (0x0440 - 0x03E8)
class UFriendStatus_C final : public UEndBattleFriendStatusIcon
{
public:
	class UEndGauge*                              Gauge_HP;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_00;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_01;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_02;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_03;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_04;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_05;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_HPGauge_Base;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_NameBase;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_Icon_Status;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_Status;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FriendStatus_C">();
	}
	static class UFriendStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFriendStatus_C>();
	}
};
static_assert(alignof(UFriendStatus_C) == 0x000008, "Wrong alignment on UFriendStatus_C");
static_assert(sizeof(UFriendStatus_C) == 0x000440, "Wrong size on UFriendStatus_C");
static_assert(offsetof(UFriendStatus_C, Gauge_HP) == 0x0003E8, "Member 'UFriendStatus_C::Gauge_HP' has a wrong offset!");
static_assert(offsetof(UFriendStatus_C, Icon_Status_00) == 0x0003F0, "Member 'UFriendStatus_C::Icon_Status_00' has a wrong offset!");
static_assert(offsetof(UFriendStatus_C, Icon_Status_01) == 0x0003F8, "Member 'UFriendStatus_C::Icon_Status_01' has a wrong offset!");
static_assert(offsetof(UFriendStatus_C, Icon_Status_02) == 0x000400, "Member 'UFriendStatus_C::Icon_Status_02' has a wrong offset!");
static_assert(offsetof(UFriendStatus_C, Icon_Status_03) == 0x000408, "Member 'UFriendStatus_C::Icon_Status_03' has a wrong offset!");
static_assert(offsetof(UFriendStatus_C, Icon_Status_04) == 0x000410, "Member 'UFriendStatus_C::Icon_Status_04' has a wrong offset!");
static_assert(offsetof(UFriendStatus_C, Icon_Status_05) == 0x000418, "Member 'UFriendStatus_C::Icon_Status_05' has a wrong offset!");
static_assert(offsetof(UFriendStatus_C, Img_HPGauge_Base) == 0x000420, "Member 'UFriendStatus_C::Img_HPGauge_Base' has a wrong offset!");
static_assert(offsetof(UFriendStatus_C, Img_NameBase) == 0x000428, "Member 'UFriendStatus_C::Img_NameBase' has a wrong offset!");
static_assert(offsetof(UFriendStatus_C, Pnl_Icon_Status) == 0x000430, "Member 'UFriendStatus_C::Pnl_Icon_Status' has a wrong offset!");
static_assert(offsetof(UFriendStatus_C, Pnl_Status) == 0x000438, "Member 'UFriendStatus_C::Pnl_Status' has a wrong offset!");

}

