#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Icon_Update

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Icon_Update.Icon_Update_C
// 0x0028 (0x03F0 - 0x03C8)
class UIcon_Update_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Check_Loop;                                        // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_Check;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Check_1;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Update;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Icon_Update_C">();
	}
	static class UIcon_Update_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIcon_Update_C>();
	}
};
static_assert(alignof(UIcon_Update_C) == 0x000008, "Wrong alignment on UIcon_Update_C");
static_assert(sizeof(UIcon_Update_C) == 0x0003F0, "Wrong size on UIcon_Update_C");
static_assert(offsetof(UIcon_Update_C, Check_Loop) == 0x0003C8, "Member 'UIcon_Update_C::Check_Loop' has a wrong offset!");
static_assert(offsetof(UIcon_Update_C, Loop) == 0x0003D0, "Member 'UIcon_Update_C::Loop' has a wrong offset!");
static_assert(offsetof(UIcon_Update_C, Img_Check) == 0x0003D8, "Member 'UIcon_Update_C::Img_Check' has a wrong offset!");
static_assert(offsetof(UIcon_Update_C, Img_Check_1) == 0x0003E0, "Member 'UIcon_Update_C::Img_Check_1' has a wrong offset!");
static_assert(offsetof(UIcon_Update_C, Img_Update) == 0x0003E8, "Member 'UIcon_Update_C::Img_Update' has a wrong offset!");

}

