#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Icon_BurstExtend

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Icon_BurstExtend.Icon_BurstExtend_C
// 0x0028 (0x03F0 - 0x03C8)
class UIcon_BurstExtend_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Hit;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              BG_00;                                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_00;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_01;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_00;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Icon_BurstExtend_C">();
	}
	static class UIcon_BurstExtend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIcon_BurstExtend_C>();
	}
};
static_assert(alignof(UIcon_BurstExtend_C) == 0x000008, "Wrong alignment on UIcon_BurstExtend_C");
static_assert(sizeof(UIcon_BurstExtend_C) == 0x0003F0, "Wrong size on UIcon_BurstExtend_C");
static_assert(offsetof(UIcon_BurstExtend_C, Hit) == 0x0003C8, "Member 'UIcon_BurstExtend_C::Hit' has a wrong offset!");
static_assert(offsetof(UIcon_BurstExtend_C, BG_00) == 0x0003D0, "Member 'UIcon_BurstExtend_C::BG_00' has a wrong offset!");
static_assert(offsetof(UIcon_BurstExtend_C, Effect_00) == 0x0003D8, "Member 'UIcon_BurstExtend_C::Effect_00' has a wrong offset!");
static_assert(offsetof(UIcon_BurstExtend_C, Effect_01) == 0x0003E0, "Member 'UIcon_BurstExtend_C::Effect_01' has a wrong offset!");
static_assert(offsetof(UIcon_BurstExtend_C, Icon_00) == 0x0003E8, "Member 'UIcon_BurstExtend_C::Icon_00' has a wrong offset!");

}

