#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Icon_Arrow_Compare

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Icon_Arrow_Compare.Icon_Arrow_Compare_C
// 0x0020 (0x03E8 - 0x03C8)
class UIcon_Arrow_Compare_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Down_Loop;                                         // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Up_Loop;                                           // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Arrow;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Icon_Arrow_Compare(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Icon_Arrow_Compare_C">();
	}
	static class UIcon_Arrow_Compare_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIcon_Arrow_Compare_C>();
	}
};
static_assert(alignof(UIcon_Arrow_Compare_C) == 0x000008, "Wrong alignment on UIcon_Arrow_Compare_C");
static_assert(sizeof(UIcon_Arrow_Compare_C) == 0x0003E8, "Wrong size on UIcon_Arrow_Compare_C");
static_assert(offsetof(UIcon_Arrow_Compare_C, UberGraphFrame) == 0x0003C8, "Member 'UIcon_Arrow_Compare_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIcon_Arrow_Compare_C, Down_Loop) == 0x0003D0, "Member 'UIcon_Arrow_Compare_C::Down_Loop' has a wrong offset!");
static_assert(offsetof(UIcon_Arrow_Compare_C, Up_Loop) == 0x0003D8, "Member 'UIcon_Arrow_Compare_C::Up_Loop' has a wrong offset!");
static_assert(offsetof(UIcon_Arrow_Compare_C, Icon_Arrow) == 0x0003E0, "Member 'UIcon_Arrow_Compare_C::Icon_Arrow' has a wrong offset!");

}

