#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Icon_Category

#include "Basic.hpp"


namespace SDK::Params
{

// Function Icon_Category.Icon_Category_C.ExecuteUbergraph_Icon_Category
// 0x0008 (0x0008 - 0x0000)
struct Icon_Category_C_ExecuteUbergraph_Icon_Category final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_2;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Icon_Category_C_ExecuteUbergraph_Icon_Category) == 0x000004, "Wrong alignment on Icon_Category_C_ExecuteUbergraph_Icon_Category");
static_assert(sizeof(Icon_Category_C_ExecuteUbergraph_Icon_Category) == 0x000008, "Wrong size on Icon_Category_C_ExecuteUbergraph_Icon_Category");
static_assert(offsetof(Icon_Category_C_ExecuteUbergraph_Icon_Category, EntryPoint) == 0x000000, "Member 'Icon_Category_C_ExecuteUbergraph_Icon_Category::EntryPoint' has a wrong offset!");
static_assert(offsetof(Icon_Category_C_ExecuteUbergraph_Icon_Category, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'Icon_Category_C_ExecuteUbergraph_Icon_Category::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Icon_Category_C_ExecuteUbergraph_Icon_Category, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000005, "Member 'Icon_Category_C_ExecuteUbergraph_Icon_Category::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Icon_Category_C_ExecuteUbergraph_Icon_Category, CallFunc_PlayAnimationByName_ReturnValue_2) == 0x000006, "Member 'Icon_Category_C_ExecuteUbergraph_Icon_Category::CallFunc_PlayAnimationByName_ReturnValue_2' has a wrong offset!");

}

