#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Jukebox_Menu_Cell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Jukebox_Menu_Cell.Jukebox_Menu_Cell_C
// 0x0028 (0x03F0 - 0x03C8)
class UJukebox_Menu_Cell_C final : public UEndUserWidget
{
public:
	class UEndButton*                             Btn_List;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Now_C*                   Icon_Now;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Quest;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Record;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Name;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Jukebox_Menu_Cell_C">();
	}
	static class UJukebox_Menu_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJukebox_Menu_Cell_C>();
	}
};
static_assert(alignof(UJukebox_Menu_Cell_C) == 0x000008, "Wrong alignment on UJukebox_Menu_Cell_C");
static_assert(sizeof(UJukebox_Menu_Cell_C) == 0x0003F0, "Wrong size on UJukebox_Menu_Cell_C");
static_assert(offsetof(UJukebox_Menu_Cell_C, Btn_List) == 0x0003C8, "Member 'UJukebox_Menu_Cell_C::Btn_List' has a wrong offset!");
static_assert(offsetof(UJukebox_Menu_Cell_C, Icon_Now) == 0x0003D0, "Member 'UJukebox_Menu_Cell_C::Icon_Now' has a wrong offset!");
static_assert(offsetof(UJukebox_Menu_Cell_C, Icon_Quest) == 0x0003D8, "Member 'UJukebox_Menu_Cell_C::Icon_Quest' has a wrong offset!");
static_assert(offsetof(UJukebox_Menu_Cell_C, Icon_Record) == 0x0003E0, "Member 'UJukebox_Menu_Cell_C::Icon_Record' has a wrong offset!");
static_assert(offsetof(UJukebox_Menu_Cell_C, Txt_Name) == 0x0003E8, "Member 'UJukebox_Menu_Cell_C::Txt_Name' has a wrong offset!");

}

