#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KBDRt

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "BonamikRt_structs.hpp"
#include "KBDRt_structs.hpp"


namespace SDK
{

// Class KBDRt.SQEX_AnimNotify_Bonamik_Enable
// 0x0018 (0x0050 - 0x0038)
class USQEX_AnimNotify_Bonamik_Enable final : public UAnimNotify
{
public:
	TArray<class FName>                           m_Groups;                                          // 0x0038(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          m_On;                                              // 0x0048(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotify_Bonamik_Enable">();
	}
	static class USQEX_AnimNotify_Bonamik_Enable* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotify_Bonamik_Enable>();
	}
};
static_assert(alignof(USQEX_AnimNotify_Bonamik_Enable) == 0x000008, "Wrong alignment on USQEX_AnimNotify_Bonamik_Enable");
static_assert(sizeof(USQEX_AnimNotify_Bonamik_Enable) == 0x000050, "Wrong size on USQEX_AnimNotify_Bonamik_Enable");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_Enable, m_Groups) == 0x000038, "Member 'USQEX_AnimNotify_Bonamik_Enable::m_Groups' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_Enable, m_On) == 0x000048, "Member 'USQEX_AnimNotify_Bonamik_Enable::m_On' has a wrong offset!");

// Class KBDRt.SQEX_AnimNotify_Bonamik_EnableGroundCollision
// 0x0018 (0x0050 - 0x0038)
class USQEX_AnimNotify_Bonamik_EnableGroundCollision final : public UAnimNotify
{
public:
	bool                                          m_Enable;                                          // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           m_Groups;                                          // 0x0040(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotify_Bonamik_EnableGroundCollision">();
	}
	static class USQEX_AnimNotify_Bonamik_EnableGroundCollision* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotify_Bonamik_EnableGroundCollision>();
	}
};
static_assert(alignof(USQEX_AnimNotify_Bonamik_EnableGroundCollision) == 0x000008, "Wrong alignment on USQEX_AnimNotify_Bonamik_EnableGroundCollision");
static_assert(sizeof(USQEX_AnimNotify_Bonamik_EnableGroundCollision) == 0x000050, "Wrong size on USQEX_AnimNotify_Bonamik_EnableGroundCollision");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_EnableGroundCollision, m_Enable) == 0x000038, "Member 'USQEX_AnimNotify_Bonamik_EnableGroundCollision::m_Enable' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_EnableGroundCollision, m_Groups) == 0x000040, "Member 'USQEX_AnimNotify_Bonamik_EnableGroundCollision::m_Groups' has a wrong offset!");

// Class KBDRt.SQEX_AnimNotify_Bonamik_Ensemble
// 0x0008 (0x0040 - 0x0038)
class USQEX_AnimNotify_Bonamik_Ensemble final : public UAnimNotify
{
public:
	class FName                                   EnsembleName;                                      // 0x0038(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotify_Bonamik_Ensemble">();
	}
	static class USQEX_AnimNotify_Bonamik_Ensemble* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotify_Bonamik_Ensemble>();
	}
};
static_assert(alignof(USQEX_AnimNotify_Bonamik_Ensemble) == 0x000008, "Wrong alignment on USQEX_AnimNotify_Bonamik_Ensemble");
static_assert(sizeof(USQEX_AnimNotify_Bonamik_Ensemble) == 0x000040, "Wrong size on USQEX_AnimNotify_Bonamik_Ensemble");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_Ensemble, EnsembleName) == 0x000038, "Member 'USQEX_AnimNotify_Bonamik_Ensemble::EnsembleName' has a wrong offset!");

// Class KBDRt.SQEX_AnimNotify_Bonamik_ResetAndPreRoll
// 0x0008 (0x0040 - 0x0038)
class USQEX_AnimNotify_Bonamik_ResetAndPreRoll final : public UAnimNotify
{
public:
	bool                                          m_Reset;                                           // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m_PreRoll;                                         // 0x003C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotify_Bonamik_ResetAndPreRoll">();
	}
	static class USQEX_AnimNotify_Bonamik_ResetAndPreRoll* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotify_Bonamik_ResetAndPreRoll>();
	}
};
static_assert(alignof(USQEX_AnimNotify_Bonamik_ResetAndPreRoll) == 0x000008, "Wrong alignment on USQEX_AnimNotify_Bonamik_ResetAndPreRoll");
static_assert(sizeof(USQEX_AnimNotify_Bonamik_ResetAndPreRoll) == 0x000040, "Wrong size on USQEX_AnimNotify_Bonamik_ResetAndPreRoll");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ResetAndPreRoll, m_Reset) == 0x000038, "Member 'USQEX_AnimNotify_Bonamik_ResetAndPreRoll::m_Reset' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ResetAndPreRoll, m_PreRoll) == 0x00003C, "Member 'USQEX_AnimNotify_Bonamik_ResetAndPreRoll::m_PreRoll' has a wrong offset!");

// Class KBDRt.SQEX_AnimNotify_Bonamik_RestoreDefaultParams
// 0x0000 (0x0038 - 0x0038)
class USQEX_AnimNotify_Bonamik_RestoreDefaultParams final : public UAnimNotify
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotify_Bonamik_RestoreDefaultParams">();
	}
	static class USQEX_AnimNotify_Bonamik_RestoreDefaultParams* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotify_Bonamik_RestoreDefaultParams>();
	}
};
static_assert(alignof(USQEX_AnimNotify_Bonamik_RestoreDefaultParams) == 0x000008, "Wrong alignment on USQEX_AnimNotify_Bonamik_RestoreDefaultParams");
static_assert(sizeof(USQEX_AnimNotify_Bonamik_RestoreDefaultParams) == 0x000038, "Wrong size on USQEX_AnimNotify_Bonamik_RestoreDefaultParams");

// Class KBDRt.SQEX_AnimNotify_Bonamik_ScaleGroupParams
// 0x00D0 (0x0108 - 0x0038)
class USQEX_AnimNotify_Bonamik_ScaleGroupParams final : public UAnimNotify
{
public:
	TArray<class FName>                           m_Groups;                                          // 0x0038(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          m_ChangeInnerCone;                                 // 0x0048(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_InnerConeScale;                                  // 0x004C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeOuterCone;                                 // 0x0050(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_OuterConeScale;                                  // 0x0054(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeLocalForce;                                // 0x0058(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_LocalForceScale;                                 // 0x005C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeWindScale;                                 // 0x0060(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupWindScale;                                  // 0x0064(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeMassScale;                                 // 0x0068(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupMassScale;                                  // 0x006C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeParkRate;                                  // 0x0070(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupParkRateScale;                              // 0x0074(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeActorFictitiousForce;                      // 0x0078(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupActorFictitiousForceScale;                  // 0x007C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeActorCentrifugal;                          // 0x0080(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupActorCentrifugalScale;                      // 0x0084(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeActorImpulse;                              // 0x0088(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupActorImpulseScale;                          // 0x008C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeActorRotDrag;                              // 0x0090(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupActorRotDragScale;                          // 0x0094(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeActorTransDrag;                            // 0x0098(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupActorTransDragScale;                        // 0x009C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeChainRootFictitiousForce;                  // 0x00A0(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupChainRootFictitiousForceScale;              // 0x00A4(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeChainRootCentrifugal;                      // 0x00A8(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupChainRootCentrifugalScale;                  // 0x00AC(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeChainRootImpulse;                          // 0x00B0(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupChainRootImpulseScale;                      // 0x00B4(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeChainRootRotDrag;                          // 0x00B8(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupChainRootRotDragScale;                      // 0x00BC(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeChainRootTransDrag;                        // 0x00C0(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupChainRootTransDragScale;                    // 0x00C4(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeBodyDrag;                                  // 0x00C8(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupBodyDragScale;                              // 0x00CC(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeBodyLift;                                  // 0x00D0(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupBodyLiftScale;                              // 0x00D4(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeBodyDamping;                               // 0x00D8(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupBodyDampingScale;                           // 0x00DC(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeBodyConstraintDamping;                     // 0x00E0(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupBodyConstraintDampingScale;                 // 0x00E4(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeBodyVelocityDamping;                       // 0x00E8(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupBodyVelocityDampingScale;                   // 0x00EC(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeBodyRadius;                                // 0x00F0(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupBodyRadiusScale;                            // 0x00F4(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeBodyFriction;                              // 0x00F8(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupBodyFrictionScale;                          // 0x00FC(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeBodyGravity;                               // 0x0100(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupBodyGravityScale;                           // 0x0104(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotify_Bonamik_ScaleGroupParams">();
	}
	static class USQEX_AnimNotify_Bonamik_ScaleGroupParams* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotify_Bonamik_ScaleGroupParams>();
	}
};
static_assert(alignof(USQEX_AnimNotify_Bonamik_ScaleGroupParams) == 0x000008, "Wrong alignment on USQEX_AnimNotify_Bonamik_ScaleGroupParams");
static_assert(sizeof(USQEX_AnimNotify_Bonamik_ScaleGroupParams) == 0x000108, "Wrong size on USQEX_AnimNotify_Bonamik_ScaleGroupParams");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_Groups) == 0x000038, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_Groups' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeInnerCone) == 0x000048, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeInnerCone' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_InnerConeScale) == 0x00004C, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_InnerConeScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeOuterCone) == 0x000050, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeOuterCone' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_OuterConeScale) == 0x000054, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_OuterConeScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeLocalForce) == 0x000058, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeLocalForce' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_LocalForceScale) == 0x00005C, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_LocalForceScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeWindScale) == 0x000060, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeWindScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupWindScale) == 0x000064, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupWindScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeMassScale) == 0x000068, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeMassScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupMassScale) == 0x00006C, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupMassScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeParkRate) == 0x000070, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeParkRate' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupParkRateScale) == 0x000074, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupParkRateScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeActorFictitiousForce) == 0x000078, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeActorFictitiousForce' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupActorFictitiousForceScale) == 0x00007C, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupActorFictitiousForceScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeActorCentrifugal) == 0x000080, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeActorCentrifugal' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupActorCentrifugalScale) == 0x000084, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupActorCentrifugalScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeActorImpulse) == 0x000088, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeActorImpulse' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupActorImpulseScale) == 0x00008C, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupActorImpulseScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeActorRotDrag) == 0x000090, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeActorRotDrag' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupActorRotDragScale) == 0x000094, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupActorRotDragScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeActorTransDrag) == 0x000098, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeActorTransDrag' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupActorTransDragScale) == 0x00009C, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupActorTransDragScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeChainRootFictitiousForce) == 0x0000A0, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeChainRootFictitiousForce' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupChainRootFictitiousForceScale) == 0x0000A4, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupChainRootFictitiousForceScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeChainRootCentrifugal) == 0x0000A8, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeChainRootCentrifugal' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupChainRootCentrifugalScale) == 0x0000AC, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupChainRootCentrifugalScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeChainRootImpulse) == 0x0000B0, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeChainRootImpulse' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupChainRootImpulseScale) == 0x0000B4, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupChainRootImpulseScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeChainRootRotDrag) == 0x0000B8, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeChainRootRotDrag' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupChainRootRotDragScale) == 0x0000BC, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupChainRootRotDragScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeChainRootTransDrag) == 0x0000C0, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeChainRootTransDrag' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupChainRootTransDragScale) == 0x0000C4, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupChainRootTransDragScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeBodyDrag) == 0x0000C8, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeBodyDrag' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupBodyDragScale) == 0x0000CC, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupBodyDragScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeBodyLift) == 0x0000D0, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeBodyLift' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupBodyLiftScale) == 0x0000D4, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupBodyLiftScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeBodyDamping) == 0x0000D8, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeBodyDamping' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupBodyDampingScale) == 0x0000DC, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupBodyDampingScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeBodyConstraintDamping) == 0x0000E0, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeBodyConstraintDamping' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupBodyConstraintDampingScale) == 0x0000E4, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupBodyConstraintDampingScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeBodyVelocityDamping) == 0x0000E8, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeBodyVelocityDamping' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupBodyVelocityDampingScale) == 0x0000EC, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupBodyVelocityDampingScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeBodyRadius) == 0x0000F0, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeBodyRadius' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupBodyRadiusScale) == 0x0000F4, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupBodyRadiusScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeBodyFriction) == 0x0000F8, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeBodyFriction' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupBodyFrictionScale) == 0x0000FC, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupBodyFrictionScale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_ChangeBodyGravity) == 0x000100, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_ChangeBodyGravity' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParams, m_GroupBodyGravityScale) == 0x000104, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParams::m_GroupBodyGravityScale' has a wrong offset!");

// Class KBDRt.SQEX_AnimNotify_Bonamik_ScaleGroupParamsPreset
// 0x0018 (0x0050 - 0x0038)
class USQEX_AnimNotify_Bonamik_ScaleGroupParamsPreset final : public UAnimNotify
{
public:
	TArray<class FName>                           m_Groups;                                          // 0x0038(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class USQEX_Bonamik_ScaleGroupParamsPreset*   m_Preset;                                          // 0x0048(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotify_Bonamik_ScaleGroupParamsPreset">();
	}
	static class USQEX_AnimNotify_Bonamik_ScaleGroupParamsPreset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotify_Bonamik_ScaleGroupParamsPreset>();
	}
};
static_assert(alignof(USQEX_AnimNotify_Bonamik_ScaleGroupParamsPreset) == 0x000008, "Wrong alignment on USQEX_AnimNotify_Bonamik_ScaleGroupParamsPreset");
static_assert(sizeof(USQEX_AnimNotify_Bonamik_ScaleGroupParamsPreset) == 0x000050, "Wrong size on USQEX_AnimNotify_Bonamik_ScaleGroupParamsPreset");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParamsPreset, m_Groups) == 0x000038, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParamsPreset::m_Groups' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_ScaleGroupParamsPreset, m_Preset) == 0x000048, "Member 'USQEX_AnimNotify_Bonamik_ScaleGroupParamsPreset::m_Preset' has a wrong offset!");

// Class KBDRt.SQEX_AnimNotify_Bonamik_SpeedRate
// 0x0008 (0x0040 - 0x0038)
class USQEX_AnimNotify_Bonamik_SpeedRate final : public UAnimNotify
{
public:
	float                                         m_SpeedRate;                                       // 0x0038(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_Time;                                            // 0x003C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotify_Bonamik_SpeedRate">();
	}
	static class USQEX_AnimNotify_Bonamik_SpeedRate* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotify_Bonamik_SpeedRate>();
	}
};
static_assert(alignof(USQEX_AnimNotify_Bonamik_SpeedRate) == 0x000008, "Wrong alignment on USQEX_AnimNotify_Bonamik_SpeedRate");
static_assert(sizeof(USQEX_AnimNotify_Bonamik_SpeedRate) == 0x000040, "Wrong size on USQEX_AnimNotify_Bonamik_SpeedRate");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_SpeedRate, m_SpeedRate) == 0x000038, "Member 'USQEX_AnimNotify_Bonamik_SpeedRate::m_SpeedRate' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_SpeedRate, m_Time) == 0x00003C, "Member 'USQEX_AnimNotify_Bonamik_SpeedRate::m_Time' has a wrong offset!");

// Class KBDRt.SQEX_AnimNotify_Bonamik_Weight
// 0x0018 (0x0050 - 0x0038)
class USQEX_AnimNotify_Bonamik_Weight final : public UAnimNotify
{
public:
	TArray<class FName>                           m_Groups;                                          // 0x0038(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         m_BonamikWeight;                                   // 0x0048(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_Time;                                            // 0x004C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotify_Bonamik_Weight">();
	}
	static class USQEX_AnimNotify_Bonamik_Weight* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotify_Bonamik_Weight>();
	}
};
static_assert(alignof(USQEX_AnimNotify_Bonamik_Weight) == 0x000008, "Wrong alignment on USQEX_AnimNotify_Bonamik_Weight");
static_assert(sizeof(USQEX_AnimNotify_Bonamik_Weight) == 0x000050, "Wrong size on USQEX_AnimNotify_Bonamik_Weight");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_Weight, m_Groups) == 0x000038, "Member 'USQEX_AnimNotify_Bonamik_Weight::m_Groups' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_Weight, m_BonamikWeight) == 0x000048, "Member 'USQEX_AnimNotify_Bonamik_Weight::m_BonamikWeight' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotify_Bonamik_Weight, m_Time) == 0x00004C, "Member 'USQEX_AnimNotify_Bonamik_Weight::m_Time' has a wrong offset!");

// Class KBDRt.SQEX_AnimNotifyState_Bonamik_Enable
// 0x0018 (0x0048 - 0x0030)
class USQEX_AnimNotifyState_Bonamik_Enable final : public UAnimNotifyState
{
public:
	TArray<class FName>                           m_Groups;                                          // 0x0030(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          m_On;                                              // 0x0040(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotifyState_Bonamik_Enable">();
	}
	static class USQEX_AnimNotifyState_Bonamik_Enable* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotifyState_Bonamik_Enable>();
	}
};
static_assert(alignof(USQEX_AnimNotifyState_Bonamik_Enable) == 0x000008, "Wrong alignment on USQEX_AnimNotifyState_Bonamik_Enable");
static_assert(sizeof(USQEX_AnimNotifyState_Bonamik_Enable) == 0x000048, "Wrong size on USQEX_AnimNotifyState_Bonamik_Enable");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_Enable, m_Groups) == 0x000030, "Member 'USQEX_AnimNotifyState_Bonamik_Enable::m_Groups' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_Enable, m_On) == 0x000040, "Member 'USQEX_AnimNotifyState_Bonamik_Enable::m_On' has a wrong offset!");

// Class KBDRt.SQEX_AnimNotifyState_Bonamik_EnableGroundCollision
// 0x0018 (0x0048 - 0x0030)
class USQEX_AnimNotifyState_Bonamik_EnableGroundCollision final : public UAnimNotifyState
{
public:
	bool                                          m_Enable;                                          // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           m_Groups;                                          // 0x0038(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotifyState_Bonamik_EnableGroundCollision">();
	}
	static class USQEX_AnimNotifyState_Bonamik_EnableGroundCollision* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotifyState_Bonamik_EnableGroundCollision>();
	}
};
static_assert(alignof(USQEX_AnimNotifyState_Bonamik_EnableGroundCollision) == 0x000008, "Wrong alignment on USQEX_AnimNotifyState_Bonamik_EnableGroundCollision");
static_assert(sizeof(USQEX_AnimNotifyState_Bonamik_EnableGroundCollision) == 0x000048, "Wrong size on USQEX_AnimNotifyState_Bonamik_EnableGroundCollision");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_EnableGroundCollision, m_Enable) == 0x000030, "Member 'USQEX_AnimNotifyState_Bonamik_EnableGroundCollision::m_Enable' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_EnableGroundCollision, m_Groups) == 0x000038, "Member 'USQEX_AnimNotifyState_Bonamik_EnableGroundCollision::m_Groups' has a wrong offset!");

// Class KBDRt.SQEX_AnimNotifyState_Bonamik_Ensemble
// 0x0008 (0x0038 - 0x0030)
class USQEX_AnimNotifyState_Bonamik_Ensemble final : public UAnimNotifyState
{
public:
	class FName                                   EnsembleName;                                      // 0x0030(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotifyState_Bonamik_Ensemble">();
	}
	static class USQEX_AnimNotifyState_Bonamik_Ensemble* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotifyState_Bonamik_Ensemble>();
	}
};
static_assert(alignof(USQEX_AnimNotifyState_Bonamik_Ensemble) == 0x000008, "Wrong alignment on USQEX_AnimNotifyState_Bonamik_Ensemble");
static_assert(sizeof(USQEX_AnimNotifyState_Bonamik_Ensemble) == 0x000038, "Wrong size on USQEX_AnimNotifyState_Bonamik_Ensemble");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_Ensemble, EnsembleName) == 0x000030, "Member 'USQEX_AnimNotifyState_Bonamik_Ensemble::EnsembleName' has a wrong offset!");

// Class KBDRt.SQEX_AnimNotifyState_Bonamik_Lerp
// 0x0010 (0x0040 - 0x0030)
class USQEX_AnimNotifyState_Bonamik_Lerp final : public UAnimNotifyState
{
public:
	float                                         Lerp;                                              // 0x0030(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0034(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x0038(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotifyState_Bonamik_Lerp">();
	}
	static class USQEX_AnimNotifyState_Bonamik_Lerp* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotifyState_Bonamik_Lerp>();
	}
};
static_assert(alignof(USQEX_AnimNotifyState_Bonamik_Lerp) == 0x000008, "Wrong alignment on USQEX_AnimNotifyState_Bonamik_Lerp");
static_assert(sizeof(USQEX_AnimNotifyState_Bonamik_Lerp) == 0x000040, "Wrong size on USQEX_AnimNotifyState_Bonamik_Lerp");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_Lerp, Lerp) == 0x000030, "Member 'USQEX_AnimNotifyState_Bonamik_Lerp::Lerp' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_Lerp, BlendInTime) == 0x000034, "Member 'USQEX_AnimNotifyState_Bonamik_Lerp::BlendInTime' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_Lerp, BlendOutTime) == 0x000038, "Member 'USQEX_AnimNotifyState_Bonamik_Lerp::BlendOutTime' has a wrong offset!");

// Class KBDRt.SQEX_AnimNotifyState_Bonamik_LocalWind
// 0x0028 (0x0058 - 0x0030)
class USQEX_AnimNotifyState_Bonamik_LocalWind final : public UAnimNotifyState
{
public:
	class USQEX_BonamikWind_Asset*                WindAsset;                                         // 0x0030(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OffsetTranslation;                                 // 0x0038(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OffsetRotation;                                    // 0x0044(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0050(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableWorldWind;                                 // 0x0054(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotifyState_Bonamik_LocalWind">();
	}
	static class USQEX_AnimNotifyState_Bonamik_LocalWind* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotifyState_Bonamik_LocalWind>();
	}
};
static_assert(alignof(USQEX_AnimNotifyState_Bonamik_LocalWind) == 0x000008, "Wrong alignment on USQEX_AnimNotifyState_Bonamik_LocalWind");
static_assert(sizeof(USQEX_AnimNotifyState_Bonamik_LocalWind) == 0x000058, "Wrong size on USQEX_AnimNotifyState_Bonamik_LocalWind");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_LocalWind, WindAsset) == 0x000030, "Member 'USQEX_AnimNotifyState_Bonamik_LocalWind::WindAsset' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_LocalWind, OffsetTranslation) == 0x000038, "Member 'USQEX_AnimNotifyState_Bonamik_LocalWind::OffsetTranslation' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_LocalWind, OffsetRotation) == 0x000044, "Member 'USQEX_AnimNotifyState_Bonamik_LocalWind::OffsetRotation' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_LocalWind, Scale) == 0x000050, "Member 'USQEX_AnimNotifyState_Bonamik_LocalWind::Scale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_LocalWind, bDisableWorldWind) == 0x000054, "Member 'USQEX_AnimNotifyState_Bonamik_LocalWind::bDisableWorldWind' has a wrong offset!");

// Class KBDRt.SQEX_AnimNotifyState_Bonamik_LocalWindDirect
// 0x0280 (0x02B0 - 0x0030)
class USQEX_AnimNotifyState_Bonamik_LocalWindDirect final : public UAnimNotifyState
{
public:
	struct FSQEX_BonamikWind_Desc                 WindDesc;                                          // 0x0030(0x0260)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector                                OffsetTranslation;                                 // 0x0290(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OffsetRotation;                                    // 0x029C(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x02A8(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableWorldWind;                                 // 0x02AC(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotifyState_Bonamik_LocalWindDirect">();
	}
	static class USQEX_AnimNotifyState_Bonamik_LocalWindDirect* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotifyState_Bonamik_LocalWindDirect>();
	}
};
static_assert(alignof(USQEX_AnimNotifyState_Bonamik_LocalWindDirect) == 0x000010, "Wrong alignment on USQEX_AnimNotifyState_Bonamik_LocalWindDirect");
static_assert(sizeof(USQEX_AnimNotifyState_Bonamik_LocalWindDirect) == 0x0002B0, "Wrong size on USQEX_AnimNotifyState_Bonamik_LocalWindDirect");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_LocalWindDirect, WindDesc) == 0x000030, "Member 'USQEX_AnimNotifyState_Bonamik_LocalWindDirect::WindDesc' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_LocalWindDirect, OffsetTranslation) == 0x000290, "Member 'USQEX_AnimNotifyState_Bonamik_LocalWindDirect::OffsetTranslation' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_LocalWindDirect, OffsetRotation) == 0x00029C, "Member 'USQEX_AnimNotifyState_Bonamik_LocalWindDirect::OffsetRotation' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_LocalWindDirect, Scale) == 0x0002A8, "Member 'USQEX_AnimNotifyState_Bonamik_LocalWindDirect::Scale' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_LocalWindDirect, bDisableWorldWind) == 0x0002AC, "Member 'USQEX_AnimNotifyState_Bonamik_LocalWindDirect::bDisableWorldWind' has a wrong offset!");

// Class KBDRt.SQEX_AnimNotifyState_Bonamik_ResetAndPreRoll
// 0x0008 (0x0038 - 0x0030)
class USQEX_AnimNotifyState_Bonamik_ResetAndPreRoll final : public UAnimNotifyState
{
public:
	bool                                          m_Reset;                                           // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m_PreRoll;                                         // 0x0034(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEX_AnimNotifyState_Bonamik_ResetAndPreRoll">();
	}
	static class USQEX_AnimNotifyState_Bonamik_ResetAndPreRoll* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEX_AnimNotifyState_Bonamik_ResetAndPreRoll>();
	}
};
static_assert(alignof(USQEX_AnimNotifyState_Bonamik_ResetAndPreRoll) == 0x000008, "Wrong alignment on USQEX_AnimNotifyState_Bonamik_ResetAndPreRoll");
static_assert(sizeof(USQEX_AnimNotifyState_Bonamik_ResetAndPreRoll) == 0x000038, "Wrong size on USQEX_AnimNotifyState_Bonamik_ResetAndPreRoll");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_ResetAndPreRoll, m_Reset) == 0x000030, "Member 'USQEX_AnimNotifyState_Bonamik_ResetAndPreRoll::m_Reset' has a wrong offset!");
static_assert(offsetof(USQEX_AnimNotifyState_Bonamik_ResetAndPreRoll, m_PreRoll) == 0x000034, "Member 'USQEX_AnimNotifyState_Bonamik_ResetAndPreRoll::m_PreRoll' has a wrong offset!");

// Class KBDRt.SQEX_AnimNotifyState_Bonamik_ScaleGroupParams
// 0x00D0 (0x0100 - 0x0030)
class USQEX_AnimNotifyState_Bonamik_ScaleGroupParams final : public UAnimNotifyState
{
public:
	TArray<class FName>                           m_Groups;                                          // 0x0030(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          m_ChangeInnerCone;                                 // 0x0040(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_InnerConeScale;                                  // 0x0044(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeOuterCone;                                 // 0x0048(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_OuterConeScale;                                  // 0x004C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeLocalForce;                                // 0x0050(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_LocalForceScale;                                 // 0x0054(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeWindScale;                                 // 0x0058(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupWindScale;                                  // 0x005C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeMassScale;                                 // 0x0060(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupMassScale;                                  // 0x0064(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeParkRate;                                  // 0x0068(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupParkRateScale;                              // 0x006C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeActorFictitiousForce;                      // 0x0070(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupActorFictitiousForceScale;                  // 0x0074(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeActorCentrifugal;                          // 0x0078(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupActorCentrifugalScale;                      // 0x007C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeActorImpulse;                              // 0x0080(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupActorImpulseScale;                          // 0x0084(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeActorRotDrag;                              // 0x0088(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupActorRotDragScale;                          // 0x008C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeActorTransDrag;                            // 0x0090(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_GroupActorTransDragScale;                        // 0x0094(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_ChangeChainRootFictitiousForce;                  // 0x0098(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
