#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LifeStreamGauge

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LifeStreamGauge.LifeStreamGauge_C
// 0x0018 (0x03E0 - 0x03C8)
class ULifeStreamGauge_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       In;                                                // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCircle*                             Gauge_Frame;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Gauge_Total;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LifeStreamGauge_C">();
	}
	static class ULifeStreamGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULifeStreamGauge_C>();
	}
};
static_assert(alignof(ULifeStreamGauge_C) == 0x000008, "Wrong alignment on ULifeStreamGauge_C");
static_assert(sizeof(ULifeStreamGauge_C) == 0x0003E0, "Wrong size on ULifeStreamGauge_C");
static_assert(offsetof(ULifeStreamGauge_C, In) == 0x0003C8, "Member 'ULifeStreamGauge_C::In' has a wrong offset!");
static_assert(offsetof(ULifeStreamGauge_C, Gauge_Frame) == 0x0003D0, "Member 'ULifeStreamGauge_C::Gauge_Frame' has a wrong offset!");
static_assert(offsetof(ULifeStreamGauge_C, Gauge_Total) == 0x0003D8, "Member 'ULifeStreamGauge_C::Gauge_Total' has a wrong offset!");

}

