#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Loca_Loading

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Loca_Loading.Loca_Loading_C
// 0x0088 (0x04B0 - 0x0428)
class ULoca_Loading_C final : public UEndLoadingScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Menu_In_Chapter;                                   // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_In;                                         // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_Out;                                        // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop_ChocoboLogo;                                  // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop3;                                             // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop2;                                             // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              BaseLight;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BlackBg;                                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_1;                                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_2;                                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_3;                                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light1;                                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light2;                                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light3;                                            // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Loading;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Loca_Loading(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Loca_Loading_C">();
	}
	static class ULoca_Loading_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoca_Loading_C>();
	}
};
static_assert(alignof(ULoca_Loading_C) == 0x000008, "Wrong alignment on ULoca_Loading_C");
static_assert(sizeof(ULoca_Loading_C) == 0x0004B0, "Wrong size on ULoca_Loading_C");
static_assert(offsetof(ULoca_Loading_C, UberGraphFrame) == 0x000428, "Member 'ULoca_Loading_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, Menu_In_Chapter) == 0x000430, "Member 'ULoca_Loading_C::Menu_In_Chapter' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, Menu_In) == 0x000438, "Member 'ULoca_Loading_C::Menu_In' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, Change_In) == 0x000440, "Member 'ULoca_Loading_C::Change_In' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, Change_Out) == 0x000448, "Member 'ULoca_Loading_C::Change_Out' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, Loop_ChocoboLogo) == 0x000450, "Member 'ULoca_Loading_C::Loop_ChocoboLogo' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, Loop3) == 0x000458, "Member 'ULoca_Loading_C::Loop3' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, Loop2) == 0x000460, "Member 'ULoca_Loading_C::Loop2' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, BaseLight) == 0x000468, "Member 'ULoca_Loading_C::BaseLight' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, BlackBg) == 0x000470, "Member 'ULoca_Loading_C::BlackBg' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, Icon_1) == 0x000478, "Member 'ULoca_Loading_C::Icon_1' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, Icon_2) == 0x000480, "Member 'ULoca_Loading_C::Icon_2' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, Icon_3) == 0x000488, "Member 'ULoca_Loading_C::Icon_3' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, Light1) == 0x000490, "Member 'ULoca_Loading_C::Light1' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, Light2) == 0x000498, "Member 'ULoca_Loading_C::Light2' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, Light3) == 0x0004A0, "Member 'ULoca_Loading_C::Light3' has a wrong offset!");
static_assert(offsetof(ULoca_Loading_C, Txt_Loading) == 0x0004A8, "Member 'ULoca_Loading_C::Txt_Loading' has a wrong offset!");

}

