#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocationName

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LocationName.LocationName_C
// 0x0038 (0x0400 - 0x03C8)
class ULocationName_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Icon_00;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Main;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Main_1;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Main;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LocationName_C">();
	}
	static class ULocationName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocationName_C>();
	}
};
static_assert(alignof(ULocationName_C) == 0x000008, "Wrong alignment on ULocationName_C");
static_assert(sizeof(ULocationName_C) == 0x000400, "Wrong size on ULocationName_C");
static_assert(offsetof(ULocationName_C, Out) == 0x0003C8, "Member 'ULocationName_C::Out' has a wrong offset!");
static_assert(offsetof(ULocationName_C, Loop) == 0x0003D0, "Member 'ULocationName_C::Loop' has a wrong offset!");
static_assert(offsetof(ULocationName_C, In) == 0x0003D8, "Member 'ULocationName_C::In' has a wrong offset!");
static_assert(offsetof(ULocationName_C, Icon_00) == 0x0003E0, "Member 'ULocationName_C::Icon_00' has a wrong offset!");
static_assert(offsetof(ULocationName_C, Img_Base_Main) == 0x0003E8, "Member 'ULocationName_C::Img_Base_Main' has a wrong offset!");
static_assert(offsetof(ULocationName_C, Img_Base_Main_1) == 0x0003F0, "Member 'ULocationName_C::Img_Base_Main_1' has a wrong offset!");
static_assert(offsetof(ULocationName_C, Txt_Main) == 0x0003F8, "Member 'ULocationName_C::Txt_Main' has a wrong offset!");

}

