#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MA1010_00_StrayingChocobo_Standard_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function MA1010_00_StrayingChocobo_Standard_Animation.MA1010_00_StrayingChocobo_Standard_Animation_C.ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation
// 0x0104 (0x0104 - 0x0000)
struct MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_3;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_12;       // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_4;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_13;       // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_14;       // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_15;       // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_16;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_17;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_18;       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_19;       // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_5;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAnimBehaviorMode                          Temp_byte_Variable;                                // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_1; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndLocomotionAnimGroup                       CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue; // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_20;       // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_1;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_2; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_6;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_3; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndLocomotionAnimGroup                       CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue_1; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_21;       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_2;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_4; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_5; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_7;            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndLocomotionAnimGroup                       CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue_2; // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_22;       // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_23;       // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_3;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_6; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_8; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_8;            // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_24;       // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_9; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_9;            // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_25;       // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_10; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_10;           // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_26;       // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_27;       // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_3;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_4;                              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_5;                              // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_11;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_28;       // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_29;       // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_30;       // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_31;       // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_32;       // 0x00EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAnimBehaviorMode                          Temp_byte_Variable_6;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_33;       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_5;         // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAnimBehaviorMode                          Temp_byte_Variable_7;                              // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x1];                                       // 0x00FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_3;                           // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_6;         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation) == 0x000004, "Wrong alignment on MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation");
static_assert(sizeof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation) == 0x000104, "Wrong size on MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, EntryPoint) == 0x000000, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::EntryPoint' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000005, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000006, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_BooleanOR_ReturnValue) == 0x000007, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000008, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x00000C, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x000010, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue) == 0x000014, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000015, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue) == 0x000018, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00001C, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00001D, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2) == 0x000020, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x000024, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000025, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x000026, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x000027, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_BooleanOR_ReturnValue_1) == 0x000028, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x000029, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_9) == 0x00002A, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_10) == 0x00002B, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_11) == 0x00002C, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3) == 0x000030, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_3) == 0x000034, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_12) == 0x000035, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4) == 0x000038, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_4) == 0x00003C, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_13) == 0x00003D, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_14) == 0x00003E, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_15) == 0x00003F, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_16) == 0x000040, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_17) == 0x000041, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_18) == 0x000042, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_19) == 0x000043, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_BooleanOR_ReturnValue_2) == 0x000044, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5) == 0x000048, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_5) == 0x00004C, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, Temp_byte_Variable) == 0x00004D, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_1) == 0x000050, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue) == 0x000054, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, Temp_float_Variable) == 0x000058, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_20) == 0x00005C, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_SelectFloat_ReturnValue) == 0x000060, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, Temp_byte_Variable_1) == 0x000064, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_2) == 0x000068, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6) == 0x00006C, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000070, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_6) == 0x000071, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_3) == 0x000074, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue_1) == 0x000078, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, Temp_float_Variable_1) == 0x00007C, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_21) == 0x000080, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_SelectFloat_ReturnValue_1) == 0x000084, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, Temp_byte_Variable_2) == 0x000088, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_4) == 0x00008C, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000090, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7) == 0x000094, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_5) == 0x000098, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_7) == 0x00009C, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue_2) == 0x00009D, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetLocomotionAnimGroupFromCache_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_22) == 0x00009E, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_23) == 0x00009F, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_SelectFloat_ReturnValue_2) == 0x0000A0, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, Temp_float_Variable_2) == 0x0000A4, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, Temp_byte_Variable_3) == 0x0000A8, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_6) == 0x0000AC, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_8) == 0x0000B0, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x0000B4, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_8) == 0x0000B5, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_24) == 0x0000B6, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_9) == 0x0000B8, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_9) == 0x0000BC, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_25) == 0x0000BD, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_10) == 0x0000C0, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_10) == 0x0000C4, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_26) == 0x0000C5, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue) == 0x0000C8, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_27) == 0x0000CC, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, Temp_float_Variable_3) == 0x0000D0, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, Temp_float_Variable_4) == 0x0000D4, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, Temp_float_Variable_5) == 0x0000D8, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, Temp_byte_Variable_4) == 0x0000DC, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, Temp_byte_Variable_5) == 0x0000DD, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, K2Node_Select_Default) == 0x0000E0, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, K2Node_Select_Default_1) == 0x0000E4, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_11) == 0x0000E8, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_4) == 0x0000E9, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_BooleanAND_ReturnValue) == 0x0000EA, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_28) == 0x0000EB, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_29) == 0x0000EC, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_30) == 0x0000ED, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_31) == 0x0000EE, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_31' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_32) == 0x0000EF, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_32' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, Temp_byte_Variable_6) == 0x0000F0, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, K2Node_Select_Default_2) == 0x0000F4, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_33) == 0x0000F8, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_33' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_5) == 0x0000F9, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, Temp_byte_Variable_7) == 0x0000FA, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, K2Node_Select_Default_3) == 0x0000FC, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_6) == 0x000100, "Member 'MA1010_00_StrayingChocobo_Standard_Animation_C_ExecuteUbergraph_MA1010_00_StrayingChocobo_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_6' has a wrong offset!");

// Function MA1010_00_StrayingChocobo_Standard_Animation.MA1010_00_StrayingChocobo_Standard_Animation_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct MA1010_00_StrayingChocobo_Standard_Animation_C_AnimGraph final
{
public:
