#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MA1102_00_Eagle_Standard_Animation

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass MA1102_00_Eagle_Standard_Animation.MA1102_00_Eagle_Standard_Animation_C
// 0x1F90 (0x37D0 - 0x1840)
class UMA1102_00_Eagle_Standard_Animation_C final : public UEndFlyCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1840(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1848(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0x1878(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0x18A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0x18C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0x18F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0x1918(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0x1940(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0x1968(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0x1990(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0x19B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0x19E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x1A08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x1A30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x1A58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x1A80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x1AA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x1AD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x1AF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x1B20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x1B48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x1B70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x1B98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x1BC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x1BE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x1C10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x1C38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x1C60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x1C88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x1CB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x1CD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x1D00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x1D28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x1D50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x1D78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x1DA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x1DC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x1DF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x1E18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x1E40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x1E68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x1E90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x1EB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x1EE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x1F08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x1F30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x1F58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x1F80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x1FA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x1FD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x1FF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x2020(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x2048(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x2070(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x2098(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x20C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x20E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x2110(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x2138(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x2160(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x2188(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x21B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x21D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x2200(0x0028)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_15;      // 0x2228(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x22D0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x2300(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x2328(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x2350(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x2378(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x23A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x23C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x23F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x2418(0x0028)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_14;      // 0x2440(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x24E8(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_13;      // 0x2518(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x25C0(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_12;      // 0x25F0(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x2698(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_11;      // 0x26C8(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x2770(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x27A0(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x27B8(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_10;      // 0x27E8(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x2890(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_9;       // 0x28C0(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x2968(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_8;       // 0x2998(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x2A40(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_7;       // 0x2A70(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x2B18(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2B48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2B70(0x0028)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_6;       // 0x2B98(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x2C40(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_5;       // 0x2C70(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x2D18(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_4;       // 0x2D48(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x2DF0(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_3;       // 0x2E20(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x2EC8(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_2;       // 0x2EF8(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x2FA0(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_1;       // 0x2FD0(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x3078(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer;         // 0x30A8(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x3150(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x3180(0x00B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x3230(0x0020)()
	struct FAnimNode_EndCharacterMovementExpression AnimGraphNode_EndCharacterMovementExpression;      // 0x3250(0x00F8)()
	struct FAnimNode_EndBehaviorAction            AnimGraphNode_EndBehaviorAction;                   // 0x3348(0x0028)()
	struct FAnimNode_EndInertialization           AnimGraphNode_EndInertialization;                  // 0x3370(0x0090)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x3400(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x3448(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x3468(0x0368)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MA1102_00_Eagle_Standard_Animation_AnimGraphNode_TransitionResult_3EA4620E4435270C8038A7A0C51AB9E1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MA1102_00_Eagle_Standard_Animation_AnimGraphNode_TransitionResult_B2417AA4401ED16B828685981FA47334();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MA1102_00_Eagle_Standard_Animation_AnimGraphNode_TransitionResult_27905DA5457D9054C50C4080546C857E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MA1102_00_Eagle_Standard_Animation_AnimGraphNode_TransitionResult_C35A0BD845A6CAB1BFD9D1B1C85BE091();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MA1102_00_Eagle_Standard_Animation_AnimGraphNode_TransitionResult_E0CA9D0643177B18875F67AE5787E917();
