#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Magic_Guide

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Magic_Guide.Magic_Guide_C
// 0x0040 (0x0430 - 0x03F0)
class UMagic_Guide_C final : public UEndMagicGuide
{
public:
	class UWidgetAnimation*                       Alarm;                                             // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_02;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Alarm;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TitleValue_Mp;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Magic_Guide_C">();
	}
	static class UMagic_Guide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagic_Guide_C>();
	}
};
static_assert(alignof(UMagic_Guide_C) == 0x000008, "Wrong alignment on UMagic_Guide_C");
static_assert(sizeof(UMagic_Guide_C) == 0x000430, "Wrong size on UMagic_Guide_C");
static_assert(offsetof(UMagic_Guide_C, Alarm) == 0x0003F0, "Member 'UMagic_Guide_C::Alarm' has a wrong offset!");
static_assert(offsetof(UMagic_Guide_C, Normal) == 0x0003F8, "Member 'UMagic_Guide_C::Normal' has a wrong offset!");
static_assert(offsetof(UMagic_Guide_C, Base) == 0x000400, "Member 'UMagic_Guide_C::Base' has a wrong offset!");
static_assert(offsetof(UMagic_Guide_C, Frame) == 0x000408, "Member 'UMagic_Guide_C::Frame' has a wrong offset!");
static_assert(offsetof(UMagic_Guide_C, Img_Slash) == 0x000410, "Member 'UMagic_Guide_C::Img_Slash' has a wrong offset!");
static_assert(offsetof(UMagic_Guide_C, Img_Slash_02) == 0x000418, "Member 'UMagic_Guide_C::Img_Slash_02' has a wrong offset!");
static_assert(offsetof(UMagic_Guide_C, Txt_Alarm) == 0x000420, "Member 'UMagic_Guide_C::Txt_Alarm' has a wrong offset!");
static_assert(offsetof(UMagic_Guide_C, Txt_TitleValue_Mp) == 0x000428, "Member 'UMagic_Guide_C::Txt_TitleValue_Mp' has a wrong offset!");

}

