#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Magic_SelectList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Magic_SelectList.Magic_SelectList_C
// 0x0088 (0x0470 - 0x03E8)
class UMagic_SelectList_C final : public UEndMagicSelectList
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UEndImage*                              Bg_1;                                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2;                                               // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_1;                                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_2;                                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_3;                                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2_1;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_1;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_2;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_3;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_4;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_5;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_6;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_7;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_8;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Magic_SelectList(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Magic_SelectList_C">();
	}
	static class UMagic_SelectList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagic_SelectList_C>();
	}
};
static_assert(alignof(UMagic_SelectList_C) == 0x000008, "Wrong alignment on UMagic_SelectList_C");
static_assert(sizeof(UMagic_SelectList_C) == 0x000470, "Wrong size on UMagic_SelectList_C");
static_assert(offsetof(UMagic_SelectList_C, UberGraphFrame) == 0x0003E8, "Member 'UMagic_SelectList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, Bg_1) == 0x0003F0, "Member 'UMagic_SelectList_C::Bg_1' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, Bg2) == 0x0003F8, "Member 'UMagic_SelectList_C::Bg2' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, Bg2_1) == 0x000400, "Member 'UMagic_SelectList_C::Bg2_1' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, Bg2_2) == 0x000408, "Member 'UMagic_SelectList_C::Bg2_2' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, Bg2_3) == 0x000410, "Member 'UMagic_SelectList_C::Bg2_3' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, EndImage) == 0x000418, "Member 'UMagic_SelectList_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, ListBg2_1) == 0x000420, "Member 'UMagic_SelectList_C::ListBg2_1' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, ListPoint) == 0x000428, "Member 'UMagic_SelectList_C::ListPoint' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, ListPoint_1) == 0x000430, "Member 'UMagic_SelectList_C::ListPoint_1' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, ListPoint_2) == 0x000438, "Member 'UMagic_SelectList_C::ListPoint_2' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, ListPoint_3) == 0x000440, "Member 'UMagic_SelectList_C::ListPoint_3' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, ListPoint_4) == 0x000448, "Member 'UMagic_SelectList_C::ListPoint_4' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, ListPoint_5) == 0x000450, "Member 'UMagic_SelectList_C::ListPoint_5' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, ListPoint_6) == 0x000458, "Member 'UMagic_SelectList_C::ListPoint_6' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, ListPoint_7) == 0x000460, "Member 'UMagic_SelectList_C::ListPoint_7' has a wrong offset!");
static_assert(offsetof(UMagic_SelectList_C, ListPoint_8) == 0x000468, "Member 'UMagic_SelectList_C::ListPoint_8' has a wrong offset!");

}

