#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_SaveLoad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_SaveLoad.MainMenu_SaveLoad_C
// 0x00D0 (0x0540 - 0x0470)
class UMainMenu_SaveLoad_C final : public UEndMainSaveLoadTopMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Bg_Normal;                                         // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bg_Dark;                                           // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Black;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Left;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Right;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg;                                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg_1;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg_2;                                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg_3;                                    // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCategoryTitle_C*                       CategoryTitle;                                     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_3;                                        // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_4;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_5;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_25;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_26;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_49;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_100;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_LeftMenu_C*                   MainMenu_LeftMenu;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgLeft_C*              System_BgLeft;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgRight_C*             System_BgRight;                                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_SaveLoad(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_SaveLoad_C">();
	}
	static class UMainMenu_SaveLoad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_SaveLoad_C>();
	}
};
static_assert(alignof(UMainMenu_SaveLoad_C) == 0x000008, "Wrong alignment on UMainMenu_SaveLoad_C");
static_assert(sizeof(UMainMenu_SaveLoad_C) == 0x000540, "Wrong size on UMainMenu_SaveLoad_C");
static_assert(offsetof(UMainMenu_SaveLoad_C, UberGraphFrame) == 0x000470, "Member 'UMainMenu_SaveLoad_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, Bg_Normal) == 0x000478, "Member 'UMainMenu_SaveLoad_C::Bg_Normal' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, Bg_Dark) == 0x000480, "Member 'UMainMenu_SaveLoad_C::Bg_Dark' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, Menu_In) == 0x000488, "Member 'UMainMenu_SaveLoad_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, Base) == 0x000490, "Member 'UMainMenu_SaveLoad_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, Base_Black) == 0x000498, "Member 'UMainMenu_SaveLoad_C::Base_Black' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, Base_Left) == 0x0004A0, "Member 'UMainMenu_SaveLoad_C::Base_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, Base_Right) == 0x0004A8, "Member 'UMainMenu_SaveLoad_C::Base_Right' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, Billboard_Bg) == 0x0004B0, "Member 'UMainMenu_SaveLoad_C::Billboard_Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, Billboard_Bg_1) == 0x0004B8, "Member 'UMainMenu_SaveLoad_C::Billboard_Bg_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, Billboard_Bg_2) == 0x0004C0, "Member 'UMainMenu_SaveLoad_C::Billboard_Bg_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, Billboard_Bg_3) == 0x0004C8, "Member 'UMainMenu_SaveLoad_C::Billboard_Bg_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, CategoryTitle) == 0x0004D0, "Member 'UMainMenu_SaveLoad_C::CategoryTitle' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, EndImage) == 0x0004D8, "Member 'UMainMenu_SaveLoad_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, EndImage_1) == 0x0004E0, "Member 'UMainMenu_SaveLoad_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, EndImage_2) == 0x0004E8, "Member 'UMainMenu_SaveLoad_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, EndImage_3) == 0x0004F0, "Member 'UMainMenu_SaveLoad_C::EndImage_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, EndImage_4) == 0x0004F8, "Member 'UMainMenu_SaveLoad_C::EndImage_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, EndImage_5) == 0x000500, "Member 'UMainMenu_SaveLoad_C::EndImage_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, EndImage_25) == 0x000508, "Member 'UMainMenu_SaveLoad_C::EndImage_25' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, EndImage_26) == 0x000510, "Member 'UMainMenu_SaveLoad_C::EndImage_26' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, EndImage_49) == 0x000518, "Member 'UMainMenu_SaveLoad_C::EndImage_49' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, EndImage_100) == 0x000520, "Member 'UMainMenu_SaveLoad_C::EndImage_100' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, MainMenu_LeftMenu) == 0x000528, "Member 'UMainMenu_SaveLoad_C::MainMenu_LeftMenu' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, System_BgLeft) == 0x000530, "Member 'UMainMenu_SaveLoad_C::System_BgLeft' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveLoad_C, System_BgRight) == 0x000538, "Member 'UMainMenu_SaveLoad_C::System_BgRight' has a wrong offset!");

}

