#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_ConfirmWindow

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_ConfirmWindow.MainMenu_Card_ConfirmWindow_C
// 0x0090 (0x04F0 - 0x0460)
class UMainMenu_Card_ConfirmWindow_C final : public UEndCardGameMessageWindow
{
public:
	class UWidgetAnimation*                       CardGame;                                          // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              IconBase;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconFrame;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLineLeft;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLineRight;                                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BG;                                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_01;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_02;                                 // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_03;                                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_04;                                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LEFT;                                              // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           ListBgSet;                                         // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              RIGHT;                                             // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow;                                            // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Icon;                                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_ConfirmWindow_C">();
	}
	static class UMainMenu_Card_ConfirmWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_ConfirmWindow_C>();
	}
};
static_assert(alignof(UMainMenu_Card_ConfirmWindow_C) == 0x000008, "Wrong alignment on UMainMenu_Card_ConfirmWindow_C");
static_assert(sizeof(UMainMenu_Card_ConfirmWindow_C) == 0x0004F0, "Wrong size on UMainMenu_Card_ConfirmWindow_C");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, CardGame) == 0x000460, "Member 'UMainMenu_Card_ConfirmWindow_C::CardGame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, Out) == 0x000468, "Member 'UMainMenu_Card_ConfirmWindow_C::Out' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, In) == 0x000470, "Member 'UMainMenu_Card_ConfirmWindow_C::In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, IconBase) == 0x000478, "Member 'UMainMenu_Card_ConfirmWindow_C::IconBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, IconFrame) == 0x000480, "Member 'UMainMenu_Card_ConfirmWindow_C::IconFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, IconLineLeft) == 0x000488, "Member 'UMainMenu_Card_ConfirmWindow_C::IconLineLeft' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, IconLineRight) == 0x000490, "Member 'UMainMenu_Card_ConfirmWindow_C::IconLineRight' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, Img_BG) == 0x000498, "Member 'UMainMenu_Card_ConfirmWindow_C::Img_BG' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, Img_CornerDeco_01) == 0x0004A0, "Member 'UMainMenu_Card_ConfirmWindow_C::Img_CornerDeco_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, Img_CornerDeco_02) == 0x0004A8, "Member 'UMainMenu_Card_ConfirmWindow_C::Img_CornerDeco_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, Img_CornerDeco_03) == 0x0004B0, "Member 'UMainMenu_Card_ConfirmWindow_C::Img_CornerDeco_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, Img_CornerDeco_04) == 0x0004B8, "Member 'UMainMenu_Card_ConfirmWindow_C::Img_CornerDeco_04' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, LEFT) == 0x0004C0, "Member 'UMainMenu_Card_ConfirmWindow_C::LEFT' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, Light) == 0x0004C8, "Member 'UMainMenu_Card_ConfirmWindow_C::Light' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, ListBgSet) == 0x0004D0, "Member 'UMainMenu_Card_ConfirmWindow_C::ListBgSet' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, RIGHT) == 0x0004D8, "Member 'UMainMenu_Card_ConfirmWindow_C::RIGHT' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, Shadow) == 0x0004E0, "Member 'UMainMenu_Card_ConfirmWindow_C::Shadow' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_ConfirmWindow_C, Title_Icon) == 0x0004E8, "Member 'UMainMenu_Card_ConfirmWindow_C::Title_Icon' has a wrong offset!");

}

