#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Window_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Window_01.MainMenu_Window_01_C
// 0x0020 (0x03E8 - 0x03C8)
class UMainMenu_Window_01_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Menu_In;                                           // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMainMenu_Foot_C*                       MainMenu_Foot;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_TopTitle_C*                   MainMenu_TopTitle;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_Window_01(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Window_01_C">();
	}
	static class UMainMenu_Window_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Window_01_C>();
	}
};
static_assert(alignof(UMainMenu_Window_01_C) == 0x000008, "Wrong alignment on UMainMenu_Window_01_C");
static_assert(sizeof(UMainMenu_Window_01_C) == 0x0003E8, "Wrong size on UMainMenu_Window_01_C");
static_assert(offsetof(UMainMenu_Window_01_C, UberGraphFrame) == 0x0003C8, "Member 'UMainMenu_Window_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Window_01_C, Menu_In) == 0x0003D0, "Member 'UMainMenu_Window_01_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Window_01_C, MainMenu_Foot) == 0x0003D8, "Member 'UMainMenu_Window_01_C::MainMenu_Foot' has a wrong offset!");
static_assert(offsetof(UMainMenu_Window_01_C, MainMenu_TopTitle) == 0x0003E0, "Member 'UMainMenu_Window_01_C::MainMenu_TopTitle' has a wrong offset!");

}

