#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_DeckCopy

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_DeckCopy.MainMenu_Card_DeckCopy_C
// 0x0028 (0x03F0 - 0x03C8)
class UMainMenu_Card_DeckCopy_C final : public UEndUserWidget
{
public:
	class UMainMenu_Card_Confirm_C*               Confirm;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_DeckList_C*              DeckList;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_ListHorizon_C*           EditingDeck;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_CardInformation_C*       Information;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_ListHorizon_C*           OriginDeck;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_DeckCopy_C">();
	}
	static class UMainMenu_Card_DeckCopy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_DeckCopy_C>();
	}
};
static_assert(alignof(UMainMenu_Card_DeckCopy_C) == 0x000008, "Wrong alignment on UMainMenu_Card_DeckCopy_C");
static_assert(sizeof(UMainMenu_Card_DeckCopy_C) == 0x0003F0, "Wrong size on UMainMenu_Card_DeckCopy_C");
static_assert(offsetof(UMainMenu_Card_DeckCopy_C, Confirm) == 0x0003C8, "Member 'UMainMenu_Card_DeckCopy_C::Confirm' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_DeckCopy_C, DeckList) == 0x0003D0, "Member 'UMainMenu_Card_DeckCopy_C::DeckList' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_DeckCopy_C, EditingDeck) == 0x0003D8, "Member 'UMainMenu_Card_DeckCopy_C::EditingDeck' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_DeckCopy_C, Information) == 0x0003E0, "Member 'UMainMenu_Card_DeckCopy_C::Information' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_DeckCopy_C, OriginDeck) == 0x0003E8, "Member 'UMainMenu_Card_DeckCopy_C::OriginDeck' has a wrong offset!");

}

