#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_StatusCell_05

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_StatusCell_05.MainMenu_StatusCell_05_C
// 0x0108 (0x04D0 - 0x03C8)
class UMainMenu_StatusCell_05_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Base_Blue;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Ring;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Ring2;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_1;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_4;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_42;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_62;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_Exp;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gradation2;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gradation2_1;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_AccessoryIcon;                                // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_ArmorIcon;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Clear;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_CoreIcon;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_ItemIcon;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_MateriaIcon;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_WeaponIcon;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Exp_Gauge_BG;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Exp_Gauge_Waku;                                // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_03;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_MateriaEquipStatusCell_C*     MainMenu_MateriaEquipStatusCell;                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateria_List_C*                        Materia_List;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Equip_OwnerTag_C*             OwnerTag;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           OwnerTag_Icon;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Title_Icon;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_AbilityTitle;                                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_AccessoryInfo;                                 // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_EquipInfo;                                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_StatusCell_05_C">();
	}
	static class UMainMenu_StatusCell_05_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_StatusCell_05_C>();
	}
};
static_assert(alignof(UMainMenu_StatusCell_05_C) == 0x000008, "Wrong alignment on UMainMenu_StatusCell_05_C");
static_assert(sizeof(UMainMenu_StatusCell_05_C) == 0x0004D0, "Wrong size on UMainMenu_StatusCell_05_C");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Base_Blue) == 0x0003C8, "Member 'UMainMenu_StatusCell_05_C::Base_Blue' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Base_Ring) == 0x0003D0, "Member 'UMainMenu_StatusCell_05_C::Base_Ring' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Base_Ring2) == 0x0003D8, "Member 'UMainMenu_StatusCell_05_C::Base_Ring2' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Bg) == 0x0003E0, "Member 'UMainMenu_StatusCell_05_C::Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Bg_1) == 0x0003E8, "Member 'UMainMenu_StatusCell_05_C::Bg_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, EndImage) == 0x0003F0, "Member 'UMainMenu_StatusCell_05_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, EndImage_1) == 0x0003F8, "Member 'UMainMenu_StatusCell_05_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, EndImage_2) == 0x000400, "Member 'UMainMenu_StatusCell_05_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, EndImage_4) == 0x000408, "Member 'UMainMenu_StatusCell_05_C::EndImage_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, EndImage_42) == 0x000410, "Member 'UMainMenu_StatusCell_05_C::EndImage_42' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, EndImage_62) == 0x000418, "Member 'UMainMenu_StatusCell_05_C::EndImage_62' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Gauge_Exp) == 0x000420, "Member 'UMainMenu_StatusCell_05_C::Gauge_Exp' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Gradation2) == 0x000428, "Member 'UMainMenu_StatusCell_05_C::Gradation2' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Gradation2_1) == 0x000430, "Member 'UMainMenu_StatusCell_05_C::Gradation2_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Icon_AccessoryIcon) == 0x000438, "Member 'UMainMenu_StatusCell_05_C::Icon_AccessoryIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Icon_ArmorIcon) == 0x000440, "Member 'UMainMenu_StatusCell_05_C::Icon_ArmorIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Icon_Clear) == 0x000448, "Member 'UMainMenu_StatusCell_05_C::Icon_Clear' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Icon_CoreIcon) == 0x000450, "Member 'UMainMenu_StatusCell_05_C::Icon_CoreIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Icon_ItemIcon) == 0x000458, "Member 'UMainMenu_StatusCell_05_C::Icon_ItemIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Icon_MateriaIcon) == 0x000460, "Member 'UMainMenu_StatusCell_05_C::Icon_MateriaIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Icon_WeaponIcon) == 0x000468, "Member 'UMainMenu_StatusCell_05_C::Icon_WeaponIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Img_Exp_Gauge_BG) == 0x000470, "Member 'UMainMenu_StatusCell_05_C::Img_Exp_Gauge_BG' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Img_Exp_Gauge_Waku) == 0x000478, "Member 'UMainMenu_StatusCell_05_C::Img_Exp_Gauge_Waku' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Img_Slash_03) == 0x000480, "Member 'UMainMenu_StatusCell_05_C::Img_Slash_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Line) == 0x000488, "Member 'UMainMenu_StatusCell_05_C::Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, MainMenu_MateriaEquipStatusCell) == 0x000490, "Member 'UMainMenu_StatusCell_05_C::MainMenu_MateriaEquipStatusCell' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Materia_List) == 0x000498, "Member 'UMainMenu_StatusCell_05_C::Materia_List' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, OwnerTag) == 0x0004A0, "Member 'UMainMenu_StatusCell_05_C::OwnerTag' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, OwnerTag_Icon) == 0x0004A8, "Member 'UMainMenu_StatusCell_05_C::OwnerTag_Icon' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Title_Icon) == 0x0004B0, "Member 'UMainMenu_StatusCell_05_C::Title_Icon' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Txt_AbilityTitle) == 0x0004B8, "Member 'UMainMenu_StatusCell_05_C::Txt_AbilityTitle' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Txt_AccessoryInfo) == 0x0004C0, "Member 'UMainMenu_StatusCell_05_C::Txt_AccessoryInfo' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_05_C, Txt_EquipInfo) == 0x0004C8, "Member 'UMainMenu_StatusCell_05_C::Txt_EquipInfo' has a wrong offset!");

}

