#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_MateriaEquipStatusCell

#include "Basic.hpp"

#include "EndDataBase_structs.hpp"
#include "Engine_structs.hpp"
#include "EndDataObject_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_MateriaEquipStatusCell.MainMenu_MateriaEquipStatusCell_C
// 0x00D0 (0x0498 - 0x03C8)
class UMainMenu_MateriaEquipStatusCell_C final : public UEndMenuMateriaEquipCell
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UEndImage*                              Bg;                                                // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_1;                                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_62;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_Ap;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_1;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_2;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_3;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_4;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Exp_Gauge_Waku;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_MateriaValue;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_StatusValue;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ApInfo;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ApTitle;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Lv;                                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Lv_Title;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_StatusValue_1;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_StatusValue_2;                                 // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_StatusValue_3;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_StatusValue_4;                                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPlayerType                                   PlayerType;                                        // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEndDataObjectEquipmentAccessor        Equip;                                             // 0x0478(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_MateriaEquipStatusCell(int32 EntryPoint);
	void OnUpdateMaterialStatus(const class FString& ApStr, float Percent);
	void OnUpdateEquipUpgradedStatus(int32 Attack, int32 Defense, int32 MagicAttack, int32 MagicDefense, int32 AttackAdd, int32 DefenseAdd, int32 MagicAttackAdd, int32 MagicDefenseAdd);
	void OnUpdateEquipStatus(const struct FEndDataObjectEquipmentAccessor& dataObjectEquipment);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_MateriaEquipStatusCell_C">();
	}
	static class UMainMenu_MateriaEquipStatusCell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_MateriaEquipStatusCell_C>();
	}
};
static_assert(alignof(UMainMenu_MateriaEquipStatusCell_C) == 0x000008, "Wrong alignment on UMainMenu_MateriaEquipStatusCell_C");
static_assert(sizeof(UMainMenu_MateriaEquipStatusCell_C) == 0x000498, "Wrong size on UMainMenu_MateriaEquipStatusCell_C");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, UberGraphFrame) == 0x0003C8, "Member 'UMainMenu_MateriaEquipStatusCell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Bg) == 0x0003D0, "Member 'UMainMenu_MateriaEquipStatusCell_C::Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Bg_1) == 0x0003D8, "Member 'UMainMenu_MateriaEquipStatusCell_C::Bg_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, EndImage) == 0x0003E0, "Member 'UMainMenu_MateriaEquipStatusCell_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, EndImage_62) == 0x0003E8, "Member 'UMainMenu_MateriaEquipStatusCell_C::EndImage_62' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Gauge_Ap) == 0x0003F0, "Member 'UMainMenu_MateriaEquipStatusCell_C::Gauge_Ap' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Icon_Status_1) == 0x0003F8, "Member 'UMainMenu_MateriaEquipStatusCell_C::Icon_Status_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Icon_Status_2) == 0x000400, "Member 'UMainMenu_MateriaEquipStatusCell_C::Icon_Status_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Icon_Status_3) == 0x000408, "Member 'UMainMenu_MateriaEquipStatusCell_C::Icon_Status_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Icon_Status_4) == 0x000410, "Member 'UMainMenu_MateriaEquipStatusCell_C::Icon_Status_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Img_Exp_Gauge_Waku) == 0x000418, "Member 'UMainMenu_MateriaEquipStatusCell_C::Img_Exp_Gauge_Waku' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Pnl_MateriaValue) == 0x000420, "Member 'UMainMenu_MateriaEquipStatusCell_C::Pnl_MateriaValue' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Pnl_StatusValue) == 0x000428, "Member 'UMainMenu_MateriaEquipStatusCell_C::Pnl_StatusValue' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_ApInfo) == 0x000430, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_ApInfo' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_ApTitle) == 0x000438, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_ApTitle' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_Lv) == 0x000440, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_Lv' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_Lv_Title) == 0x000448, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_Lv_Title' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_StatusValue_1) == 0x000450, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_StatusValue_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_StatusValue_2) == 0x000458, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_StatusValue_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_StatusValue_3) == 0x000460, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_StatusValue_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_StatusValue_4) == 0x000468, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_StatusValue_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, PlayerType) == 0x000470, "Member 'UMainMenu_MateriaEquipStatusCell_C::PlayerType' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Equip) == 0x000478, "Member 'UMainMenu_MateriaEquipStatusCell_C::Equip' has a wrong offset!");

}

