#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_EquipSelect_Cell_03Light

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_EquipSelect_Cell_03Light.MainMenu_EquipSelect_Cell_03Light_C
// 0x0020 (0x03E8 - 0x03C8)
class UMainMenu_EquipSelect_Cell_03Light_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       In;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              HoverBase;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_EquipSelect_Cell_03Light(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_EquipSelect_Cell_03Light_C">();
	}
	static class UMainMenu_EquipSelect_Cell_03Light_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_EquipSelect_Cell_03Light_C>();
	}
};
static_assert(alignof(UMainMenu_EquipSelect_Cell_03Light_C) == 0x000008, "Wrong alignment on UMainMenu_EquipSelect_Cell_03Light_C");
static_assert(sizeof(UMainMenu_EquipSelect_Cell_03Light_C) == 0x0003E8, "Wrong size on UMainMenu_EquipSelect_Cell_03Light_C");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03Light_C, UberGraphFrame) == 0x0003C8, "Member 'UMainMenu_EquipSelect_Cell_03Light_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03Light_C, In) == 0x0003D0, "Member 'UMainMenu_EquipSelect_Cell_03Light_C::In' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03Light_C, Loop) == 0x0003D8, "Member 'UMainMenu_EquipSelect_Cell_03Light_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03Light_C, HoverBase) == 0x0003E0, "Member 'UMainMenu_EquipSelect_Cell_03Light_C::HoverBase' has a wrong offset!");

}

