#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_ItemTop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_ItemTop.MainMenu_ItemTop_C
// 0x0078 (0x0588 - 0x0510)
class UMainMenu_ItemTop_C final : public UEndMainItemMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Billboard_Materia_In;                              // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Billboard_Item_In;                                 // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SortList_In;                                       // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectMember_In;                                   // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SkillList_In;                                      // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus_Change;                                      // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Bg_Black;                                          // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_Left;                                           // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_Right;                                          // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Craft_CategoryBtn_C*          CategoryBtn;                                       // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_EquipInfo4_C*                 SkillList;                                         // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_SortList_C*                   SortList;                                          // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_ItemTop(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_ItemTop_C">();
	}
	static class UMainMenu_ItemTop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_ItemTop_C>();
	}
};
static_assert(alignof(UMainMenu_ItemTop_C) == 0x000008, "Wrong alignment on UMainMenu_ItemTop_C");
static_assert(sizeof(UMainMenu_ItemTop_C) == 0x000588, "Wrong size on UMainMenu_ItemTop_C");
static_assert(offsetof(UMainMenu_ItemTop_C, UberGraphFrame) == 0x000510, "Member 'UMainMenu_ItemTop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Billboard_Materia_In) == 0x000518, "Member 'UMainMenu_ItemTop_C::Billboard_Materia_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Billboard_Item_In) == 0x000520, "Member 'UMainMenu_ItemTop_C::Billboard_Item_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, SortList_In) == 0x000528, "Member 'UMainMenu_ItemTop_C::SortList_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, SelectMember_In) == 0x000530, "Member 'UMainMenu_ItemTop_C::SelectMember_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, SkillList_In) == 0x000538, "Member 'UMainMenu_ItemTop_C::SkillList_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Focus_Change) == 0x000540, "Member 'UMainMenu_ItemTop_C::Focus_Change' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Menu_In) == 0x000548, "Member 'UMainMenu_ItemTop_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Bg_Black) == 0x000550, "Member 'UMainMenu_ItemTop_C::Bg_Black' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Bg_Left) == 0x000558, "Member 'UMainMenu_ItemTop_C::Bg_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Bg_Right) == 0x000560, "Member 'UMainMenu_ItemTop_C::Bg_Right' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, CategoryBtn) == 0x000568, "Member 'UMainMenu_ItemTop_C::CategoryBtn' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Light) == 0x000570, "Member 'UMainMenu_ItemTop_C::Light' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, SkillList) == 0x000578, "Member 'UMainMenu_ItemTop_C::SkillList' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, SortList) == 0x000580, "Member 'UMainMenu_ItemTop_C::SortList' has a wrong offset!");

}

