#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_InfoWindowBg

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_InfoWindowBg.MainMenu_InfoWindowBg_C
// 0x0020 (0x03E8 - 0x03C8)
class UMainMenu_InfoWindowBg_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Bg;                                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_1;                                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_2;                                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_InfoWindowBg_C">();
	}
	static class UMainMenu_InfoWindowBg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_InfoWindowBg_C>();
	}
};
static_assert(alignof(UMainMenu_InfoWindowBg_C) == 0x000008, "Wrong alignment on UMainMenu_InfoWindowBg_C");
static_assert(sizeof(UMainMenu_InfoWindowBg_C) == 0x0003E8, "Wrong size on UMainMenu_InfoWindowBg_C");
static_assert(offsetof(UMainMenu_InfoWindowBg_C, Bg) == 0x0003C8, "Member 'UMainMenu_InfoWindowBg_C::Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_InfoWindowBg_C, Bg_1) == 0x0003D0, "Member 'UMainMenu_InfoWindowBg_C::Bg_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_InfoWindowBg_C, Bg_2) == 0x0003D8, "Member 'UMainMenu_InfoWindowBg_C::Bg_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_InfoWindowBg_C, Frame) == 0x0003E0, "Member 'UMainMenu_InfoWindowBg_C::Frame' has a wrong offset!");

}

