#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_System_BgRight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_System_BgRight.MainMenu_System_BgRight_C
// 0x0028 (0x03F0 - 0x03C8)
class UMainMenu_System_BgRight_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Right1;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Right2;                                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_System_BgRight(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_System_BgRight_C">();
	}
	static class UMainMenu_System_BgRight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_System_BgRight_C>();
	}
};
static_assert(alignof(UMainMenu_System_BgRight_C) == 0x000008, "Wrong alignment on UMainMenu_System_BgRight_C");
static_assert(sizeof(UMainMenu_System_BgRight_C) == 0x0003F0, "Wrong size on UMainMenu_System_BgRight_C");
static_assert(offsetof(UMainMenu_System_BgRight_C, UberGraphFrame) == 0x0003C8, "Member 'UMainMenu_System_BgRight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgRight_C, Loop) == 0x0003D0, "Member 'UMainMenu_System_BgRight_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgRight_C, In) == 0x0003D8, "Member 'UMainMenu_System_BgRight_C::In' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgRight_C, Right1) == 0x0003E0, "Member 'UMainMenu_System_BgRight_C::Right1' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgRight_C, Right2) == 0x0003E8, "Member 'UMainMenu_System_BgRight_C::Right2' has a wrong offset!");

}

