#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Craft_Window

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Craft_Window.MainMenu_Craft_Window_C
// 0x01B8 (0x05E0 - 0x0428)
class UMainMenu_Craft_Window_C final : public UEndItemCraftSelectQuantityWindow
{
public:
	class UWidgetAnimation*                       Press_Out;                                         // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Press_In;                                          // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Press_Loop;                                        // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Result_In;                                         // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_1;                                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot1;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot1_1;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot2;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot2_1;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot3;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot3_1;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot4;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot4_1;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot5;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot5_1;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco1;                                             // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco2;                                             // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             EndCircle_53;                                      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_58;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_132;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_187;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_251;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame1;                                            // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame2;                                            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Gauge_Frame;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon;                                              // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_TgsGuide2_C*                      Icon_TgsGuide2;                                    // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_InfoWindowBg_C*               InfoWindowBg;                                      // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light_1;                                           // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light_2;                                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_1;                                            // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1;                                             // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_1;                                           // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_2;                                           // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_3;                                           // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_4;                                           // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_5;                                           // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_6;                                           // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_7;                                           // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LineLight;                                         // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint;                                         // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_1;                                       // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_2;                                       // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_3;                                       // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_4;                                       // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_5;                                       // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_6;                                       // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_7;                                       // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_8;                                       // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_9;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Alarm;                                         // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Craft_Window_C">();
	}
	static class UMainMenu_Craft_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Craft_Window_C>();
	}
};
static_assert(alignof(UMainMenu_Craft_Window_C) == 0x000008, "Wrong alignment on UMainMenu_Craft_Window_C");
static_assert(sizeof(UMainMenu_Craft_Window_C) == 0x0005E0, "Wrong size on UMainMenu_Craft_Window_C");
static_assert(offsetof(UMainMenu_Craft_Window_C, Press_Out) == 0x000428, "Member 'UMainMenu_Craft_Window_C::Press_Out' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Press_In) == 0x000430, "Member 'UMainMenu_Craft_Window_C::Press_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Press_Loop) == 0x000438, "Member 'UMainMenu_Craft_Window_C::Press_Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Normal) == 0x000440, "Member 'UMainMenu_Craft_Window_C::Normal' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Result_In) == 0x000448, "Member 'UMainMenu_Craft_Window_C::Result_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Base) == 0x000450, "Member 'UMainMenu_Craft_Window_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Base_1) == 0x000458, "Member 'UMainMenu_Craft_Window_C::Base_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, BaseDot1) == 0x000460, "Member 'UMainMenu_Craft_Window_C::BaseDot1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, BaseDot1_1) == 0x000468, "Member 'UMainMenu_Craft_Window_C::BaseDot1_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, BaseDot2) == 0x000470, "Member 'UMainMenu_Craft_Window_C::BaseDot2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, BaseDot2_1) == 0x000478, "Member 'UMainMenu_Craft_Window_C::BaseDot2_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, BaseDot3) == 0x000480, "Member 'UMainMenu_Craft_Window_C::BaseDot3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, BaseDot3_1) == 0x000488, "Member 'UMainMenu_Craft_Window_C::BaseDot3_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, BaseDot4) == 0x000490, "Member 'UMainMenu_Craft_Window_C::BaseDot4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, BaseDot4_1) == 0x000498, "Member 'UMainMenu_Craft_Window_C::BaseDot4_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, BaseDot5) == 0x0004A0, "Member 'UMainMenu_Craft_Window_C::BaseDot5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, BaseDot5_1) == 0x0004A8, "Member 'UMainMenu_Craft_Window_C::BaseDot5_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Deco1) == 0x0004B0, "Member 'UMainMenu_Craft_Window_C::Deco1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Deco2) == 0x0004B8, "Member 'UMainMenu_Craft_Window_C::Deco2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, EndCircle_53) == 0x0004C0, "Member 'UMainMenu_Craft_Window_C::EndCircle_53' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, EndImage_58) == 0x0004C8, "Member 'UMainMenu_Craft_Window_C::EndImage_58' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, EndImage_132) == 0x0004D0, "Member 'UMainMenu_Craft_Window_C::EndImage_132' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, EndImage_187) == 0x0004D8, "Member 'UMainMenu_Craft_Window_C::EndImage_187' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, EndImage_251) == 0x0004E0, "Member 'UMainMenu_Craft_Window_C::EndImage_251' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Frame1) == 0x0004E8, "Member 'UMainMenu_Craft_Window_C::Frame1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Frame2) == 0x0004F0, "Member 'UMainMenu_Craft_Window_C::Frame2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Gauge_Frame) == 0x0004F8, "Member 'UMainMenu_Craft_Window_C::Gauge_Frame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Icon) == 0x000500, "Member 'UMainMenu_Craft_Window_C::Icon' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Icon_TgsGuide2) == 0x000508, "Member 'UMainMenu_Craft_Window_C::Icon_TgsGuide2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Img_Slash) == 0x000510, "Member 'UMainMenu_Craft_Window_C::Img_Slash' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, InfoWindowBg) == 0x000518, "Member 'UMainMenu_Craft_Window_C::InfoWindowBg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Light_1) == 0x000520, "Member 'UMainMenu_Craft_Window_C::Light_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Light_2) == 0x000528, "Member 'UMainMenu_Craft_Window_C::Light_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Line_1) == 0x000530, "Member 'UMainMenu_Craft_Window_C::Line_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Line1) == 0x000538, "Member 'UMainMenu_Craft_Window_C::Line1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Line1_1) == 0x000540, "Member 'UMainMenu_Craft_Window_C::Line1_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Line1_2) == 0x000548, "Member 'UMainMenu_Craft_Window_C::Line1_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Line1_3) == 0x000550, "Member 'UMainMenu_Craft_Window_C::Line1_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Line1_4) == 0x000558, "Member 'UMainMenu_Craft_Window_C::Line1_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Line1_5) == 0x000560, "Member 'UMainMenu_Craft_Window_C::Line1_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Line1_6) == 0x000568, "Member 'UMainMenu_Craft_Window_C::Line1_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Line1_7) == 0x000570, "Member 'UMainMenu_Craft_Window_C::Line1_7' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, LineLight) == 0x000578, "Member 'UMainMenu_Craft_Window_C::LineLight' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, ListPoint) == 0x000580, "Member 'UMainMenu_Craft_Window_C::ListPoint' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, ListPoint_1) == 0x000588, "Member 'UMainMenu_Craft_Window_C::ListPoint_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, ListPoint_2) == 0x000590, "Member 'UMainMenu_Craft_Window_C::ListPoint_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, ListPoint_3) == 0x000598, "Member 'UMainMenu_Craft_Window_C::ListPoint_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, ListPoint_4) == 0x0005A0, "Member 'UMainMenu_Craft_Window_C::ListPoint_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, ListPoint_5) == 0x0005A8, "Member 'UMainMenu_Craft_Window_C::ListPoint_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, ListPoint_6) == 0x0005B0, "Member 'UMainMenu_Craft_Window_C::ListPoint_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, ListPoint_7) == 0x0005B8, "Member 'UMainMenu_Craft_Window_C::ListPoint_7' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, ListPoint_8) == 0x0005C0, "Member 'UMainMenu_Craft_Window_C::ListPoint_8' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, ListPoint_9) == 0x0005C8, "Member 'UMainMenu_Craft_Window_C::ListPoint_9' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Txt_Alarm) == 0x0005D0, "Member 'UMainMenu_Craft_Window_C::Txt_Alarm' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Window_C, Txt_Title) == 0x0005D8, "Member 'UMainMenu_Craft_Window_C::Txt_Title' has a wrong offset!");

}

