#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_WeaponUpgrade_Info2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_WeaponUpgrade_Info2.MainMenu_WeaponUpgrade_Info2_C
// 0x0140 (0x0528 - 0x03E8)
class UMainMenu_WeaponUpgrade_Info2_C final : public UEndMainEquipWeaponInfoWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       SkillMenu_In;                                      // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Confirm_In;                                        // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CoreMenu_In;                                       // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2_1;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2_2;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Black;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Frame1;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Frame2;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCom_Btn_01_C*                          Btn_00;                                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCom_Btn_01_C*                          Btn_01;                                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_6;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame1;                                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame2_1;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame2_2;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame_Core1;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame_Core2;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame_Finished;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame_NotEnough;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_WeaponUpgrade_Target_C*       Icon_Cursor;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconBase;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconFrame;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight;                                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_WeaponUpgrade_StarIcon_C*     StarIcon;                                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_WeaponUpgrade_StarIcon_C*     StarIcon2;                                         // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              StarLine;                                          // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Icon;                                        // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn;                                           // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Finished;                                      // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_InfoCoreStar;                                  // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_NameCoreStar;                                  // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_NameSkillStar;                                 // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_NotEnough;                                     // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_SpInfo;                                        // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_StarInfo;                                      // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_StatusInfo;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_WeaponUpgrade_Info2(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_WeaponUpgrade_Info2_C">();
	}
	static class UMainMenu_WeaponUpgrade_Info2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_WeaponUpgrade_Info2_C>();
	}
};
static_assert(alignof(UMainMenu_WeaponUpgrade_Info2_C) == 0x000008, "Wrong alignment on UMainMenu_WeaponUpgrade_Info2_C");
static_assert(sizeof(UMainMenu_WeaponUpgrade_Info2_C) == 0x000528, "Wrong size on UMainMenu_WeaponUpgrade_Info2_C");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, UberGraphFrame) == 0x0003E8, "Member 'UMainMenu_WeaponUpgrade_Info2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, SkillMenu_In) == 0x0003F0, "Member 'UMainMenu_WeaponUpgrade_Info2_C::SkillMenu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Confirm_In) == 0x0003F8, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Confirm_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, CoreMenu_In) == 0x000400, "Member 'UMainMenu_WeaponUpgrade_Info2_C::CoreMenu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Base) == 0x000408, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Base1) == 0x000410, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Base1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Base2_1) == 0x000418, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Base2_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Base2_2) == 0x000420, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Base2_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Base_Black) == 0x000428, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Base_Black' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Base_Frame1) == 0x000430, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Base_Frame1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Base_Frame2) == 0x000438, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Base_Frame2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Btn_00) == 0x000440, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Btn_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Btn_01) == 0x000448, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Btn_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, EndImage_0) == 0x000450, "Member 'UMainMenu_WeaponUpgrade_Info2_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, EndImage_6) == 0x000458, "Member 'UMainMenu_WeaponUpgrade_Info2_C::EndImage_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Frame1) == 0x000460, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Frame1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Frame2_1) == 0x000468, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Frame2_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Frame2_2) == 0x000470, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Frame2_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Frame_Core1) == 0x000478, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Frame_Core1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Frame_Core2) == 0x000480, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Frame_Core2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Frame_Finished) == 0x000488, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Frame_Finished' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Frame_NotEnough) == 0x000490, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Frame_NotEnough' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Icon_Cursor) == 0x000498, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Icon_Cursor' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, IconBase) == 0x0004A0, "Member 'UMainMenu_WeaponUpgrade_Info2_C::IconBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, IconFrame) == 0x0004A8, "Member 'UMainMenu_WeaponUpgrade_Info2_C::IconFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, IconLeft) == 0x0004B0, "Member 'UMainMenu_WeaponUpgrade_Info2_C::IconLeft' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, IconRight) == 0x0004B8, "Member 'UMainMenu_WeaponUpgrade_Info2_C::IconRight' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, StarIcon) == 0x0004C0, "Member 'UMainMenu_WeaponUpgrade_Info2_C::StarIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, StarIcon2) == 0x0004C8, "Member 'UMainMenu_WeaponUpgrade_Info2_C::StarIcon2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, StarLine) == 0x0004D0, "Member 'UMainMenu_WeaponUpgrade_Info2_C::StarLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Title_Icon) == 0x0004D8, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Title_Icon' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Txt_Btn) == 0x0004E0, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Txt_Btn' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Txt_Finished) == 0x0004E8, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Txt_Finished' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Txt_InfoCoreStar) == 0x0004F0, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Txt_InfoCoreStar' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Txt_NameCoreStar) == 0x0004F8, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Txt_NameCoreStar' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Txt_NameSkillStar) == 0x000500, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Txt_NameSkillStar' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Txt_NotEnough) == 0x000508, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Txt_NotEnough' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Txt_SpInfo) == 0x000510, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Txt_SpInfo' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Txt_StarInfo) == 0x000518, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Txt_StarInfo' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Info2_C, Txt_StatusInfo) == 0x000520, "Member 'UMainMenu_WeaponUpgrade_Info2_C::Txt_StatusInfo' has a wrong offset!");

}

