#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_BattleSetting_Btn3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_BattleSetting_Btn3.MainMenu_BattleSetting_Btn3_C
// 0x00A0 (0x04A8 - 0x0408)
class UMainMenu_BattleSetting_Btn3_C final : public UEndBattleSettingBtn3
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       NormalAction;                                      // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AirAction;                                         // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gray;                                              // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChainAction2;                                      // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChainAction;                                       // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Gray;                                     // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_Hover;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             BattleSetting_Btn;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBaseLeft;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBaseRight;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterIcon1;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterIcon2;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterLight;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MarkBase;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MarkFrame;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_BattleSetting_Btn3(int32 EntryPoint);
	void BndEvt__BattleSetting_Btn_K2Node_ComponentBoundEvent_46_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BattleSetting_Btn_K2Node_ComponentBoundEvent_33_OnButtonHoverEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_BattleSetting_Btn3_C">();
	}
	static class UMainMenu_BattleSetting_Btn3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_BattleSetting_Btn3_C>();
	}
};
static_assert(alignof(UMainMenu_BattleSetting_Btn3_C) == 0x000008, "Wrong alignment on UMainMenu_BattleSetting_Btn3_C");
static_assert(sizeof(UMainMenu_BattleSetting_Btn3_C) == 0x0004A8, "Wrong size on UMainMenu_BattleSetting_Btn3_C");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, UberGraphFrame) == 0x000408, "Member 'UMainMenu_BattleSetting_Btn3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, NormalAction) == 0x000410, "Member 'UMainMenu_BattleSetting_Btn3_C::NormalAction' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, AirAction) == 0x000418, "Member 'UMainMenu_BattleSetting_Btn3_C::AirAction' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, Gray) == 0x000420, "Member 'UMainMenu_BattleSetting_Btn3_C::Gray' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, Normal) == 0x000428, "Member 'UMainMenu_BattleSetting_Btn3_C::Normal' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, ChainAction2) == 0x000430, "Member 'UMainMenu_BattleSetting_Btn3_C::ChainAction2' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, ChainAction) == 0x000438, "Member 'UMainMenu_BattleSetting_Btn3_C::ChainAction' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, BtnHover_Gray) == 0x000440, "Member 'UMainMenu_BattleSetting_Btn3_C::BtnHover_Gray' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, Loop) == 0x000448, "Member 'UMainMenu_BattleSetting_Btn3_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, BtnHover) == 0x000450, "Member 'UMainMenu_BattleSetting_Btn3_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, Base_Hover) == 0x000458, "Member 'UMainMenu_BattleSetting_Btn3_C::Base_Hover' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, BattleSetting_Btn) == 0x000460, "Member 'UMainMenu_BattleSetting_Btn3_C::BattleSetting_Btn' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, BtnBaseLeft) == 0x000468, "Member 'UMainMenu_BattleSetting_Btn3_C::BtnBaseLeft' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, BtnBaseRight) == 0x000470, "Member 'UMainMenu_BattleSetting_Btn3_C::BtnBaseRight' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, CenterIcon1) == 0x000478, "Member 'UMainMenu_BattleSetting_Btn3_C::CenterIcon1' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, CenterIcon2) == 0x000480, "Member 'UMainMenu_BattleSetting_Btn3_C::CenterIcon2' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, CenterLight) == 0x000488, "Member 'UMainMenu_BattleSetting_Btn3_C::CenterLight' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, Line) == 0x000490, "Member 'UMainMenu_BattleSetting_Btn3_C::Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, MarkBase) == 0x000498, "Member 'UMainMenu_BattleSetting_Btn3_C::MarkBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSetting_Btn3_C, MarkFrame) == 0x0004A0, "Member 'UMainMenu_BattleSetting_Btn3_C::MarkFrame' has a wrong offset!");

}

