#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_WeaponUpgrade_SelectIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_WeaponUpgrade_SelectIcon.MainMenu_WeaponUpgrade_SelectIcon_C
// 0x0038 (0x0400 - 0x03C8)
class UMainMenu_WeaponUpgrade_SelectIcon_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UEndImage*                              Base2;                                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame1;                                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Star;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ring;                                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Star_Button;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_WeaponUpgrade_SelectIcon(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_WeaponUpgrade_SelectIcon_C">();
	}
	static class UMainMenu_WeaponUpgrade_SelectIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_WeaponUpgrade_SelectIcon_C>();
	}
};
static_assert(alignof(UMainMenu_WeaponUpgrade_SelectIcon_C) == 0x000008, "Wrong alignment on UMainMenu_WeaponUpgrade_SelectIcon_C");
static_assert(sizeof(UMainMenu_WeaponUpgrade_SelectIcon_C) == 0x000400, "Wrong size on UMainMenu_WeaponUpgrade_SelectIcon_C");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SelectIcon_C, UberGraphFrame) == 0x0003C8, "Member 'UMainMenu_WeaponUpgrade_SelectIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SelectIcon_C, Base2) == 0x0003D0, "Member 'UMainMenu_WeaponUpgrade_SelectIcon_C::Base2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SelectIcon_C, Frame1) == 0x0003D8, "Member 'UMainMenu_WeaponUpgrade_SelectIcon_C::Frame1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SelectIcon_C, Icon_Star) == 0x0003E0, "Member 'UMainMenu_WeaponUpgrade_SelectIcon_C::Icon_Star' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SelectIcon_C, Img_Slash) == 0x0003E8, "Member 'UMainMenu_WeaponUpgrade_SelectIcon_C::Img_Slash' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SelectIcon_C, Ring) == 0x0003F0, "Member 'UMainMenu_WeaponUpgrade_SelectIcon_C::Ring' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SelectIcon_C, Star_Button) == 0x0003F8, "Member 'UMainMenu_WeaponUpgrade_SelectIcon_C::Star_Button' has a wrong offset!");

}

