#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_GameInformation

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_GameInformation.MainMenu_Card_GameInformation_C
// 0x0038 (0x0430 - 0x03F8)
class UMainMenu_Card_GameInformation_C final : public UEndCardInformationWindow
{
public:
	class UEndImage*                              Img_Base;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Hint;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Reward;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Rule;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line_Hint;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line_Reward;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line_Rule;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_GameInformation_C">();
	}
	static class UMainMenu_Card_GameInformation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_GameInformation_C>();
	}
};
static_assert(alignof(UMainMenu_Card_GameInformation_C) == 0x000008, "Wrong alignment on UMainMenu_Card_GameInformation_C");
static_assert(sizeof(UMainMenu_Card_GameInformation_C) == 0x000430, "Wrong size on UMainMenu_Card_GameInformation_C");
static_assert(offsetof(UMainMenu_Card_GameInformation_C, Img_Base) == 0x0003F8, "Member 'UMainMenu_Card_GameInformation_C::Img_Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_GameInformation_C, Img_Base_Hint) == 0x000400, "Member 'UMainMenu_Card_GameInformation_C::Img_Base_Hint' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_GameInformation_C, Img_Base_Reward) == 0x000408, "Member 'UMainMenu_Card_GameInformation_C::Img_Base_Reward' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_GameInformation_C, Img_Base_Rule) == 0x000410, "Member 'UMainMenu_Card_GameInformation_C::Img_Base_Rule' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_GameInformation_C, Img_Line_Hint) == 0x000418, "Member 'UMainMenu_Card_GameInformation_C::Img_Line_Hint' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_GameInformation_C, Img_Line_Reward) == 0x000420, "Member 'UMainMenu_Card_GameInformation_C::Img_Line_Reward' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_GameInformation_C, Img_Line_Rule) == 0x000428, "Member 'UMainMenu_Card_GameInformation_C::Img_Line_Rule' has a wrong offset!");

}

