#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_BouterRankCell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_BouterRankCell.MainMenu_Card_BouterRankCell_C
// 0x0038 (0x0400 - 0x03C8)
class UMainMenu_Card_BouterRankCell_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Unfinished;                                        // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Finished;                                          // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_00;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BG;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Check;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Check_1;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Frame;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_BouterRankCell_C">();
	}
	static class UMainMenu_Card_BouterRankCell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_BouterRankCell_C>();
	}
};
static_assert(alignof(UMainMenu_Card_BouterRankCell_C) == 0x000008, "Wrong alignment on UMainMenu_Card_BouterRankCell_C");
static_assert(sizeof(UMainMenu_Card_BouterRankCell_C) == 0x000400, "Wrong size on UMainMenu_Card_BouterRankCell_C");
static_assert(offsetof(UMainMenu_Card_BouterRankCell_C, Unfinished) == 0x0003C8, "Member 'UMainMenu_Card_BouterRankCell_C::Unfinished' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_BouterRankCell_C, Finished) == 0x0003D0, "Member 'UMainMenu_Card_BouterRankCell_C::Finished' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_BouterRankCell_C, Base_00) == 0x0003D8, "Member 'UMainMenu_Card_BouterRankCell_C::Base_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_BouterRankCell_C, Img_BG) == 0x0003E0, "Member 'UMainMenu_Card_BouterRankCell_C::Img_BG' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_BouterRankCell_C, Img_Check) == 0x0003E8, "Member 'UMainMenu_Card_BouterRankCell_C::Img_Check' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_BouterRankCell_C, Img_Check_1) == 0x0003F0, "Member 'UMainMenu_Card_BouterRankCell_C::Img_Check_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_BouterRankCell_C, Img_Frame) == 0x0003F8, "Member 'UMainMenu_Card_BouterRankCell_C::Img_Frame' has a wrong offset!");

}

