#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_MateriaInfo_Cell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_MateriaInfo_Cell.MainMenu_MateriaInfo_Cell_C
// 0x0038 (0x0400 - 0x03C8)
class UMainMenu_MateriaInfo_Cell_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       LvUp_Loop;                                         // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Invalid;                                           // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              ActiveBase;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_LvUp;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_MateriaInfo_Cell_C">();
	}
	static class UMainMenu_MateriaInfo_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_MateriaInfo_Cell_C>();
	}
};
static_assert(alignof(UMainMenu_MateriaInfo_Cell_C) == 0x000008, "Wrong alignment on UMainMenu_MateriaInfo_Cell_C");
static_assert(sizeof(UMainMenu_MateriaInfo_Cell_C) == 0x000400, "Wrong size on UMainMenu_MateriaInfo_Cell_C");
static_assert(offsetof(UMainMenu_MateriaInfo_Cell_C, LvUp_Loop) == 0x0003C8, "Member 'UMainMenu_MateriaInfo_Cell_C::LvUp_Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaInfo_Cell_C, Normal) == 0x0003D0, "Member 'UMainMenu_MateriaInfo_Cell_C::Normal' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaInfo_Cell_C, Invalid) == 0x0003D8, "Member 'UMainMenu_MateriaInfo_Cell_C::Invalid' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaInfo_Cell_C, ActiveBase) == 0x0003E0, "Member 'UMainMenu_MateriaInfo_Cell_C::ActiveBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaInfo_Cell_C, Bg) == 0x0003E8, "Member 'UMainMenu_MateriaInfo_Cell_C::Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaInfo_Cell_C, Icon_LvUp) == 0x0003F0, "Member 'UMainMenu_MateriaInfo_Cell_C::Icon_LvUp' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaInfo_Cell_C, Icon_Status) == 0x0003F8, "Member 'UMainMenu_MateriaInfo_Cell_C::Icon_Status' has a wrong offset!");

}

