#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_EnemyInformation

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_EnemyInformation.MainMenu_Card_EnemyInformation_C
// 0x0138 (0x0550 - 0x0418)
class UMainMenu_Card_EnemyInformation_C final : public UEndCardListWindow
{
public:
	class UWidgetAnimation*                       CardGot;                                           // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_Card_Full_C*             Card_Full;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_CardChallenge_Target_C*  CardChallengeTarget;                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_CardInformation_C*       CardInfo;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              GotBase;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              GotBase_1;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Clear;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Clear_1;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Item_C*                           Icon_Item_01;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Item_C*                           Icon_Item_02;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Item_C*                           Icon_Item_03;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_Icon_Rank_C*             Icon_Rank;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_X_G1_;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_X_G2_;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_X_G3_;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Deck;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_EnemyName;                                // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Forte;                                    // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_01;                                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_02;                                 // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_03;                                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_04;                                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Gradation;                                     // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Shadow;                                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light_1;                                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light_00;                                          // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light_01;                                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Prize_Bg1;                                         // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Prize_Bg2;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Prize_Bg3;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ItemName_G1;                                   // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ItemName_G2;                                   // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ItemName_G3;                                   // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ItemNum_G1;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ItemNum_G2;                                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ItemNum_G3;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_NoPrize;                                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_EnemyInformation_C">();
	}
	static class UMainMenu_Card_EnemyInformation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_EnemyInformation_C>();
	}
};
static_assert(alignof(UMainMenu_Card_EnemyInformation_C) == 0x000008, "Wrong alignment on UMainMenu_Card_EnemyInformation_C");
static_assert(sizeof(UMainMenu_Card_EnemyInformation_C) == 0x000550, "Wrong size on UMainMenu_Card_EnemyInformation_C");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, CardGot) == 0x000418, "Member 'UMainMenu_Card_EnemyInformation_C::CardGot' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Base1) == 0x000420, "Member 'UMainMenu_Card_EnemyInformation_C::Base1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Card_Full) == 0x000428, "Member 'UMainMenu_Card_EnemyInformation_C::Card_Full' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, CardChallengeTarget) == 0x000430, "Member 'UMainMenu_Card_EnemyInformation_C::CardChallengeTarget' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, CardInfo) == 0x000438, "Member 'UMainMenu_Card_EnemyInformation_C::CardInfo' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, GotBase) == 0x000440, "Member 'UMainMenu_Card_EnemyInformation_C::GotBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, GotBase_1) == 0x000448, "Member 'UMainMenu_Card_EnemyInformation_C::GotBase_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Icon_Clear) == 0x000450, "Member 'UMainMenu_Card_EnemyInformation_C::Icon_Clear' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Icon_Clear_1) == 0x000458, "Member 'UMainMenu_Card_EnemyInformation_C::Icon_Clear_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Icon_Item_01) == 0x000460, "Member 'UMainMenu_Card_EnemyInformation_C::Icon_Item_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Icon_Item_02) == 0x000468, "Member 'UMainMenu_Card_EnemyInformation_C::Icon_Item_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Icon_Item_03) == 0x000470, "Member 'UMainMenu_Card_EnemyInformation_C::Icon_Item_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Icon_Rank) == 0x000478, "Member 'UMainMenu_Card_EnemyInformation_C::Icon_Rank' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Icon_X_G1_) == 0x000480, "Member 'UMainMenu_Card_EnemyInformation_C::Icon_X_G1_' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Icon_X_G2_) == 0x000488, "Member 'UMainMenu_Card_EnemyInformation_C::Icon_X_G2_' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Icon_X_G3_) == 0x000490, "Member 'UMainMenu_Card_EnemyInformation_C::Icon_X_G3_' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Img_Base) == 0x000498, "Member 'UMainMenu_Card_EnemyInformation_C::Img_Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Img_Base_Deck) == 0x0004A0, "Member 'UMainMenu_Card_EnemyInformation_C::Img_Base_Deck' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Img_Base_EnemyName) == 0x0004A8, "Member 'UMainMenu_Card_EnemyInformation_C::Img_Base_EnemyName' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Img_Base_Forte) == 0x0004B0, "Member 'UMainMenu_Card_EnemyInformation_C::Img_Base_Forte' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Img_CornerDeco_01) == 0x0004B8, "Member 'UMainMenu_Card_EnemyInformation_C::Img_CornerDeco_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Img_CornerDeco_02) == 0x0004C0, "Member 'UMainMenu_Card_EnemyInformation_C::Img_CornerDeco_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Img_CornerDeco_03) == 0x0004C8, "Member 'UMainMenu_Card_EnemyInformation_C::Img_CornerDeco_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Img_CornerDeco_04) == 0x0004D0, "Member 'UMainMenu_Card_EnemyInformation_C::Img_CornerDeco_04' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Img_Gradation) == 0x0004D8, "Member 'UMainMenu_Card_EnemyInformation_C::Img_Gradation' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Img_Shadow) == 0x0004E0, "Member 'UMainMenu_Card_EnemyInformation_C::Img_Shadow' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Light_1) == 0x0004E8, "Member 'UMainMenu_Card_EnemyInformation_C::Light_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Light_00) == 0x0004F0, "Member 'UMainMenu_Card_EnemyInformation_C::Light_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Light_01) == 0x0004F8, "Member 'UMainMenu_Card_EnemyInformation_C::Light_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Prize_Bg1) == 0x000500, "Member 'UMainMenu_Card_EnemyInformation_C::Prize_Bg1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Prize_Bg2) == 0x000508, "Member 'UMainMenu_Card_EnemyInformation_C::Prize_Bg2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Prize_Bg3) == 0x000510, "Member 'UMainMenu_Card_EnemyInformation_C::Prize_Bg3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Txt_ItemName_G1) == 0x000518, "Member 'UMainMenu_Card_EnemyInformation_C::Txt_ItemName_G1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Txt_ItemName_G2) == 0x000520, "Member 'UMainMenu_Card_EnemyInformation_C::Txt_ItemName_G2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Txt_ItemName_G3) == 0x000528, "Member 'UMainMenu_Card_EnemyInformation_C::Txt_ItemName_G3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Txt_ItemNum_G1) == 0x000530, "Member 'UMainMenu_Card_EnemyInformation_C::Txt_ItemNum_G1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Txt_ItemNum_G2) == 0x000538, "Member 'UMainMenu_Card_EnemyInformation_C::Txt_ItemNum_G2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Txt_ItemNum_G3) == 0x000540, "Member 'UMainMenu_Card_EnemyInformation_C::Txt_ItemNum_G3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EnemyInformation_C, Txt_NoPrize) == 0x000548, "Member 'UMainMenu_Card_EnemyInformation_C::Txt_NoPrize' has a wrong offset!");

}

