#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_ChapterSelect_Top

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_ChapterSelect_Top.MainMenu_ChapterSelect_Top_C
// 0x00F8 (0x0550 - 0x0458)
class UMainMenu_ChapterSelect_Top_C final : public UEndChapterSelectMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0458(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Bg_Normal;                                         // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bg_Dark;                                           // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_In;                                         // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_Out;                                        // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_1;                                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_2;                                           // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_4;                                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Black;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Left;                                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Right;                                        // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_3;                                              // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg;                                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg_1;                                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg_2;                                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg_3;                                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg_4;                                    // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Img;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCategoryTitle_C*                       CategoryTitle;                                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconBase;                                          // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              InfoBase;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              InfoBase_1;                                        // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              InfoLine;                                          // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_1;                                            // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point2_1;                                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgLeft_C*              System_BgLeft;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgRight_C*             System_BgRight;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_ChapterSelect_Top(int32 EntryPoint);
	void SetCellImage(class UEndImage* Widget, class UPaperSprite* Sprite);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_ChapterSelect_Top_C">();
	}
	static class UMainMenu_ChapterSelect_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_ChapterSelect_Top_C>();
	}
};
static_assert(alignof(UMainMenu_ChapterSelect_Top_C) == 0x000008, "Wrong alignment on UMainMenu_ChapterSelect_Top_C");
static_assert(sizeof(UMainMenu_ChapterSelect_Top_C) == 0x000550, "Wrong size on UMainMenu_ChapterSelect_Top_C");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, UberGraphFrame) == 0x000458, "Member 'UMainMenu_ChapterSelect_Top_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Bg_Normal) == 0x000460, "Member 'UMainMenu_ChapterSelect_Top_C::Bg_Normal' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Bg_Dark) == 0x000468, "Member 'UMainMenu_ChapterSelect_Top_C::Bg_Dark' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Change_In) == 0x000470, "Member 'UMainMenu_ChapterSelect_Top_C::Change_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Change_Out) == 0x000478, "Member 'UMainMenu_ChapterSelect_Top_C::Change_Out' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Menu_In) == 0x000480, "Member 'UMainMenu_ChapterSelect_Top_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Base) == 0x000488, "Member 'UMainMenu_ChapterSelect_Top_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Base1_1) == 0x000490, "Member 'UMainMenu_ChapterSelect_Top_C::Base1_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Base1_2) == 0x000498, "Member 'UMainMenu_ChapterSelect_Top_C::Base1_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Base1_4) == 0x0004A0, "Member 'UMainMenu_ChapterSelect_Top_C::Base1_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Base_Black) == 0x0004A8, "Member 'UMainMenu_ChapterSelect_Top_C::Base_Black' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Base_Left) == 0x0004B0, "Member 'UMainMenu_ChapterSelect_Top_C::Base_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Base_Right) == 0x0004B8, "Member 'UMainMenu_ChapterSelect_Top_C::Base_Right' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Bg_3) == 0x0004C0, "Member 'UMainMenu_ChapterSelect_Top_C::Bg_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Billboard_Bg) == 0x0004C8, "Member 'UMainMenu_ChapterSelect_Top_C::Billboard_Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Billboard_Bg_1) == 0x0004D0, "Member 'UMainMenu_ChapterSelect_Top_C::Billboard_Bg_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Billboard_Bg_2) == 0x0004D8, "Member 'UMainMenu_ChapterSelect_Top_C::Billboard_Bg_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Billboard_Bg_3) == 0x0004E0, "Member 'UMainMenu_ChapterSelect_Top_C::Billboard_Bg_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Billboard_Bg_4) == 0x0004E8, "Member 'UMainMenu_ChapterSelect_Top_C::Billboard_Bg_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Billboard_Img) == 0x0004F0, "Member 'UMainMenu_ChapterSelect_Top_C::Billboard_Img' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, CategoryTitle) == 0x0004F8, "Member 'UMainMenu_ChapterSelect_Top_C::CategoryTitle' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, IconBase) == 0x000500, "Member 'UMainMenu_ChapterSelect_Top_C::IconBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, InfoBase) == 0x000508, "Member 'UMainMenu_ChapterSelect_Top_C::InfoBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, InfoBase_1) == 0x000510, "Member 'UMainMenu_ChapterSelect_Top_C::InfoBase_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, InfoLine) == 0x000518, "Member 'UMainMenu_ChapterSelect_Top_C::InfoLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Line) == 0x000520, "Member 'UMainMenu_ChapterSelect_Top_C::Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Line_1) == 0x000528, "Member 'UMainMenu_ChapterSelect_Top_C::Line_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Point2_1) == 0x000530, "Member 'UMainMenu_ChapterSelect_Top_C::Point2_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, System_BgLeft) == 0x000538, "Member 'UMainMenu_ChapterSelect_Top_C::System_BgLeft' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, System_BgRight) == 0x000540, "Member 'UMainMenu_ChapterSelect_Top_C::System_BgRight' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Txt_Title) == 0x000548, "Member 'UMainMenu_ChapterSelect_Top_C::Txt_Title' has a wrong offset!");

}

