#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_CardChallenge_Target

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_CardChallenge_Target.MainMenu_Card_CardChallenge_Target_C
// 0x0048 (0x0410 - 0x03C8)
class UMainMenu_Card_CardChallenge_Target_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Line1_3;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_4;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_5;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_HightScore1;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_HightScore2;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_HightScore3;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_PrizeTitle_H1;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_PrizeTitle_H2;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              WindowBase;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_CardChallenge_Target_C">();
	}
	static class UMainMenu_Card_CardChallenge_Target_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_CardChallenge_Target_C>();
	}
};
static_assert(alignof(UMainMenu_Card_CardChallenge_Target_C) == 0x000008, "Wrong alignment on UMainMenu_Card_CardChallenge_Target_C");
static_assert(sizeof(UMainMenu_Card_CardChallenge_Target_C) == 0x000410, "Wrong size on UMainMenu_Card_CardChallenge_Target_C");
static_assert(offsetof(UMainMenu_Card_CardChallenge_Target_C, Line1_3) == 0x0003C8, "Member 'UMainMenu_Card_CardChallenge_Target_C::Line1_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardChallenge_Target_C, Line1_4) == 0x0003D0, "Member 'UMainMenu_Card_CardChallenge_Target_C::Line1_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardChallenge_Target_C, Line1_5) == 0x0003D8, "Member 'UMainMenu_Card_CardChallenge_Target_C::Line1_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardChallenge_Target_C, Txt_HightScore1) == 0x0003E0, "Member 'UMainMenu_Card_CardChallenge_Target_C::Txt_HightScore1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardChallenge_Target_C, Txt_HightScore2) == 0x0003E8, "Member 'UMainMenu_Card_CardChallenge_Target_C::Txt_HightScore2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardChallenge_Target_C, Txt_HightScore3) == 0x0003F0, "Member 'UMainMenu_Card_CardChallenge_Target_C::Txt_HightScore3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardChallenge_Target_C, Txt_PrizeTitle_H1) == 0x0003F8, "Member 'UMainMenu_Card_CardChallenge_Target_C::Txt_PrizeTitle_H1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardChallenge_Target_C, Txt_PrizeTitle_H2) == 0x000400, "Member 'UMainMenu_Card_CardChallenge_Target_C::Txt_PrizeTitle_H2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardChallenge_Target_C, WindowBase) == 0x000408, "Member 'UMainMenu_Card_CardChallenge_Target_C::WindowBase' has a wrong offset!");

}

