#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Craft_Top

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Craft_Top.MainMenu_Craft_Top_C
// 0x00D8 (0x0730 - 0x0658)
class UMainMenu_Craft_Top_C final : public UEndItemCraftMenu
{
public:
	class UWidgetAnimation*                       MaterialInfo_In;                                   // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Status_In;                                         // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AccessoryInfo_In;                                  // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SortList_In;                                       // 0x0670(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LightDotLoop;                                      // 0x0680(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LightRingLoop;                                     // 0x0688(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              BaseDot1;                                          // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot2;                                          // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot3;                                          // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot4;                                          // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot5;                                          // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCategoryTitle_C*                       CategoryTitle;                                     // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Craft_MaterialInfo_C*         Craft_MaterialInfo;                                // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Craft_Status_C*               Craft_Status;                                      // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipInfo_C*                           EquipInfo;                                         // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipInfoDetail_Accessory_C*           EquipInfoDetail_Accessory;                         // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LightBg00;                                         // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1;                                             // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2;                                             // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ring1;                                             // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ring2;                                             // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ring3;                                             // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ring4;                                             // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USort_C*                                Sort;                                              // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgLeft_C*              System_BgLeft;                                     // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Craft_Top_C">();
	}
	static class UMainMenu_Craft_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Craft_Top_C>();
	}
};
static_assert(alignof(UMainMenu_Craft_Top_C) == 0x000008, "Wrong alignment on UMainMenu_Craft_Top_C");
static_assert(sizeof(UMainMenu_Craft_Top_C) == 0x000730, "Wrong size on UMainMenu_Craft_Top_C");
static_assert(offsetof(UMainMenu_Craft_Top_C, MaterialInfo_In) == 0x000658, "Member 'UMainMenu_Craft_Top_C::MaterialInfo_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, Status_In) == 0x000660, "Member 'UMainMenu_Craft_Top_C::Status_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, AccessoryInfo_In) == 0x000668, "Member 'UMainMenu_Craft_Top_C::AccessoryInfo_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, SortList_In) == 0x000670, "Member 'UMainMenu_Craft_Top_C::SortList_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, Menu_In) == 0x000678, "Member 'UMainMenu_Craft_Top_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, LightDotLoop) == 0x000680, "Member 'UMainMenu_Craft_Top_C::LightDotLoop' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, LightRingLoop) == 0x000688, "Member 'UMainMenu_Craft_Top_C::LightRingLoop' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, BaseDot1) == 0x000690, "Member 'UMainMenu_Craft_Top_C::BaseDot1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, BaseDot2) == 0x000698, "Member 'UMainMenu_Craft_Top_C::BaseDot2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, BaseDot3) == 0x0006A0, "Member 'UMainMenu_Craft_Top_C::BaseDot3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, BaseDot4) == 0x0006A8, "Member 'UMainMenu_Craft_Top_C::BaseDot4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, BaseDot5) == 0x0006B0, "Member 'UMainMenu_Craft_Top_C::BaseDot5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, CategoryTitle) == 0x0006B8, "Member 'UMainMenu_Craft_Top_C::CategoryTitle' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, Craft_MaterialInfo) == 0x0006C0, "Member 'UMainMenu_Craft_Top_C::Craft_MaterialInfo' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, Craft_Status) == 0x0006C8, "Member 'UMainMenu_Craft_Top_C::Craft_Status' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, EquipInfo) == 0x0006D0, "Member 'UMainMenu_Craft_Top_C::EquipInfo' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, EquipInfoDetail_Accessory) == 0x0006D8, "Member 'UMainMenu_Craft_Top_C::EquipInfoDetail_Accessory' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, Light) == 0x0006E0, "Member 'UMainMenu_Craft_Top_C::Light' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, LightBg00) == 0x0006E8, "Member 'UMainMenu_Craft_Top_C::LightBg00' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, Line1) == 0x0006F0, "Member 'UMainMenu_Craft_Top_C::Line1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, Line2) == 0x0006F8, "Member 'UMainMenu_Craft_Top_C::Line2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, Ring1) == 0x000700, "Member 'UMainMenu_Craft_Top_C::Ring1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, Ring2) == 0x000708, "Member 'UMainMenu_Craft_Top_C::Ring2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, Ring3) == 0x000710, "Member 'UMainMenu_Craft_Top_C::Ring3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, Ring4) == 0x000718, "Member 'UMainMenu_Craft_Top_C::Ring4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, Sort) == 0x000720, "Member 'UMainMenu_Craft_Top_C::Sort' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Top_C, System_BgLeft) == 0x000728, "Member 'UMainMenu_Craft_Top_C::System_BgLeft' has a wrong offset!");

}

