#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Options_Display2

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Options_Display2.MainMenu_Options_Display2_C
// 0x0048 (0x0410 - 0x03C8)
class UMainMenu_Options_Display2_C final : public UEndUserWidget
{
public:
	class UEndPieImage*                           Arrow_Left;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           Arrow_Right;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Black;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Frame;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_White;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Black;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Gauge_Head;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_White;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Setting;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Options_Display2_C">();
	}
	static class UMainMenu_Options_Display2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Options_Display2_C>();
	}
};
static_assert(alignof(UMainMenu_Options_Display2_C) == 0x000008, "Wrong alignment on UMainMenu_Options_Display2_C");
static_assert(sizeof(UMainMenu_Options_Display2_C) == 0x000410, "Wrong size on UMainMenu_Options_Display2_C");
static_assert(offsetof(UMainMenu_Options_Display2_C, Arrow_Left) == 0x0003C8, "Member 'UMainMenu_Options_Display2_C::Arrow_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Arrow_Right) == 0x0003D0, "Member 'UMainMenu_Options_Display2_C::Arrow_Right' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Base_Black) == 0x0003D8, "Member 'UMainMenu_Options_Display2_C::Base_Black' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Base_Frame) == 0x0003E0, "Member 'UMainMenu_Options_Display2_C::Base_Frame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Base_White) == 0x0003E8, "Member 'UMainMenu_Options_Display2_C::Base_White' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Img_Black) == 0x0003F0, "Member 'UMainMenu_Options_Display2_C::Img_Black' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Img_Gauge_Head) == 0x0003F8, "Member 'UMainMenu_Options_Display2_C::Img_Gauge_Head' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Img_White) == 0x000400, "Member 'UMainMenu_Options_Display2_C::Img_White' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Txt_Setting) == 0x000408, "Member 'UMainMenu_Options_Display2_C::Txt_Setting' has a wrong offset!");

}

