#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_BattleReport_Gauge

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_BattleReport_Gauge.MainMenu_BattleReport_Gauge_C
// 0x00A8 (0x0470 - 0x03C8)
class UMainMenu_BattleReport_Gauge_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Single_Clear;                                      // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Single;                                            // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Finished;                                          // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Progress_Clear;                                    // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Progress;                                          // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             Border_Finished;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             CircleBase;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             EndCircle_0;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        FinishedBox;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Gauge_Frame;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Gauge_Progress;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        GaugeBox;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Clear2;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_1;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        ProgressDetail;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        SingleBox;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Finished;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num;                                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Total;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_BattleReport_Gauge_C">();
	}
	static class UMainMenu_BattleReport_Gauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_BattleReport_Gauge_C>();
	}
};
static_assert(alignof(UMainMenu_BattleReport_Gauge_C) == 0x000008, "Wrong alignment on UMainMenu_BattleReport_Gauge_C");
static_assert(sizeof(UMainMenu_BattleReport_Gauge_C) == 0x000470, "Wrong size on UMainMenu_BattleReport_Gauge_C");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, Single_Clear) == 0x0003C8, "Member 'UMainMenu_BattleReport_Gauge_C::Single_Clear' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, Single) == 0x0003D0, "Member 'UMainMenu_BattleReport_Gauge_C::Single' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, Finished) == 0x0003D8, "Member 'UMainMenu_BattleReport_Gauge_C::Finished' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, Progress_Clear) == 0x0003E0, "Member 'UMainMenu_BattleReport_Gauge_C::Progress_Clear' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, Progress) == 0x0003E8, "Member 'UMainMenu_BattleReport_Gauge_C::Progress' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, Bg) == 0x0003F0, "Member 'UMainMenu_BattleReport_Gauge_C::Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, Border_Finished) == 0x0003F8, "Member 'UMainMenu_BattleReport_Gauge_C::Border_Finished' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, CircleBase) == 0x000400, "Member 'UMainMenu_BattleReport_Gauge_C::CircleBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, EndCircle_0) == 0x000408, "Member 'UMainMenu_BattleReport_Gauge_C::EndCircle_0' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, FinishedBox) == 0x000410, "Member 'UMainMenu_BattleReport_Gauge_C::FinishedBox' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, Gauge_Frame) == 0x000418, "Member 'UMainMenu_BattleReport_Gauge_C::Gauge_Frame' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, Gauge_Progress) == 0x000420, "Member 'UMainMenu_BattleReport_Gauge_C::Gauge_Progress' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, GaugeBox) == 0x000428, "Member 'UMainMenu_BattleReport_Gauge_C::GaugeBox' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, Icon_Clear2) == 0x000430, "Member 'UMainMenu_BattleReport_Gauge_C::Icon_Clear2' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, Img_Slash) == 0x000438, "Member 'UMainMenu_BattleReport_Gauge_C::Img_Slash' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, Img_Slash_1) == 0x000440, "Member 'UMainMenu_BattleReport_Gauge_C::Img_Slash_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, ProgressDetail) == 0x000448, "Member 'UMainMenu_BattleReport_Gauge_C::ProgressDetail' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, SingleBox) == 0x000450, "Member 'UMainMenu_BattleReport_Gauge_C::SingleBox' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, Txt_Finished) == 0x000458, "Member 'UMainMenu_BattleReport_Gauge_C::Txt_Finished' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, Txt_Num) == 0x000460, "Member 'UMainMenu_BattleReport_Gauge_C::Txt_Num' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Gauge_C, Txt_Total) == 0x000468, "Member 'UMainMenu_BattleReport_Gauge_C::Txt_Total' has a wrong offset!");

}

