#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_EnemyReport_Detail

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_EnemyReport_Detail.MainMenu_EnemyReport_Detail_C
// 0x0070 (0x0468 - 0x03F8)
class UMainMenu_EnemyReport_Detail_C final : public UEndEnemyReportSimpleDetail
{
public:
	class UEndImage*                              Arrow_00;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_01;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_1;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_4;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_R;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_R_1;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_R_2;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_1;                                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_3;                                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         Line_4;                                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_AreaTitle_1;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_LogTitle_1;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_EnemyReport_Detail_C">();
	}
	static class UMainMenu_EnemyReport_Detail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_EnemyReport_Detail_C>();
	}
};
static_assert(alignof(UMainMenu_EnemyReport_Detail_C) == 0x000008, "Wrong alignment on UMainMenu_EnemyReport_Detail_C");
static_assert(sizeof(UMainMenu_EnemyReport_Detail_C) == 0x000468, "Wrong size on UMainMenu_EnemyReport_Detail_C");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Arrow_00) == 0x0003F8, "Member 'UMainMenu_EnemyReport_Detail_C::Arrow_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Arrow_01) == 0x000400, "Member 'UMainMenu_EnemyReport_Detail_C::Arrow_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Base1) == 0x000408, "Member 'UMainMenu_EnemyReport_Detail_C::Base1' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Base1_1) == 0x000410, "Member 'UMainMenu_EnemyReport_Detail_C::Base1_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Base1_4) == 0x000418, "Member 'UMainMenu_EnemyReport_Detail_C::Base1_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Img_Base_R) == 0x000420, "Member 'UMainMenu_EnemyReport_Detail_C::Img_Base_R' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Img_Base_R_1) == 0x000428, "Member 'UMainMenu_EnemyReport_Detail_C::Img_Base_R_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Img_Base_R_2) == 0x000430, "Member 'UMainMenu_EnemyReport_Detail_C::Img_Base_R_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Line) == 0x000438, "Member 'UMainMenu_EnemyReport_Detail_C::Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Line_1) == 0x000440, "Member 'UMainMenu_EnemyReport_Detail_C::Line_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Line_3) == 0x000448, "Member 'UMainMenu_EnemyReport_Detail_C::Line_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Line_4) == 0x000450, "Member 'UMainMenu_EnemyReport_Detail_C::Line_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Txt_AreaTitle_1) == 0x000458, "Member 'UMainMenu_EnemyReport_Detail_C::Txt_AreaTitle_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Txt_LogTitle_1) == 0x000460, "Member 'UMainMenu_EnemyReport_Detail_C::Txt_LogTitle_1' has a wrong offset!");

}

