#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_CardInformation

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_CardInformation.MainMenu_Card_CardInformation_C
// 0x00A0 (0x0468 - 0x03C8)
class UMainMenu_Card_CardInformation_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       CDS;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NoGuide;                                           // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Guide;                                             // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InGame_Neutral;                                    // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InGame_Enemy;                                      // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InGame;                                            // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NoBg;                                              // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Info_in;                                           // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_BG;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Bg_Enemy;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Bg_Neutral;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_01;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_02;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_03;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_04;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line_1;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Shadow;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Info_Bg;                                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Info_Bg_CDS;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_CardInformation_C">();
	}
	static class UMainMenu_Card_CardInformation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_CardInformation_C>();
	}
};
static_assert(alignof(UMainMenu_Card_CardInformation_C) == 0x000008, "Wrong alignment on UMainMenu_Card_CardInformation_C");
static_assert(sizeof(UMainMenu_Card_CardInformation_C) == 0x000468, "Wrong size on UMainMenu_Card_CardInformation_C");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, CDS) == 0x0003C8, "Member 'UMainMenu_Card_CardInformation_C::CDS' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, NoGuide) == 0x0003D0, "Member 'UMainMenu_Card_CardInformation_C::NoGuide' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, Guide) == 0x0003D8, "Member 'UMainMenu_Card_CardInformation_C::Guide' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, InGame_Neutral) == 0x0003E0, "Member 'UMainMenu_Card_CardInformation_C::InGame_Neutral' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, InGame_Enemy) == 0x0003E8, "Member 'UMainMenu_Card_CardInformation_C::InGame_Enemy' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, InGame) == 0x0003F0, "Member 'UMainMenu_Card_CardInformation_C::InGame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, NoBg) == 0x0003F8, "Member 'UMainMenu_Card_CardInformation_C::NoBg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, Info_in) == 0x000400, "Member 'UMainMenu_Card_CardInformation_C::Info_in' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, Img_BG) == 0x000408, "Member 'UMainMenu_Card_CardInformation_C::Img_BG' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, Img_Bg_Enemy) == 0x000410, "Member 'UMainMenu_Card_CardInformation_C::Img_Bg_Enemy' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, Img_Bg_Neutral) == 0x000418, "Member 'UMainMenu_Card_CardInformation_C::Img_Bg_Neutral' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, Img_CornerDeco_01) == 0x000420, "Member 'UMainMenu_Card_CardInformation_C::Img_CornerDeco_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, Img_CornerDeco_02) == 0x000428, "Member 'UMainMenu_Card_CardInformation_C::Img_CornerDeco_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, Img_CornerDeco_03) == 0x000430, "Member 'UMainMenu_Card_CardInformation_C::Img_CornerDeco_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, Img_CornerDeco_04) == 0x000438, "Member 'UMainMenu_Card_CardInformation_C::Img_CornerDeco_04' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, Img_Line) == 0x000440, "Member 'UMainMenu_Card_CardInformation_C::Img_Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, Img_Line_1) == 0x000448, "Member 'UMainMenu_Card_CardInformation_C::Img_Line_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, Img_Shadow) == 0x000450, "Member 'UMainMenu_Card_CardInformation_C::Img_Shadow' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, Info_Bg) == 0x000458, "Member 'UMainMenu_Card_CardInformation_C::Info_Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardInformation_C, Info_Bg_CDS) == 0x000460, "Member 'UMainMenu_Card_CardInformation_C::Info_Bg_CDS' has a wrong offset!");

}

