#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_EquipSelect_Cell_03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_EquipSelect_Cell_03.MainMenu_EquipSelect_Cell_03_C
// 0x00B0 (0x0478 - 0x03C8)
class UMainMenu_EquipSelect_Cell_03_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       BtnHover;                                          // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Ap;                                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           AwayIcon;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_172;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Core_C*                           Icon_Core;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Item_C*                  Icon_Item;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Materia_C*                        Icon_Materia;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_New;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateria_List_Equip_C*                  Materia_List;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              OwnerBaseColor;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           OwnerTag;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           OwnerTag_In;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           OwnerTag_Out;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Ap_Total;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Ap_Vol;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_MateriaLv;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num;                                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_EquipSelect_Cell_03(int32 EntryPoint);
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_16_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_EquipSelect_Cell_03_C">();
	}
	static class UMainMenu_EquipSelect_Cell_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_EquipSelect_Cell_03_C>();
	}
};
static_assert(alignof(UMainMenu_EquipSelect_Cell_03_C) == 0x000008, "Wrong alignment on UMainMenu_EquipSelect_Cell_03_C");
static_assert(sizeof(UMainMenu_EquipSelect_Cell_03_C) == 0x000478, "Wrong size on UMainMenu_EquipSelect_Cell_03_C");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, UberGraphFrame) == 0x0003C8, "Member 'UMainMenu_EquipSelect_Cell_03_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, BtnHover) == 0x0003D0, "Member 'UMainMenu_EquipSelect_Cell_03_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, Ap) == 0x0003D8, "Member 'UMainMenu_EquipSelect_Cell_03_C::Ap' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, AwayIcon) == 0x0003E0, "Member 'UMainMenu_EquipSelect_Cell_03_C::AwayIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, EndImage) == 0x0003E8, "Member 'UMainMenu_EquipSelect_Cell_03_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, EndImage_172) == 0x0003F0, "Member 'UMainMenu_EquipSelect_Cell_03_C::EndImage_172' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, Icon_Core) == 0x0003F8, "Member 'UMainMenu_EquipSelect_Cell_03_C::Icon_Core' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, Icon_Item) == 0x000400, "Member 'UMainMenu_EquipSelect_Cell_03_C::Icon_Item' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, Icon_Materia) == 0x000408, "Member 'UMainMenu_EquipSelect_Cell_03_C::Icon_Materia' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, Icon_New) == 0x000410, "Member 'UMainMenu_EquipSelect_Cell_03_C::Icon_New' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, Img_Slash) == 0x000418, "Member 'UMainMenu_EquipSelect_Cell_03_C::Img_Slash' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, MainMenu_Btn) == 0x000420, "Member 'UMainMenu_EquipSelect_Cell_03_C::MainMenu_Btn' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, Materia_List) == 0x000428, "Member 'UMainMenu_EquipSelect_Cell_03_C::Materia_List' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, OwnerBaseColor) == 0x000430, "Member 'UMainMenu_EquipSelect_Cell_03_C::OwnerBaseColor' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, OwnerTag) == 0x000438, "Member 'UMainMenu_EquipSelect_Cell_03_C::OwnerTag' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, OwnerTag_In) == 0x000440, "Member 'UMainMenu_EquipSelect_Cell_03_C::OwnerTag_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, OwnerTag_Out) == 0x000448, "Member 'UMainMenu_EquipSelect_Cell_03_C::OwnerTag_Out' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, Txt_Ap_Total) == 0x000450, "Member 'UMainMenu_EquipSelect_Cell_03_C::Txt_Ap_Total' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, Txt_Ap_Vol) == 0x000458, "Member 'UMainMenu_EquipSelect_Cell_03_C::Txt_Ap_Vol' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, Txt_MateriaLv) == 0x000460, "Member 'UMainMenu_EquipSelect_Cell_03_C::Txt_MateriaLv' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, Txt_Num) == 0x000468, "Member 'UMainMenu_EquipSelect_Cell_03_C::Txt_Num' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_03_C, Txt_Title) == 0x000470, "Member 'UMainMenu_EquipSelect_Cell_03_C::Txt_Title' has a wrong offset!");

}

