#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Options_ErrorMessage

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Options_ErrorMessage.MainMenu_Options_ErrorMessage_C
// 0x0038 (0x0400 - 0x03C8)
class UMainMenu_Options_ErrorMessage_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Bottom;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Top;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow;                                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ErrorMessage;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Options_ErrorMessage_C">();
	}
	static class UMainMenu_Options_ErrorMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Options_ErrorMessage_C>();
	}
};
static_assert(alignof(UMainMenu_Options_ErrorMessage_C) == 0x000008, "Wrong alignment on UMainMenu_Options_ErrorMessage_C");
static_assert(sizeof(UMainMenu_Options_ErrorMessage_C) == 0x000400, "Wrong size on UMainMenu_Options_ErrorMessage_C");
static_assert(offsetof(UMainMenu_Options_ErrorMessage_C, Out) == 0x0003C8, "Member 'UMainMenu_Options_ErrorMessage_C::Out' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_ErrorMessage_C, In) == 0x0003D0, "Member 'UMainMenu_Options_ErrorMessage_C::In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_ErrorMessage_C, Base) == 0x0003D8, "Member 'UMainMenu_Options_ErrorMessage_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_ErrorMessage_C, Line_Bottom) == 0x0003E0, "Member 'UMainMenu_Options_ErrorMessage_C::Line_Bottom' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_ErrorMessage_C, Line_Top) == 0x0003E8, "Member 'UMainMenu_Options_ErrorMessage_C::Line_Top' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_ErrorMessage_C, Shadow) == 0x0003F0, "Member 'UMainMenu_Options_ErrorMessage_C::Shadow' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_ErrorMessage_C, Txt_ErrorMessage) == 0x0003F8, "Member 'UMainMenu_Options_ErrorMessage_C::Txt_ErrorMessage' has a wrong offset!");

}

