#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_Preset_ListItemLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_Preset_ListItemLight.MainMenu_Card_Preset_ListItemLight_C
// 0x0020 (0x0450 - 0x0430)
class UMainMenu_Card_Preset_ListItemLight_C final : public UEndMainItemSelectBtnText
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_BG;                                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_Card_Preset_ListItemLight(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_Preset_ListItemLight_C">();
	}
	static class UMainMenu_Card_Preset_ListItemLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_Preset_ListItemLight_C>();
	}
};
static_assert(alignof(UMainMenu_Card_Preset_ListItemLight_C) == 0x000008, "Wrong alignment on UMainMenu_Card_Preset_ListItemLight_C");
static_assert(sizeof(UMainMenu_Card_Preset_ListItemLight_C) == 0x000450, "Wrong size on UMainMenu_Card_Preset_ListItemLight_C");
static_assert(offsetof(UMainMenu_Card_Preset_ListItemLight_C, UberGraphFrame) == 0x000430, "Member 'UMainMenu_Card_Preset_ListItemLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_ListItemLight_C, Loop) == 0x000438, "Member 'UMainMenu_Card_Preset_ListItemLight_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_ListItemLight_C, Img_BG) == 0x000440, "Member 'UMainMenu_Card_Preset_ListItemLight_C::Img_BG' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_ListItemLight_C, Img_BtnLight) == 0x000448, "Member 'UMainMenu_Card_Preset_ListItemLight_C::Img_BtnLight' has a wrong offset!");

}

