#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_EditList

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_EditList.MainMenu_Card_EditList_C
// 0x0080 (0x0460 - 0x03E0)
class UMainMenu_Card_EditList_C final : public UEndCardEditWindow
{
public:
	class UWidgetAnimation*                       EditList_Inactive;                                 // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EditList_Active;                                   // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_Base;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_00;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_01;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_02;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_03;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnBg;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_01;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_02;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_03;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_04;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Icon;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Light;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_TextBase;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_TitleBg;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_EditList_C">();
	}
	static class UMainMenu_Card_EditList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_EditList_C>();
	}
};
static_assert(alignof(UMainMenu_Card_EditList_C) == 0x000008, "Wrong alignment on UMainMenu_Card_EditList_C");
static_assert(sizeof(UMainMenu_Card_EditList_C) == 0x000460, "Wrong size on UMainMenu_Card_EditList_C");
static_assert(offsetof(UMainMenu_Card_EditList_C, EditList_Inactive) == 0x0003E0, "Member 'UMainMenu_Card_EditList_C::EditList_Inactive' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EditList_C, EditList_Active) == 0x0003E8, "Member 'UMainMenu_Card_EditList_C::EditList_Active' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EditList_C, Img_Base) == 0x0003F0, "Member 'UMainMenu_Card_EditList_C::Img_Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EditList_C, Img_Base_00) == 0x0003F8, "Member 'UMainMenu_Card_EditList_C::Img_Base_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EditList_C, Img_Base_01) == 0x000400, "Member 'UMainMenu_Card_EditList_C::Img_Base_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EditList_C, Img_Base_02) == 0x000408, "Member 'UMainMenu_Card_EditList_C::Img_Base_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EditList_C, Img_Base_03) == 0x000410, "Member 'UMainMenu_Card_EditList_C::Img_Base_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EditList_C, Img_BtnBg) == 0x000418, "Member 'UMainMenu_Card_EditList_C::Img_BtnBg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EditList_C, Img_CornerDeco_01) == 0x000420, "Member 'UMainMenu_Card_EditList_C::Img_CornerDeco_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EditList_C, Img_CornerDeco_02) == 0x000428, "Member 'UMainMenu_Card_EditList_C::Img_CornerDeco_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EditList_C, Img_CornerDeco_03) == 0x000430, "Member 'UMainMenu_Card_EditList_C::Img_CornerDeco_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EditList_C, Img_CornerDeco_04) == 0x000438, "Member 'UMainMenu_Card_EditList_C::Img_CornerDeco_04' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EditList_C, Img_Icon) == 0x000440, "Member 'UMainMenu_Card_EditList_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EditList_C, Img_Light) == 0x000448, "Member 'UMainMenu_Card_EditList_C::Img_Light' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EditList_C, Img_TextBase) == 0x000450, "Member 'UMainMenu_Card_EditList_C::Img_TextBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_EditList_C, Img_TitleBg) == 0x000458, "Member 'UMainMenu_Card_EditList_C::Img_TitleBg' has a wrong offset!");

}

