#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_Preset_Top

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_Preset_Top.MainMenu_Card_Preset_Top_C
// 0x0058 (0x0420 - 0x03C8)
class UMainMenu_Card_Preset_Top_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Confirm_GrayOut;                                   // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Confirm_New;                                       // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Confirm_In;                                        // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMainMenu_Card_ListHorizon_C*           CardDeckList;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_Confirm_C*               Confirm;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_DeckList_C*              DeckList;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Icon;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_CardInformation_C*       Information;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_Preset_Confirm_C*        PresetConfirm;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_ListHorizon_C*           PresetDeckList;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_Preset_List_C*           PresetList;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_Preset_Top_C">();
	}
	static class UMainMenu_Card_Preset_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_Preset_Top_C>();
	}
};
static_assert(alignof(UMainMenu_Card_Preset_Top_C) == 0x000008, "Wrong alignment on UMainMenu_Card_Preset_Top_C");
static_assert(sizeof(UMainMenu_Card_Preset_Top_C) == 0x000420, "Wrong size on UMainMenu_Card_Preset_Top_C");
static_assert(offsetof(UMainMenu_Card_Preset_Top_C, Confirm_GrayOut) == 0x0003C8, "Member 'UMainMenu_Card_Preset_Top_C::Confirm_GrayOut' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_Top_C, Confirm_New) == 0x0003D0, "Member 'UMainMenu_Card_Preset_Top_C::Confirm_New' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_Top_C, Confirm_In) == 0x0003D8, "Member 'UMainMenu_Card_Preset_Top_C::Confirm_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_Top_C, CardDeckList) == 0x0003E0, "Member 'UMainMenu_Card_Preset_Top_C::CardDeckList' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_Top_C, Confirm) == 0x0003E8, "Member 'UMainMenu_Card_Preset_Top_C::Confirm' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_Top_C, DeckList) == 0x0003F0, "Member 'UMainMenu_Card_Preset_Top_C::DeckList' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_Top_C, Img_Icon) == 0x0003F8, "Member 'UMainMenu_Card_Preset_Top_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_Top_C, Information) == 0x000400, "Member 'UMainMenu_Card_Preset_Top_C::Information' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_Top_C, PresetConfirm) == 0x000408, "Member 'UMainMenu_Card_Preset_Top_C::PresetConfirm' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_Top_C, PresetDeckList) == 0x000410, "Member 'UMainMenu_Card_Preset_Top_C::PresetDeckList' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_Top_C, PresetList) == 0x000418, "Member 'UMainMenu_Card_Preset_Top_C::PresetList' has a wrong offset!");

}

