#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_DLC_Btn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_DLC_Btn.MainMenu_DLC_Btn_C
// 0x0048 (0x0488 - 0x0440)
class UMainMenu_DLC_Btn_C final : public UEndMainDlcBtnMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       BtnNormal;                                         // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnFinished;                                       // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_Btn;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Hover;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_133;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FinishedBase;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverBase;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_DLC_Btn(int32 EntryPoint);
	void BndEvt__SelectBtn_K2Node_ComponentBoundEvent_53_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SelectBtn_K2Node_ComponentBoundEvent_40_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_DLC_Btn_C">();
	}
	static class UMainMenu_DLC_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_DLC_Btn_C>();
	}
};
static_assert(alignof(UMainMenu_DLC_Btn_C) == 0x000008, "Wrong alignment on UMainMenu_DLC_Btn_C");
static_assert(sizeof(UMainMenu_DLC_Btn_C) == 0x000488, "Wrong size on UMainMenu_DLC_Btn_C");
static_assert(offsetof(UMainMenu_DLC_Btn_C, UberGraphFrame) == 0x000440, "Member 'UMainMenu_DLC_Btn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Btn_C, BtnNormal) == 0x000448, "Member 'UMainMenu_DLC_Btn_C::BtnNormal' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Btn_C, BtnFinished) == 0x000450, "Member 'UMainMenu_DLC_Btn_C::BtnFinished' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Btn_C, BtnHover) == 0x000458, "Member 'UMainMenu_DLC_Btn_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Btn_C, Base_Btn) == 0x000460, "Member 'UMainMenu_DLC_Btn_C::Base_Btn' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Btn_C, Base_Hover) == 0x000468, "Member 'UMainMenu_DLC_Btn_C::Base_Hover' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Btn_C, EndImage_133) == 0x000470, "Member 'UMainMenu_DLC_Btn_C::EndImage_133' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Btn_C, FinishedBase) == 0x000478, "Member 'UMainMenu_DLC_Btn_C::FinishedBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Btn_C, HoverBase) == 0x000480, "Member 'UMainMenu_DLC_Btn_C::HoverBase' has a wrong offset!");

}

