#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_WeaponUpgrade_SkillList2

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_WeaponUpgrade_SkillList2.MainMenu_WeaponUpgrade_SkillList2_C
// 0x0060 (0x0448 - 0x03E8)
class UMainMenu_WeaponUpgrade_SkillList2_C final : public UEndMainEquipWeaponInfoWindow
{
public:
	class UEndImage*                              Base1;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base3;                                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame1;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame2;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   SkillScrollBox_Finish;                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              SpBase;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              SpFrame;                                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_SpInfoTitle;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_WeaponUpgrade_SkillList2_C">();
	}
	static class UMainMenu_WeaponUpgrade_SkillList2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_WeaponUpgrade_SkillList2_C>();
	}
};
static_assert(alignof(UMainMenu_WeaponUpgrade_SkillList2_C) == 0x000008, "Wrong alignment on UMainMenu_WeaponUpgrade_SkillList2_C");
static_assert(sizeof(UMainMenu_WeaponUpgrade_SkillList2_C) == 0x000448, "Wrong size on UMainMenu_WeaponUpgrade_SkillList2_C");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SkillList2_C, Base1) == 0x0003E8, "Member 'UMainMenu_WeaponUpgrade_SkillList2_C::Base1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SkillList2_C, Base2) == 0x0003F0, "Member 'UMainMenu_WeaponUpgrade_SkillList2_C::Base2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SkillList2_C, Base3) == 0x0003F8, "Member 'UMainMenu_WeaponUpgrade_SkillList2_C::Base3' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SkillList2_C, EndImage_0) == 0x000400, "Member 'UMainMenu_WeaponUpgrade_SkillList2_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SkillList2_C, EndImage_1) == 0x000408, "Member 'UMainMenu_WeaponUpgrade_SkillList2_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SkillList2_C, Frame1) == 0x000410, "Member 'UMainMenu_WeaponUpgrade_SkillList2_C::Frame1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SkillList2_C, Frame2) == 0x000418, "Member 'UMainMenu_WeaponUpgrade_SkillList2_C::Frame2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SkillList2_C, SkillScrollBox_Finish) == 0x000420, "Member 'UMainMenu_WeaponUpgrade_SkillList2_C::SkillScrollBox_Finish' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SkillList2_C, SpBase) == 0x000428, "Member 'UMainMenu_WeaponUpgrade_SkillList2_C::SpBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SkillList2_C, SpFrame) == 0x000430, "Member 'UMainMenu_WeaponUpgrade_SkillList2_C::SpFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SkillList2_C, Txt_SpInfoTitle) == 0x000438, "Member 'UMainMenu_WeaponUpgrade_SkillList2_C::Txt_SpInfoTitle' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SkillList2_C, Txt_Title) == 0x000440, "Member 'UMainMenu_WeaponUpgrade_SkillList2_C::Txt_Title' has a wrong offset!");

}

