#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Icon_Item

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Icon_Item.MainMenu_Icon_Item_C
// 0x0030 (0x03F8 - 0x03C8)
class UMainMenu_Icon_Item_C final : public UEndUserWidget
{
public:
	class UEndImageSet*                           Icon_AccessoryIcon;                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_ArmorIcon;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_CraftIcon;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Item;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_MateriaIcon;                                  // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_WeaponIcon;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Icon_Item_C">();
	}
	static class UMainMenu_Icon_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Icon_Item_C>();
	}
};
static_assert(alignof(UMainMenu_Icon_Item_C) == 0x000008, "Wrong alignment on UMainMenu_Icon_Item_C");
static_assert(sizeof(UMainMenu_Icon_Item_C) == 0x0003F8, "Wrong size on UMainMenu_Icon_Item_C");
static_assert(offsetof(UMainMenu_Icon_Item_C, Icon_AccessoryIcon) == 0x0003C8, "Member 'UMainMenu_Icon_Item_C::Icon_AccessoryIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_Icon_Item_C, Icon_ArmorIcon) == 0x0003D0, "Member 'UMainMenu_Icon_Item_C::Icon_ArmorIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_Icon_Item_C, Icon_CraftIcon) == 0x0003D8, "Member 'UMainMenu_Icon_Item_C::Icon_CraftIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_Icon_Item_C, Icon_Item) == 0x0003E0, "Member 'UMainMenu_Icon_Item_C::Icon_Item' has a wrong offset!");
static_assert(offsetof(UMainMenu_Icon_Item_C, Icon_MateriaIcon) == 0x0003E8, "Member 'UMainMenu_Icon_Item_C::Icon_MateriaIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_Icon_Item_C, Icon_WeaponIcon) == 0x0003F0, "Member 'UMainMenu_Icon_Item_C::Icon_WeaponIcon' has a wrong offset!");

}

