#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_BouterRank

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_BouterRank.MainMenu_Card_BouterRank_C
// 0x0028 (0x03F0 - 0x03C8)
class UMainMenu_Card_BouterRank_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Img_Base;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_1;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           ImgSet_Icon;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_BouterRankCell_C*        RankUpProgress_01;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_BouterRankCell_C*        RankUpProgress_02;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_BouterRank_C">();
	}
	static class UMainMenu_Card_BouterRank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_BouterRank_C>();
	}
};
static_assert(alignof(UMainMenu_Card_BouterRank_C) == 0x000008, "Wrong alignment on UMainMenu_Card_BouterRank_C");
static_assert(sizeof(UMainMenu_Card_BouterRank_C) == 0x0003F0, "Wrong size on UMainMenu_Card_BouterRank_C");
static_assert(offsetof(UMainMenu_Card_BouterRank_C, Img_Base) == 0x0003C8, "Member 'UMainMenu_Card_BouterRank_C::Img_Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_BouterRank_C, Img_Base_1) == 0x0003D0, "Member 'UMainMenu_Card_BouterRank_C::Img_Base_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_BouterRank_C, ImgSet_Icon) == 0x0003D8, "Member 'UMainMenu_Card_BouterRank_C::ImgSet_Icon' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_BouterRank_C, RankUpProgress_01) == 0x0003E0, "Member 'UMainMenu_Card_BouterRank_C::RankUpProgress_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_BouterRank_C, RankUpProgress_02) == 0x0003E8, "Member 'UMainMenu_Card_BouterRank_C::RankUpProgress_02' has a wrong offset!");

}

