#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_PlayLog_ListItem

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_PlayLog_ListItem.MainMenu_PlayLog_ListItem_C
// 0x0030 (0x03F8 - 0x03C8)
class UMainMenu_PlayLog_ListItem_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       In;                                                // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              BtnBaseLeft;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBaseRight;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Clear;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_LogCount;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_LogTitle;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_PlayLog_ListItem_C">();
	}
	static class UMainMenu_PlayLog_ListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_PlayLog_ListItem_C>();
	}
};
static_assert(alignof(UMainMenu_PlayLog_ListItem_C) == 0x000008, "Wrong alignment on UMainMenu_PlayLog_ListItem_C");
static_assert(sizeof(UMainMenu_PlayLog_ListItem_C) == 0x0003F8, "Wrong size on UMainMenu_PlayLog_ListItem_C");
static_assert(offsetof(UMainMenu_PlayLog_ListItem_C, In) == 0x0003C8, "Member 'UMainMenu_PlayLog_ListItem_C::In' has a wrong offset!");
static_assert(offsetof(UMainMenu_PlayLog_ListItem_C, BtnBaseLeft) == 0x0003D0, "Member 'UMainMenu_PlayLog_ListItem_C::BtnBaseLeft' has a wrong offset!");
static_assert(offsetof(UMainMenu_PlayLog_ListItem_C, BtnBaseRight) == 0x0003D8, "Member 'UMainMenu_PlayLog_ListItem_C::BtnBaseRight' has a wrong offset!");
static_assert(offsetof(UMainMenu_PlayLog_ListItem_C, Icon_Clear) == 0x0003E0, "Member 'UMainMenu_PlayLog_ListItem_C::Icon_Clear' has a wrong offset!");
static_assert(offsetof(UMainMenu_PlayLog_ListItem_C, Txt_LogCount) == 0x0003E8, "Member 'UMainMenu_PlayLog_ListItem_C::Txt_LogCount' has a wrong offset!");
static_assert(offsetof(UMainMenu_PlayLog_ListItem_C, Txt_LogTitle) == 0x0003F0, "Member 'UMainMenu_PlayLog_ListItem_C::Txt_LogTitle' has a wrong offset!");

}

