#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_StatusCell_03

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_StatusCell_03.MainMenu_StatusCell_03_C
// 0x0028 (0x0410 - 0x03E8)
class UMainMenu_StatusCell_03_C final : public UEndStatusCell03
{
public:
	class UEndImage*                              Base;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_63;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_StatusCell_03_C">();
	}
	static class UMainMenu_StatusCell_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_StatusCell_03_C>();
	}
};
static_assert(alignof(UMainMenu_StatusCell_03_C) == 0x000008, "Wrong alignment on UMainMenu_StatusCell_03_C");
static_assert(sizeof(UMainMenu_StatusCell_03_C) == 0x000410, "Wrong size on UMainMenu_StatusCell_03_C");
static_assert(offsetof(UMainMenu_StatusCell_03_C, Base) == 0x0003E8, "Member 'UMainMenu_StatusCell_03_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_03_C, Base2) == 0x0003F0, "Member 'UMainMenu_StatusCell_03_C::Base2' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_03_C, EndImage) == 0x0003F8, "Member 'UMainMenu_StatusCell_03_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_03_C, EndImage_1) == 0x000400, "Member 'UMainMenu_StatusCell_03_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_03_C, EndImage_63) == 0x000408, "Member 'UMainMenu_StatusCell_03_C::EndImage_63' has a wrong offset!");

}

