#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_PlayLog_ListItem3

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_PlayLog_ListItem3.MainMenu_PlayLog_ListItem3_C
// 0x0048 (0x0410 - 0x03C8)
class UMainMenu_PlayLog_ListItem3_C final : public UEndUserWidget
{
public:
	class UEndImage*                              EndImage;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_65;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gauge_BG;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gauge_Waku;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Clear;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_1;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_2;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_LogTitle;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_PlayLog_ListItem3_C">();
	}
	static class UMainMenu_PlayLog_ListItem3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_PlayLog_ListItem3_C>();
	}
};
static_assert(alignof(UMainMenu_PlayLog_ListItem3_C) == 0x000008, "Wrong alignment on UMainMenu_PlayLog_ListItem3_C");
static_assert(sizeof(UMainMenu_PlayLog_ListItem3_C) == 0x000410, "Wrong size on UMainMenu_PlayLog_ListItem3_C");
static_assert(offsetof(UMainMenu_PlayLog_ListItem3_C, EndImage) == 0x0003C8, "Member 'UMainMenu_PlayLog_ListItem3_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_PlayLog_ListItem3_C, EndImage_65) == 0x0003D0, "Member 'UMainMenu_PlayLog_ListItem3_C::EndImage_65' has a wrong offset!");
static_assert(offsetof(UMainMenu_PlayLog_ListItem3_C, Gauge) == 0x0003D8, "Member 'UMainMenu_PlayLog_ListItem3_C::Gauge' has a wrong offset!");
static_assert(offsetof(UMainMenu_PlayLog_ListItem3_C, Gauge_BG) == 0x0003E0, "Member 'UMainMenu_PlayLog_ListItem3_C::Gauge_BG' has a wrong offset!");
static_assert(offsetof(UMainMenu_PlayLog_ListItem3_C, Gauge_Waku) == 0x0003E8, "Member 'UMainMenu_PlayLog_ListItem3_C::Gauge_Waku' has a wrong offset!");
static_assert(offsetof(UMainMenu_PlayLog_ListItem3_C, Icon_Clear) == 0x0003F0, "Member 'UMainMenu_PlayLog_ListItem3_C::Icon_Clear' has a wrong offset!");
static_assert(offsetof(UMainMenu_PlayLog_ListItem3_C, ListPoint_1) == 0x0003F8, "Member 'UMainMenu_PlayLog_ListItem3_C::ListPoint_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_PlayLog_ListItem3_C, ListPoint_2) == 0x000400, "Member 'UMainMenu_PlayLog_ListItem3_C::ListPoint_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_PlayLog_ListItem3_C, Txt_LogTitle) == 0x000408, "Member 'UMainMenu_PlayLog_ListItem3_C::Txt_LogTitle' has a wrong offset!");

}

