#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_System_Test

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_System_Test.MainMenu_System_Test_C
// 0x0110 (0x05D8 - 0x04C8)
class UMainMenu_System_Test_C final : public UEndMainSystemMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Bg_Normal;                                         // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bg_Dark;                                           // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayLog_In;                                        // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_1;                                            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Black;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Left;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Right;                                        // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg;                                      // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg_1;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg_2;                                    // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg_3;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Img;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCategoryTitle_C*                       CategoryTitle;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_3;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_4;                                        // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_5;                                        // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_6;                                        // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_7;                                        // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_25;                                       // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_26;                                       // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_49;                                       // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_100;                                      // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon;                                              // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_LeftMenu_C*                   MainMenu_LeftMenu;                                 // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_PlayLog_List_C*               PlayLog_List;                                      // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgLeft_C*              System_BgLeft;                                     // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgRight_C*             System_BgRight;                                    // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_System_Test(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_System_Test_C">();
	}
	static class UMainMenu_System_Test_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_System_Test_C>();
	}
};
static_assert(alignof(UMainMenu_System_Test_C) == 0x000008, "Wrong alignment on UMainMenu_System_Test_C");
static_assert(sizeof(UMainMenu_System_Test_C) == 0x0005D8, "Wrong size on UMainMenu_System_Test_C");
static_assert(offsetof(UMainMenu_System_Test_C, UberGraphFrame) == 0x0004C8, "Member 'UMainMenu_System_Test_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, Bg_Normal) == 0x0004D0, "Member 'UMainMenu_System_Test_C::Bg_Normal' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, Bg_Dark) == 0x0004D8, "Member 'UMainMenu_System_Test_C::Bg_Dark' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, PlayLog_In) == 0x0004E0, "Member 'UMainMenu_System_Test_C::PlayLog_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, Menu_In) == 0x0004E8, "Member 'UMainMenu_System_Test_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, Base) == 0x0004F0, "Member 'UMainMenu_System_Test_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, Base_1) == 0x0004F8, "Member 'UMainMenu_System_Test_C::Base_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, Base_Black) == 0x000500, "Member 'UMainMenu_System_Test_C::Base_Black' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, Base_Left) == 0x000508, "Member 'UMainMenu_System_Test_C::Base_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, Base_Right) == 0x000510, "Member 'UMainMenu_System_Test_C::Base_Right' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, Billboard_Bg) == 0x000518, "Member 'UMainMenu_System_Test_C::Billboard_Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, Billboard_Bg_1) == 0x000520, "Member 'UMainMenu_System_Test_C::Billboard_Bg_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, Billboard_Bg_2) == 0x000528, "Member 'UMainMenu_System_Test_C::Billboard_Bg_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, Billboard_Bg_3) == 0x000530, "Member 'UMainMenu_System_Test_C::Billboard_Bg_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, Billboard_Img) == 0x000538, "Member 'UMainMenu_System_Test_C::Billboard_Img' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, CategoryTitle) == 0x000540, "Member 'UMainMenu_System_Test_C::CategoryTitle' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, EndImage) == 0x000548, "Member 'UMainMenu_System_Test_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, EndImage_1) == 0x000550, "Member 'UMainMenu_System_Test_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, EndImage_2) == 0x000558, "Member 'UMainMenu_System_Test_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, EndImage_3) == 0x000560, "Member 'UMainMenu_System_Test_C::EndImage_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, EndImage_4) == 0x000568, "Member 'UMainMenu_System_Test_C::EndImage_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, EndImage_5) == 0x000570, "Member 'UMainMenu_System_Test_C::EndImage_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, EndImage_6) == 0x000578, "Member 'UMainMenu_System_Test_C::EndImage_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, EndImage_7) == 0x000580, "Member 'UMainMenu_System_Test_C::EndImage_7' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, EndImage_25) == 0x000588, "Member 'UMainMenu_System_Test_C::EndImage_25' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, EndImage_26) == 0x000590, "Member 'UMainMenu_System_Test_C::EndImage_26' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, EndImage_49) == 0x000598, "Member 'UMainMenu_System_Test_C::EndImage_49' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, EndImage_100) == 0x0005A0, "Member 'UMainMenu_System_Test_C::EndImage_100' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, Frame) == 0x0005A8, "Member 'UMainMenu_System_Test_C::Frame' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, Icon) == 0x0005B0, "Member 'UMainMenu_System_Test_C::Icon' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, MainMenu_LeftMenu) == 0x0005B8, "Member 'UMainMenu_System_Test_C::MainMenu_LeftMenu' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, PlayLog_List) == 0x0005C0, "Member 'UMainMenu_System_Test_C::PlayLog_List' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, System_BgLeft) == 0x0005C8, "Member 'UMainMenu_System_Test_C::System_BgLeft' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Test_C, System_BgRight) == 0x0005D0, "Member 'UMainMenu_System_Test_C::System_BgRight' has a wrong offset!");

}

