#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_EnemyReport_Btn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_EnemyReport_Btn.MainMenu_EnemyReport_Btn_C
// 0x0068 (0x0498 - 0x0430)
class UMainMenu_EnemyReport_Btn_C final : public UEndMainItemSelectBtnText
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       BtnTarget;                                         // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnNormal;                                         // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_Btn;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Hover;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnTargetIcon;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_74;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Loupe;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_New;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TargetCover;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ReportTitle;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_EnemyReport_Btn(int32 EntryPoint);
	void BndEvt__SelectBtn_K2Node_ComponentBoundEvent_53_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SelectBtn_K2Node_ComponentBoundEvent_40_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_EnemyReport_Btn_C">();
	}
	static class UMainMenu_EnemyReport_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_EnemyReport_Btn_C>();
	}
};
static_assert(alignof(UMainMenu_EnemyReport_Btn_C) == 0x000008, "Wrong alignment on UMainMenu_EnemyReport_Btn_C");
static_assert(sizeof(UMainMenu_EnemyReport_Btn_C) == 0x000498, "Wrong size on UMainMenu_EnemyReport_Btn_C");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, UberGraphFrame) == 0x000430, "Member 'UMainMenu_EnemyReport_Btn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, BtnTarget) == 0x000438, "Member 'UMainMenu_EnemyReport_Btn_C::BtnTarget' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, BtnNormal) == 0x000440, "Member 'UMainMenu_EnemyReport_Btn_C::BtnNormal' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, BtnHover) == 0x000448, "Member 'UMainMenu_EnemyReport_Btn_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, Base_Btn) == 0x000450, "Member 'UMainMenu_EnemyReport_Btn_C::Base_Btn' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, Base_Hover) == 0x000458, "Member 'UMainMenu_EnemyReport_Btn_C::Base_Hover' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, BtnTargetIcon) == 0x000460, "Member 'UMainMenu_EnemyReport_Btn_C::BtnTargetIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, EndImage) == 0x000468, "Member 'UMainMenu_EnemyReport_Btn_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, EndImage_74) == 0x000470, "Member 'UMainMenu_EnemyReport_Btn_C::EndImage_74' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, Icon_Loupe) == 0x000478, "Member 'UMainMenu_EnemyReport_Btn_C::Icon_Loupe' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, Icon_New) == 0x000480, "Member 'UMainMenu_EnemyReport_Btn_C::Icon_New' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, TargetCover) == 0x000488, "Member 'UMainMenu_EnemyReport_Btn_C::TargetCover' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, Txt_ReportTitle) == 0x000490, "Member 'UMainMenu_EnemyReport_Btn_C::Txt_ReportTitle' has a wrong offset!");

}

