#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Craft_Popup2

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Craft_Popup2.MainMenu_Craft_Popup2_C
// 0x0078 (0x0440 - 0x03C8)
class UMainMenu_Craft_Popup2_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Base;                                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco1;                                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco2;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_251;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame1;                                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame2;                                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1;                                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_1;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_2;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_3;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_4;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_5;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_6;                                           // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2;                                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LineLight;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Craft_Popup2_C">();
	}
	static class UMainMenu_Craft_Popup2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Craft_Popup2_C>();
	}
};
static_assert(alignof(UMainMenu_Craft_Popup2_C) == 0x000008, "Wrong alignment on UMainMenu_Craft_Popup2_C");
static_assert(sizeof(UMainMenu_Craft_Popup2_C) == 0x000440, "Wrong size on UMainMenu_Craft_Popup2_C");
static_assert(offsetof(UMainMenu_Craft_Popup2_C, Base) == 0x0003C8, "Member 'UMainMenu_Craft_Popup2_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup2_C, Deco1) == 0x0003D0, "Member 'UMainMenu_Craft_Popup2_C::Deco1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup2_C, Deco2) == 0x0003D8, "Member 'UMainMenu_Craft_Popup2_C::Deco2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup2_C, EndImage_251) == 0x0003E0, "Member 'UMainMenu_Craft_Popup2_C::EndImage_251' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup2_C, Frame1) == 0x0003E8, "Member 'UMainMenu_Craft_Popup2_C::Frame1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup2_C, Frame2) == 0x0003F0, "Member 'UMainMenu_Craft_Popup2_C::Frame2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup2_C, Line1) == 0x0003F8, "Member 'UMainMenu_Craft_Popup2_C::Line1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup2_C, Line1_1) == 0x000400, "Member 'UMainMenu_Craft_Popup2_C::Line1_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup2_C, Line1_2) == 0x000408, "Member 'UMainMenu_Craft_Popup2_C::Line1_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup2_C, Line1_3) == 0x000410, "Member 'UMainMenu_Craft_Popup2_C::Line1_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup2_C, Line1_4) == 0x000418, "Member 'UMainMenu_Craft_Popup2_C::Line1_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup2_C, Line1_5) == 0x000420, "Member 'UMainMenu_Craft_Popup2_C::Line1_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup2_C, Line1_6) == 0x000428, "Member 'UMainMenu_Craft_Popup2_C::Line1_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup2_C, Line2) == 0x000430, "Member 'UMainMenu_Craft_Popup2_C::Line2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup2_C, LineLight) == 0x000438, "Member 'UMainMenu_Craft_Popup2_C::LineLight' has a wrong offset!");

}

