#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Craft_ListMenu

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Craft_ListMenu.MainMenu_Craft_ListMenu_C
// 0x00B0 (0x0478 - 0x03C8)
class UMainMenu_Craft_ListMenu_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Bg;                                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2;                                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_1;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_2;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_3;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCategorySwitch2_C*                     CategorySwitch2;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   LeftMenu_ScrollBox;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_1;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_2;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_3;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_4;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_5;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_6;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_7;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_8;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Guide;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_List_Volume;                                   // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Message;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Craft_ListMenu_C">();
	}
	static class UMainMenu_Craft_ListMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Craft_ListMenu_C>();
	}
};
static_assert(alignof(UMainMenu_Craft_ListMenu_C) == 0x000008, "Wrong alignment on UMainMenu_Craft_ListMenu_C");
static_assert(sizeof(UMainMenu_Craft_ListMenu_C) == 0x000478, "Wrong size on UMainMenu_Craft_ListMenu_C");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, Bg) == 0x0003C8, "Member 'UMainMenu_Craft_ListMenu_C::Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, Bg2) == 0x0003D0, "Member 'UMainMenu_Craft_ListMenu_C::Bg2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, Bg2_1) == 0x0003D8, "Member 'UMainMenu_Craft_ListMenu_C::Bg2_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, Bg2_2) == 0x0003E0, "Member 'UMainMenu_Craft_ListMenu_C::Bg2_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, Bg2_3) == 0x0003E8, "Member 'UMainMenu_Craft_ListMenu_C::Bg2_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, CategorySwitch2) == 0x0003F0, "Member 'UMainMenu_Craft_ListMenu_C::CategorySwitch2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, EndImage) == 0x0003F8, "Member 'UMainMenu_Craft_ListMenu_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, LeftMenu_ScrollBox) == 0x000400, "Member 'UMainMenu_Craft_ListMenu_C::LeftMenu_ScrollBox' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, ListBg2) == 0x000408, "Member 'UMainMenu_Craft_ListMenu_C::ListBg2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, ListPoint) == 0x000410, "Member 'UMainMenu_Craft_ListMenu_C::ListPoint' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, ListPoint_1) == 0x000418, "Member 'UMainMenu_Craft_ListMenu_C::ListPoint_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, ListPoint_2) == 0x000420, "Member 'UMainMenu_Craft_ListMenu_C::ListPoint_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, ListPoint_3) == 0x000428, "Member 'UMainMenu_Craft_ListMenu_C::ListPoint_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, ListPoint_4) == 0x000430, "Member 'UMainMenu_Craft_ListMenu_C::ListPoint_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, ListPoint_5) == 0x000438, "Member 'UMainMenu_Craft_ListMenu_C::ListPoint_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, ListPoint_6) == 0x000440, "Member 'UMainMenu_Craft_ListMenu_C::ListPoint_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, ListPoint_7) == 0x000448, "Member 'UMainMenu_Craft_ListMenu_C::ListPoint_7' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, ListPoint_8) == 0x000450, "Member 'UMainMenu_Craft_ListMenu_C::ListPoint_8' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, Txt_Guide) == 0x000458, "Member 'UMainMenu_Craft_ListMenu_C::Txt_Guide' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, Txt_List_Volume) == 0x000460, "Member 'UMainMenu_Craft_ListMenu_C::Txt_List_Volume' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, Txt_Message) == 0x000468, "Member 'UMainMenu_Craft_ListMenu_C::Txt_Message' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_ListMenu_C, Txt_Title) == 0x000470, "Member 'UMainMenu_Craft_ListMenu_C::Txt_Title' has a wrong offset!");

}

