#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Options_Btn4

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Options_Btn4.MainMenu_Options_Btn4_C
// 0x00D8 (0x04A0 - 0x03C8)
class UMainMenu_Options_Btn4_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Lock_Key3;                                         // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Lock_Key2;                                         // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Lock_Key1;                                         // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_4;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseAll;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Key1;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Key2;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Key3;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBaseLeft;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBaseRight;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBaseRight_1;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterLight;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_1;                                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point2_1;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Key1;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Key2;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Key3;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title_Category;                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_Options_Btn4(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Options_Btn4_C">();
	}
	static class UMainMenu_Options_Btn4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Options_Btn4_C>();
	}
};
static_assert(alignof(UMainMenu_Options_Btn4_C) == 0x000008, "Wrong alignment on UMainMenu_Options_Btn4_C");
static_assert(sizeof(UMainMenu_Options_Btn4_C) == 0x0004A0, "Wrong size on UMainMenu_Options_Btn4_C");
static_assert(offsetof(UMainMenu_Options_Btn4_C, UberGraphFrame) == 0x0003C8, "Member 'UMainMenu_Options_Btn4_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Lock_Key3) == 0x0003D0, "Member 'UMainMenu_Options_Btn4_C::Lock_Key3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Lock_Key2) == 0x0003D8, "Member 'UMainMenu_Options_Btn4_C::Lock_Key2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Lock_Key1) == 0x0003E0, "Member 'UMainMenu_Options_Btn4_C::Lock_Key1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, BtnHover) == 0x0003E8, "Member 'UMainMenu_Options_Btn4_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Selected) == 0x0003F0, "Member 'UMainMenu_Options_Btn4_C::Selected' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Loop) == 0x0003F8, "Member 'UMainMenu_Options_Btn4_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Menu_In) == 0x000400, "Member 'UMainMenu_Options_Btn4_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Base) == 0x000408, "Member 'UMainMenu_Options_Btn4_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Base1_4) == 0x000410, "Member 'UMainMenu_Options_Btn4_C::Base1_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Base2) == 0x000418, "Member 'UMainMenu_Options_Btn4_C::Base2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, BaseAll) == 0x000420, "Member 'UMainMenu_Options_Btn4_C::BaseAll' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Btn_Key1) == 0x000428, "Member 'UMainMenu_Options_Btn4_C::Btn_Key1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Btn_Key2) == 0x000430, "Member 'UMainMenu_Options_Btn4_C::Btn_Key2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Btn_Key3) == 0x000438, "Member 'UMainMenu_Options_Btn4_C::Btn_Key3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, BtnBaseLeft) == 0x000440, "Member 'UMainMenu_Options_Btn4_C::BtnBaseLeft' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, BtnBaseRight) == 0x000448, "Member 'UMainMenu_Options_Btn4_C::BtnBaseRight' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, BtnBaseRight_1) == 0x000450, "Member 'UMainMenu_Options_Btn4_C::BtnBaseRight_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, CenterLight) == 0x000458, "Member 'UMainMenu_Options_Btn4_C::CenterLight' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Line) == 0x000460, "Member 'UMainMenu_Options_Btn4_C::Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Line_1) == 0x000468, "Member 'UMainMenu_Options_Btn4_C::Line_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Point2_1) == 0x000470, "Member 'UMainMenu_Options_Btn4_C::Point2_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Txt_Key1) == 0x000478, "Member 'UMainMenu_Options_Btn4_C::Txt_Key1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Txt_Key2) == 0x000480, "Member 'UMainMenu_Options_Btn4_C::Txt_Key2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Txt_Key3) == 0x000488, "Member 'UMainMenu_Options_Btn4_C::Txt_Key3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Txt_Title) == 0x000490, "Member 'UMainMenu_Options_Btn4_C::Txt_Title' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Txt_Title_Category) == 0x000498, "Member 'UMainMenu_Options_Btn4_C::Txt_Title_Category' has a wrong offset!");

}

