#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_CardChallenge_PrizeCell2

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_CardChallenge_PrizeCell2.MainMenu_Card_CardChallenge_PrizeCell2_C
// 0x0040 (0x0408 - 0x03C8)
class UMainMenu_Card_CardChallenge_PrizeCell2_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Clear;                                             // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              FirstBase;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Clear;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Item_C*                           Icon_Item;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_X_;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ItemName;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ItemNum;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_CardChallenge_PrizeCell2_C">();
	}
	static class UMainMenu_Card_CardChallenge_PrizeCell2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_CardChallenge_PrizeCell2_C>();
	}
};
static_assert(alignof(UMainMenu_Card_CardChallenge_PrizeCell2_C) == 0x000008, "Wrong alignment on UMainMenu_Card_CardChallenge_PrizeCell2_C");
static_assert(sizeof(UMainMenu_Card_CardChallenge_PrizeCell2_C) == 0x000408, "Wrong size on UMainMenu_Card_CardChallenge_PrizeCell2_C");
static_assert(offsetof(UMainMenu_Card_CardChallenge_PrizeCell2_C, Clear) == 0x0003C8, "Member 'UMainMenu_Card_CardChallenge_PrizeCell2_C::Clear' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardChallenge_PrizeCell2_C, Normal) == 0x0003D0, "Member 'UMainMenu_Card_CardChallenge_PrizeCell2_C::Normal' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardChallenge_PrizeCell2_C, FirstBase) == 0x0003D8, "Member 'UMainMenu_Card_CardChallenge_PrizeCell2_C::FirstBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardChallenge_PrizeCell2_C, Icon_Clear) == 0x0003E0, "Member 'UMainMenu_Card_CardChallenge_PrizeCell2_C::Icon_Clear' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardChallenge_PrizeCell2_C, Icon_Item) == 0x0003E8, "Member 'UMainMenu_Card_CardChallenge_PrizeCell2_C::Icon_Item' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardChallenge_PrizeCell2_C, Icon_X_) == 0x0003F0, "Member 'UMainMenu_Card_CardChallenge_PrizeCell2_C::Icon_X_' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardChallenge_PrizeCell2_C, Txt_ItemName) == 0x0003F8, "Member 'UMainMenu_Card_CardChallenge_PrizeCell2_C::Txt_ItemName' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardChallenge_PrizeCell2_C, Txt_ItemNum) == 0x000400, "Member 'UMainMenu_Card_CardChallenge_PrizeCell2_C::Txt_ItemNum' has a wrong offset!");

}

