#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Craft_CategoryBtn

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Craft_CategoryBtn.MainMenu_Craft_CategoryBtn_C
// 0x0080 (0x0450 - 0x03D0)
class UMainMenu_Craft_CategoryBtn_C final : public UEndMenuCategoryChangeBtn
{
public:
	class UWidgetAnimation*                       Normal;                                            // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NoActive;                                          // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndButton*                             Btn_Accessory;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Item;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Materia;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Protector;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Weapon;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_WishList;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Left;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_New_Accessory;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_New_Item;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_New_Materia;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_New_Protector;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_New_Weapon;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_New_WishList;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Right;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Craft_CategoryBtn_C">();
	}
	static class UMainMenu_Craft_CategoryBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Craft_CategoryBtn_C>();
	}
};
static_assert(alignof(UMainMenu_Craft_CategoryBtn_C) == 0x000008, "Wrong alignment on UMainMenu_Craft_CategoryBtn_C");
static_assert(sizeof(UMainMenu_Craft_CategoryBtn_C) == 0x000450, "Wrong size on UMainMenu_Craft_CategoryBtn_C");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, Normal) == 0x0003D0, "Member 'UMainMenu_Craft_CategoryBtn_C::Normal' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, NoActive) == 0x0003D8, "Member 'UMainMenu_Craft_CategoryBtn_C::NoActive' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, Btn_Accessory) == 0x0003E0, "Member 'UMainMenu_Craft_CategoryBtn_C::Btn_Accessory' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, Btn_Item) == 0x0003E8, "Member 'UMainMenu_Craft_CategoryBtn_C::Btn_Item' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, Btn_Materia) == 0x0003F0, "Member 'UMainMenu_Craft_CategoryBtn_C::Btn_Materia' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, Btn_Protector) == 0x0003F8, "Member 'UMainMenu_Craft_CategoryBtn_C::Btn_Protector' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, Btn_Weapon) == 0x000400, "Member 'UMainMenu_Craft_CategoryBtn_C::Btn_Weapon' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, Btn_WishList) == 0x000408, "Member 'UMainMenu_Craft_CategoryBtn_C::Btn_WishList' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, Icon_Left) == 0x000410, "Member 'UMainMenu_Craft_CategoryBtn_C::Icon_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, Icon_New_Accessory) == 0x000418, "Member 'UMainMenu_Craft_CategoryBtn_C::Icon_New_Accessory' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, Icon_New_Item) == 0x000420, "Member 'UMainMenu_Craft_CategoryBtn_C::Icon_New_Item' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, Icon_New_Materia) == 0x000428, "Member 'UMainMenu_Craft_CategoryBtn_C::Icon_New_Materia' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, Icon_New_Protector) == 0x000430, "Member 'UMainMenu_Craft_CategoryBtn_C::Icon_New_Protector' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, Icon_New_Weapon) == 0x000438, "Member 'UMainMenu_Craft_CategoryBtn_C::Icon_New_Weapon' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, Icon_New_WishList) == 0x000440, "Member 'UMainMenu_Craft_CategoryBtn_C::Icon_New_WishList' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_CategoryBtn_C, Icon_Right) == 0x000448, "Member 'UMainMenu_Craft_CategoryBtn_C::Icon_Right' has a wrong offset!");

}

