#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_BattleSetting_Btn3

#include "Basic.hpp"


namespace SDK::Params
{

// Function MainMenu_BattleSetting_Btn3.MainMenu_BattleSetting_Btn3_C.ExecuteUbergraph_MainMenu_BattleSetting_Btn3
// 0x0008 (0x0008 - 0x0000)
struct MainMenu_BattleSetting_Btn3_C_ExecuteUbergraph_MainMenu_BattleSetting_Btn3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_2;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_BattleSetting_Btn3_C_ExecuteUbergraph_MainMenu_BattleSetting_Btn3) == 0x000004, "Wrong alignment on MainMenu_BattleSetting_Btn3_C_ExecuteUbergraph_MainMenu_BattleSetting_Btn3");
static_assert(sizeof(MainMenu_BattleSetting_Btn3_C_ExecuteUbergraph_MainMenu_BattleSetting_Btn3) == 0x000008, "Wrong size on MainMenu_BattleSetting_Btn3_C_ExecuteUbergraph_MainMenu_BattleSetting_Btn3");
static_assert(offsetof(MainMenu_BattleSetting_Btn3_C_ExecuteUbergraph_MainMenu_BattleSetting_Btn3, EntryPoint) == 0x000000, "Member 'MainMenu_BattleSetting_Btn3_C_ExecuteUbergraph_MainMenu_BattleSetting_Btn3::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_Btn3_C_ExecuteUbergraph_MainMenu_BattleSetting_Btn3, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'MainMenu_BattleSetting_Btn3_C_ExecuteUbergraph_MainMenu_BattleSetting_Btn3::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_Btn3_C_ExecuteUbergraph_MainMenu_BattleSetting_Btn3, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000005, "Member 'MainMenu_BattleSetting_Btn3_C_ExecuteUbergraph_MainMenu_BattleSetting_Btn3::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_Btn3_C_ExecuteUbergraph_MainMenu_BattleSetting_Btn3, CallFunc_PlayAnimationByName_ReturnValue_2) == 0x000006, "Member 'MainMenu_BattleSetting_Btn3_C_ExecuteUbergraph_MainMenu_BattleSetting_Btn3::CallFunc_PlayAnimationByName_ReturnValue_2' has a wrong offset!");

}

