#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_Top

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_Top.MainMenu_Card_Top_C
// 0x00B8 (0x05E0 - 0x0528)
class UMainMenu_Card_Top_C final : public UEndCardDeckWindow
{
public:
	class UWidgetAnimation*                       Menu_EditList_to_DeckCopy;                         // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_EditList_to_Preset_New;                       // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NPC_Focus_EditList_New;                            // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_Focus_EditList_New;                           // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_EditList_to_Preset;                           // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Sort_In;                                           // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_Focus_CardListAll;                            // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NPC_Focus_EditList;                                // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NPC_Focus_CardList_Enemy;                          // 0x0568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NPC_Focus_CardList_Player;                         // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NPC_In;                                            // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_Focus_EditList;                               // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_Focus_CardList_Player;                        // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              BlackBg;                                           // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_BouterRank_C*            BouterRank;                                        // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_EditListNew_C*           Card_EditListNew;                                  // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_ListAll_C*               Card_ListAll;                                      // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_ListHorizon_C*           CardDeckList;                                      // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_DeckCopy_C*              DeckCopy;                                          // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_Preset_Top_C*            PresetTop;                                         // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_SortWindow_C*            SortWindow;                                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              SortWindow_BlackBg;                                // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_Top_C">();
	}
	static class UMainMenu_Card_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_Top_C>();
	}
};
static_assert(alignof(UMainMenu_Card_Top_C) == 0x000008, "Wrong alignment on UMainMenu_Card_Top_C");
static_assert(sizeof(UMainMenu_Card_Top_C) == 0x0005E0, "Wrong size on UMainMenu_Card_Top_C");
static_assert(offsetof(UMainMenu_Card_Top_C, Menu_EditList_to_DeckCopy) == 0x000528, "Member 'UMainMenu_Card_Top_C::Menu_EditList_to_DeckCopy' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, Menu_EditList_to_Preset_New) == 0x000530, "Member 'UMainMenu_Card_Top_C::Menu_EditList_to_Preset_New' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, NPC_Focus_EditList_New) == 0x000538, "Member 'UMainMenu_Card_Top_C::NPC_Focus_EditList_New' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, Menu_Focus_EditList_New) == 0x000540, "Member 'UMainMenu_Card_Top_C::Menu_Focus_EditList_New' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, Menu_EditList_to_Preset) == 0x000548, "Member 'UMainMenu_Card_Top_C::Menu_EditList_to_Preset' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, Sort_In) == 0x000550, "Member 'UMainMenu_Card_Top_C::Sort_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, Menu_Focus_CardListAll) == 0x000558, "Member 'UMainMenu_Card_Top_C::Menu_Focus_CardListAll' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, NPC_Focus_EditList) == 0x000560, "Member 'UMainMenu_Card_Top_C::NPC_Focus_EditList' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, NPC_Focus_CardList_Enemy) == 0x000568, "Member 'UMainMenu_Card_Top_C::NPC_Focus_CardList_Enemy' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, NPC_Focus_CardList_Player) == 0x000570, "Member 'UMainMenu_Card_Top_C::NPC_Focus_CardList_Player' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, NPC_In) == 0x000578, "Member 'UMainMenu_Card_Top_C::NPC_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, Menu_Focus_EditList) == 0x000580, "Member 'UMainMenu_Card_Top_C::Menu_Focus_EditList' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, Menu_Focus_CardList_Player) == 0x000588, "Member 'UMainMenu_Card_Top_C::Menu_Focus_CardList_Player' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, Menu_In) == 0x000590, "Member 'UMainMenu_Card_Top_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, BlackBg) == 0x000598, "Member 'UMainMenu_Card_Top_C::BlackBg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, BouterRank) == 0x0005A0, "Member 'UMainMenu_Card_Top_C::BouterRank' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, Card_EditListNew) == 0x0005A8, "Member 'UMainMenu_Card_Top_C::Card_EditListNew' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, Card_ListAll) == 0x0005B0, "Member 'UMainMenu_Card_Top_C::Card_ListAll' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, CardDeckList) == 0x0005B8, "Member 'UMainMenu_Card_Top_C::CardDeckList' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, DeckCopy) == 0x0005C0, "Member 'UMainMenu_Card_Top_C::DeckCopy' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, PresetTop) == 0x0005C8, "Member 'UMainMenu_Card_Top_C::PresetTop' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, SortWindow) == 0x0005D0, "Member 'UMainMenu_Card_Top_C::SortWindow' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Top_C, SortWindow_BlackBg) == 0x0005D8, "Member 'UMainMenu_Card_Top_C::SortWindow_BlackBg' has a wrong offset!");

}

