#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_CardEditBtn

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_CardEditBtn.MainMenu_Card_CardEditBtn_C
// 0x0030 (0x03F8 - 0x03C8)
class UMainMenu_Card_CardEditBtn_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Add;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Delete;                                            // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_Arrow;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Bg_Add;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Bg_Delete;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_CardEditBtn_C">();
	}
	static class UMainMenu_Card_CardEditBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_CardEditBtn_C>();
	}
};
static_assert(alignof(UMainMenu_Card_CardEditBtn_C) == 0x000008, "Wrong alignment on UMainMenu_Card_CardEditBtn_C");
static_assert(sizeof(UMainMenu_Card_CardEditBtn_C) == 0x0003F8, "Wrong size on UMainMenu_Card_CardEditBtn_C");
static_assert(offsetof(UMainMenu_Card_CardEditBtn_C, Add) == 0x0003C8, "Member 'UMainMenu_Card_CardEditBtn_C::Add' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardEditBtn_C, Delete) == 0x0003D0, "Member 'UMainMenu_Card_CardEditBtn_C::Delete' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardEditBtn_C, In) == 0x0003D8, "Member 'UMainMenu_Card_CardEditBtn_C::In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardEditBtn_C, Img_Arrow) == 0x0003E0, "Member 'UMainMenu_Card_CardEditBtn_C::Img_Arrow' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardEditBtn_C, Img_Bg_Add) == 0x0003E8, "Member 'UMainMenu_Card_CardEditBtn_C::Img_Bg_Add' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardEditBtn_C, Img_Bg_Delete) == 0x0003F0, "Member 'UMainMenu_Card_CardEditBtn_C::Img_Bg_Delete' has a wrong offset!");

}

