#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Craft_Level

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Craft_Level.MainMenu_Craft_Level_C
// 0x00A0 (0x04F0 - 0x0450)
class UMainMenu_Craft_Level_C final : public UEndItemCraftLevelWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Gauge_Plus_Loop;                                   // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LevelUp;                                           // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot1;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot2;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot3;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot4;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot5;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_93;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Gauge_Frame;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gradation2;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_03;                                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LevelBase_0;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LevelBase_1;                                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LevelBase_Frame;                                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LevelBase_Light;                                   // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light_1;                                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light_2;                                           // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_Craft_Level(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Craft_Level_C">();
	}
	static class UMainMenu_Craft_Level_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Craft_Level_C>();
	}
};
static_assert(alignof(UMainMenu_Craft_Level_C) == 0x000008, "Wrong alignment on UMainMenu_Craft_Level_C");
static_assert(sizeof(UMainMenu_Craft_Level_C) == 0x0004F0, "Wrong size on UMainMenu_Craft_Level_C");
static_assert(offsetof(UMainMenu_Craft_Level_C, UberGraphFrame) == 0x000450, "Member 'UMainMenu_Craft_Level_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, Gauge_Plus_Loop) == 0x000458, "Member 'UMainMenu_Craft_Level_C::Gauge_Plus_Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, LevelUp) == 0x000460, "Member 'UMainMenu_Craft_Level_C::LevelUp' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, Base) == 0x000468, "Member 'UMainMenu_Craft_Level_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, BaseDot1) == 0x000470, "Member 'UMainMenu_Craft_Level_C::BaseDot1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, BaseDot2) == 0x000478, "Member 'UMainMenu_Craft_Level_C::BaseDot2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, BaseDot3) == 0x000480, "Member 'UMainMenu_Craft_Level_C::BaseDot3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, BaseDot4) == 0x000488, "Member 'UMainMenu_Craft_Level_C::BaseDot4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, BaseDot5) == 0x000490, "Member 'UMainMenu_Craft_Level_C::BaseDot5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, EndImage_93) == 0x000498, "Member 'UMainMenu_Craft_Level_C::EndImage_93' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, Gauge_Frame) == 0x0004A0, "Member 'UMainMenu_Craft_Level_C::Gauge_Frame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, Gradation2) == 0x0004A8, "Member 'UMainMenu_Craft_Level_C::Gradation2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, Img_Slash_03) == 0x0004B0, "Member 'UMainMenu_Craft_Level_C::Img_Slash_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, LevelBase_0) == 0x0004B8, "Member 'UMainMenu_Craft_Level_C::LevelBase_0' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, LevelBase_1) == 0x0004C0, "Member 'UMainMenu_Craft_Level_C::LevelBase_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, LevelBase_Frame) == 0x0004C8, "Member 'UMainMenu_Craft_Level_C::LevelBase_Frame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, LevelBase_Light) == 0x0004D0, "Member 'UMainMenu_Craft_Level_C::LevelBase_Light' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, Light_1) == 0x0004D8, "Member 'UMainMenu_Craft_Level_C::Light_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, Light_2) == 0x0004E0, "Member 'UMainMenu_Craft_Level_C::Light_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Level_C, Line) == 0x0004E8, "Member 'UMainMenu_Craft_Level_C::Line' has a wrong offset!");

}

