#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Manual_Top

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Manual_Top.MainMenu_Manual_Top_C
// 0x0208 (0x0710 - 0x0508)
class UMainMenu_Manual_Top_C final : public UEndMainManualMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bg_Normal;                                         // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bg_Dark;                                           // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Detail_In;                                         // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Cover_In;                                          // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_2;                                           // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_3;                                           // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Black;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Left;                                         // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Right;                                        // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_1;                                              // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_2;                                              // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_3;                                              // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2;                                               // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_1;                                             // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_2;                                             // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_3;                                             // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_4;                                             // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_5;                                             // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_6;                                             // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_7;                                             // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg;                                      // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg_1;                                    // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg_2;                                    // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg_3;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg_4;                                    // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Manual_Detail2_C*             Detail_Movie;                                      // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndGauge*                              EndGauge1;                                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndGauge*                              EndGauge2;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_131;                                      // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_170;                                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Left;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Right;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left1;                                             // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left2;                                             // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left3;                                             // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left4;                                             // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_1;                                            // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint;                                         // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_1;                                       // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_2;                                       // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_3;                                       // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_4;                                       // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_5;                                       // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_6;                                       // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_7;                                       // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_8;                                       // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_9;                                       // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_10;                                      // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_11;                                      // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_12;                                      // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_13;                                      // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_14;                                      // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_15;                                      // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_16;                                      // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_17;                                      // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_Bg_C*                  System_Bg;                                         // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgRight_C*             System_BgRight;                                    // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_Manual_Top(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Manual_Top_C">();
	}
	static class UMainMenu_Manual_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Manual_Top_C>();
	}
};
static_assert(alignof(UMainMenu_Manual_Top_C) == 0x000008, "Wrong alignment on UMainMenu_Manual_Top_C");
static_assert(sizeof(UMainMenu_Manual_Top_C) == 0x000710, "Wrong size on UMainMenu_Manual_Top_C");
static_assert(offsetof(UMainMenu_Manual_Top_C, UberGraphFrame) == 0x000508, "Member 'UMainMenu_Manual_Top_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Loop) == 0x000510, "Member 'UMainMenu_Manual_Top_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Bg_Normal) == 0x000518, "Member 'UMainMenu_Manual_Top_C::Bg_Normal' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Bg_Dark) == 0x000520, "Member 'UMainMenu_Manual_Top_C::Bg_Dark' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Detail_In) == 0x000528, "Member 'UMainMenu_Manual_Top_C::Detail_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Cover_In) == 0x000530, "Member 'UMainMenu_Manual_Top_C::Cover_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Menu_In) == 0x000538, "Member 'UMainMenu_Manual_Top_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Base) == 0x000540, "Member 'UMainMenu_Manual_Top_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Base1) == 0x000548, "Member 'UMainMenu_Manual_Top_C::Base1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Base1_2) == 0x000550, "Member 'UMainMenu_Manual_Top_C::Base1_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Base1_3) == 0x000558, "Member 'UMainMenu_Manual_Top_C::Base1_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Base_Black) == 0x000560, "Member 'UMainMenu_Manual_Top_C::Base_Black' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Base_Left) == 0x000568, "Member 'UMainMenu_Manual_Top_C::Base_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Base_Right) == 0x000570, "Member 'UMainMenu_Manual_Top_C::Base_Right' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Bg) == 0x000578, "Member 'UMainMenu_Manual_Top_C::Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Bg_1) == 0x000580, "Member 'UMainMenu_Manual_Top_C::Bg_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Bg_2) == 0x000588, "Member 'UMainMenu_Manual_Top_C::Bg_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Bg_3) == 0x000590, "Member 'UMainMenu_Manual_Top_C::Bg_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Bg2) == 0x000598, "Member 'UMainMenu_Manual_Top_C::Bg2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Bg2_1) == 0x0005A0, "Member 'UMainMenu_Manual_Top_C::Bg2_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Bg2_2) == 0x0005A8, "Member 'UMainMenu_Manual_Top_C::Bg2_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Bg2_3) == 0x0005B0, "Member 'UMainMenu_Manual_Top_C::Bg2_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Bg2_4) == 0x0005B8, "Member 'UMainMenu_Manual_Top_C::Bg2_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Bg2_5) == 0x0005C0, "Member 'UMainMenu_Manual_Top_C::Bg2_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Bg2_6) == 0x0005C8, "Member 'UMainMenu_Manual_Top_C::Bg2_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Bg2_7) == 0x0005D0, "Member 'UMainMenu_Manual_Top_C::Bg2_7' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Billboard_Bg) == 0x0005D8, "Member 'UMainMenu_Manual_Top_C::Billboard_Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Billboard_Bg_1) == 0x0005E0, "Member 'UMainMenu_Manual_Top_C::Billboard_Bg_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Billboard_Bg_2) == 0x0005E8, "Member 'UMainMenu_Manual_Top_C::Billboard_Bg_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Billboard_Bg_3) == 0x0005F0, "Member 'UMainMenu_Manual_Top_C::Billboard_Bg_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Billboard_Bg_4) == 0x0005F8, "Member 'UMainMenu_Manual_Top_C::Billboard_Bg_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Detail_Movie) == 0x000600, "Member 'UMainMenu_Manual_Top_C::Detail_Movie' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, EndGauge1) == 0x000608, "Member 'UMainMenu_Manual_Top_C::EndGauge1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, EndGauge2) == 0x000610, "Member 'UMainMenu_Manual_Top_C::EndGauge2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, EndImage) == 0x000618, "Member 'UMainMenu_Manual_Top_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, EndImage_131) == 0x000620, "Member 'UMainMenu_Manual_Top_C::EndImage_131' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, EndImage_170) == 0x000628, "Member 'UMainMenu_Manual_Top_C::EndImage_170' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Icon_Left) == 0x000630, "Member 'UMainMenu_Manual_Top_C::Icon_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Icon_Right) == 0x000638, "Member 'UMainMenu_Manual_Top_C::Icon_Right' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Left1) == 0x000640, "Member 'UMainMenu_Manual_Top_C::Left1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Left2) == 0x000648, "Member 'UMainMenu_Manual_Top_C::Left2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Left3) == 0x000650, "Member 'UMainMenu_Manual_Top_C::Left3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Left4) == 0x000658, "Member 'UMainMenu_Manual_Top_C::Left4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Line) == 0x000660, "Member 'UMainMenu_Manual_Top_C::Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Line_1) == 0x000668, "Member 'UMainMenu_Manual_Top_C::Line_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint) == 0x000670, "Member 'UMainMenu_Manual_Top_C::ListPoint' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_1) == 0x000678, "Member 'UMainMenu_Manual_Top_C::ListPoint_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_2) == 0x000680, "Member 'UMainMenu_Manual_Top_C::ListPoint_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_3) == 0x000688, "Member 'UMainMenu_Manual_Top_C::ListPoint_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_4) == 0x000690, "Member 'UMainMenu_Manual_Top_C::ListPoint_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_5) == 0x000698, "Member 'UMainMenu_Manual_Top_C::ListPoint_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_6) == 0x0006A0, "Member 'UMainMenu_Manual_Top_C::ListPoint_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_7) == 0x0006A8, "Member 'UMainMenu_Manual_Top_C::ListPoint_7' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_8) == 0x0006B0, "Member 'UMainMenu_Manual_Top_C::ListPoint_8' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_9) == 0x0006B8, "Member 'UMainMenu_Manual_Top_C::ListPoint_9' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_10) == 0x0006C0, "Member 'UMainMenu_Manual_Top_C::ListPoint_10' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_11) == 0x0006C8, "Member 'UMainMenu_Manual_Top_C::ListPoint_11' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_12) == 0x0006D0, "Member 'UMainMenu_Manual_Top_C::ListPoint_12' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_13) == 0x0006D8, "Member 'UMainMenu_Manual_Top_C::ListPoint_13' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_14) == 0x0006E0, "Member 'UMainMenu_Manual_Top_C::ListPoint_14' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_15) == 0x0006E8, "Member 'UMainMenu_Manual_Top_C::ListPoint_15' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_16) == 0x0006F0, "Member 'UMainMenu_Manual_Top_C::ListPoint_16' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, ListPoint_17) == 0x0006F8, "Member 'UMainMenu_Manual_Top_C::ListPoint_17' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, System_Bg) == 0x000700, "Member 'UMainMenu_Manual_Top_C::System_Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, System_BgRight) == 0x000708, "Member 'UMainMenu_Manual_Top_C::System_BgRight' has a wrong offset!");

}

