#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_WeaponUpgrade_SelectMenu

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_WeaponUpgrade_SelectMenu.MainMenu_WeaponUpgrade_SelectMenu_C
// 0x0020 (0x0408 - 0x03E8)
class UMainMenu_WeaponUpgrade_SelectMenu_C final : public UEndMainEquipWeaponInfoWindow
{
public:
	class UEndImage*                              Icon_L1;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Left;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_R1;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Right;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_WeaponUpgrade_SelectMenu_C">();
	}
	static class UMainMenu_WeaponUpgrade_SelectMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_WeaponUpgrade_SelectMenu_C>();
	}
};
static_assert(alignof(UMainMenu_WeaponUpgrade_SelectMenu_C) == 0x000008, "Wrong alignment on UMainMenu_WeaponUpgrade_SelectMenu_C");
static_assert(sizeof(UMainMenu_WeaponUpgrade_SelectMenu_C) == 0x000408, "Wrong size on UMainMenu_WeaponUpgrade_SelectMenu_C");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SelectMenu_C, Icon_L1) == 0x0003E8, "Member 'UMainMenu_WeaponUpgrade_SelectMenu_C::Icon_L1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SelectMenu_C, Icon_Left) == 0x0003F0, "Member 'UMainMenu_WeaponUpgrade_SelectMenu_C::Icon_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SelectMenu_C, Icon_R1) == 0x0003F8, "Member 'UMainMenu_WeaponUpgrade_SelectMenu_C::Icon_R1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SelectMenu_C, Icon_Right) == 0x000400, "Member 'UMainMenu_WeaponUpgrade_SelectMenu_C::Icon_Right' has a wrong offset!");

}

