#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_MateriaEquipStatusCell

#include "Basic.hpp"

#include "EndDataObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MainMenu_MateriaEquipStatusCell.MainMenu_MateriaEquipStatusCell_C.ExecuteUbergraph_MainMenu_MateriaEquipStatusCell
// 0x01C0 (0x01C0 - 0x0000)
struct MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_ApStr;                                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Percent;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	struct FEndDataObjectEquipmentAccessor        K2Node_Event_dataObjectEquipment;                  // 0x0038(0x0020)(ConstParm, HasGetValueTypeHash)
	int32                                         K2Node_Event_Attack;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Defense;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MagicAttack;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MagicDefense;                         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_AttackAdd;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_DefenseAdd;                           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MagicAttackAdd;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MagicDefenseAdd;                      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0080(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00A0(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x00C0(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x00E0(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00F8(0x0028)()
	int32                                         CallFunc_GetMagicDefenseAdd_ReturnValue;           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x0128(0x0018)()
	int32                                         CallFunc_GetDefenseAdd_ReturnValue;                // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMagicAttackAdd_ReturnValue;            // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x0148(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_6;             // 0x0160(0x0018)()
	int32                                         CallFunc_GetAttackAdd_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0180(0x0028)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_7;             // 0x01A8(0x0018)()
};
static_assert(alignof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell) == 0x000008, "Wrong alignment on MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell");
static_assert(sizeof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell) == 0x0001C0, "Wrong size on MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, EntryPoint) == 0x000000, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_ApStr) == 0x000008, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_ApStr' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_Percent) == 0x000018, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_Percent' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_dataObjectEquipment) == 0x000038, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_dataObjectEquipment' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_Attack) == 0x000058, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_Attack' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_Defense) == 0x00005C, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_Defense' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_MagicAttack) == 0x000060, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_MagicAttack' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_MagicDefense) == 0x000064, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_MagicDefense' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_AttackAdd) == 0x000068, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_AttackAdd' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_DefenseAdd) == 0x00006C, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_DefenseAdd' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_MagicAttackAdd) == 0x000070, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_MagicAttackAdd' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_MagicDefenseAdd) == 0x000074, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_MagicDefenseAdd' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Greater_IntInt_ReturnValue) == 0x000078, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue) == 0x000080, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000098, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Add_IntInt_ReturnValue_1) == 0x00009C, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000A0, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0000B8, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000BC, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue_2) == 0x0000C0, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Greater_IntInt_ReturnValue_3) == 0x0000D8, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000DC, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue_3) == 0x0000E0, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_MakeStruct_SlateColor) == 0x0000F8, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_GetMagicDefenseAdd_ReturnValue) == 0x000120, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_GetMagicDefenseAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue_4) == 0x000128, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_GetDefenseAdd_ReturnValue) == 0x000140, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_GetDefenseAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_GetMagicAttackAdd_ReturnValue) == 0x000144, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_GetMagicAttackAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue_5) == 0x000148, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue_6) == 0x000160, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_GetAttackAdd_ReturnValue) == 0x000178, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_GetAttackAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_MakeStruct_SlateColor_1) == 0x000180, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue_7) == 0x0001A8, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue_7' has a wrong offset!");

// Function MainMenu_MateriaEquipStatusCell.MainMenu_MateriaEquipStatusCell_C.OnUpdateMaterialStatus
// 0x0018 (0x0018 - 0x0000)
struct MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus final
{
public:
	class FString                                 ApStr;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         Percent;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus) == 0x000008, "Wrong alignment on MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus");
static_assert(sizeof(MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus) == 0x000018, "Wrong size on MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus, ApStr) == 0x000000, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus::ApStr' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus, Percent) == 0x000010, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus::Percent' has a wrong offset!");

// Function MainMenu_MateriaEquipStatusCell.MainMenu_MateriaEquipStatusCell_C.OnUpdateEquipUpgradedStatus
// 0x0020 (0x0020 - 0x0000)
struct MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus final
{
public:
	int32                                         Attack;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Defense;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MagicAttack;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MagicDefense;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AttackAdd;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefenseAdd;                                        // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MagicAttackAdd;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MagicDefenseAdd;                                   // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus) == 0x000004, "Wrong alignment on MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus");
static_assert(sizeof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus) == 0x000020, "Wrong size on MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, Attack) == 0x000000, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::Attack' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, Defense) == 0x000004, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::Defense' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, MagicAttack) == 0x000008, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::MagicAttack' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, MagicDefense) == 0x00000C, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::MagicDefense' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, AttackAdd) == 0x000010, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::AttackAdd' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, DefenseAdd) == 0x000014, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::DefenseAdd' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, MagicAttackAdd) == 0x000018, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::MagicAttackAdd' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, MagicDefenseAdd) == 0x00001C, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::MagicDefenseAdd' has a wrong offset!");

// Function MainMenu_MateriaEquipStatusCell.MainMenu_MateriaEquipStatusCell_C.OnUpdateEquipStatus
// 0x0020 (0x0020 - 0x0000)
struct MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipStatus final
{
public:
	struct FEndDataObjectEquipmentAccessor        dataObjectEquipment;                               // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipStatus) == 0x000008, "Wrong alignment on MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipStatus");
static_assert(sizeof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipStatus) == 0x000020, "Wrong size on MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipStatus");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipStatus, dataObjectEquipment) == 0x000000, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipStatus::dataObjectEquipment' has a wrong offset!");

}

