#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Cell_Light4

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Cell_Light4.MainMenu_Cell_Light4_C
// 0x0060 (0x0428 - 0x03C8)
class UMainMenu_Cell_Light4_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Light;                                             // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FramePoint1;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FramePoint2;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconPoint;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PointFrame1;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PointFrame1_1;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PointFrame2;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PointFrame2_1;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PointFrame3;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_Cell_Light4(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Cell_Light4_C">();
	}
	static class UMainMenu_Cell_Light4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Cell_Light4_C>();
	}
};
static_assert(alignof(UMainMenu_Cell_Light4_C) == 0x000008, "Wrong alignment on UMainMenu_Cell_Light4_C");
static_assert(sizeof(UMainMenu_Cell_Light4_C) == 0x000428, "Wrong size on UMainMenu_Cell_Light4_C");
static_assert(offsetof(UMainMenu_Cell_Light4_C, UberGraphFrame) == 0x0003C8, "Member 'UMainMenu_Cell_Light4_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light4_C, Light) == 0x0003D0, "Member 'UMainMenu_Cell_Light4_C::Light' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light4_C, EndImage) == 0x0003D8, "Member 'UMainMenu_Cell_Light4_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light4_C, FramePoint1) == 0x0003E0, "Member 'UMainMenu_Cell_Light4_C::FramePoint1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light4_C, FramePoint2) == 0x0003E8, "Member 'UMainMenu_Cell_Light4_C::FramePoint2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light4_C, IconPoint) == 0x0003F0, "Member 'UMainMenu_Cell_Light4_C::IconPoint' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light4_C, Img_BtnLight) == 0x0003F8, "Member 'UMainMenu_Cell_Light4_C::Img_BtnLight' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light4_C, PointFrame1) == 0x000400, "Member 'UMainMenu_Cell_Light4_C::PointFrame1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light4_C, PointFrame1_1) == 0x000408, "Member 'UMainMenu_Cell_Light4_C::PointFrame1_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light4_C, PointFrame2) == 0x000410, "Member 'UMainMenu_Cell_Light4_C::PointFrame2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light4_C, PointFrame2_1) == 0x000418, "Member 'UMainMenu_Cell_Light4_C::PointFrame2_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light4_C, PointFrame3) == 0x000420, "Member 'UMainMenu_Cell_Light4_C::PointFrame3' has a wrong offset!");

}

