#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_WeaponUpgrade_StarInfoCell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_WeaponUpgrade_StarInfoCell.MainMenu_WeaponUpgrade_StarInfoCell_C
// 0x0018 (0x03E0 - 0x03C8)
class UMainMenu_WeaponUpgrade_StarInfoCell_C final : public UEndUserWidget
{
public:
	class UEndImageSet*                           Icon_Star;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_Shadow;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_WeaponUpgrade_StarInfoCell_C">();
	}
	static class UMainMenu_WeaponUpgrade_StarInfoCell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_WeaponUpgrade_StarInfoCell_C>();
	}
};
static_assert(alignof(UMainMenu_WeaponUpgrade_StarInfoCell_C) == 0x000008, "Wrong alignment on UMainMenu_WeaponUpgrade_StarInfoCell_C");
static_assert(sizeof(UMainMenu_WeaponUpgrade_StarInfoCell_C) == 0x0003E0, "Wrong size on UMainMenu_WeaponUpgrade_StarInfoCell_C");
static_assert(offsetof(UMainMenu_WeaponUpgrade_StarInfoCell_C, Icon_Star) == 0x0003C8, "Member 'UMainMenu_WeaponUpgrade_StarInfoCell_C::Icon_Star' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_StarInfoCell_C, Img_Slash) == 0x0003D0, "Member 'UMainMenu_WeaponUpgrade_StarInfoCell_C::Img_Slash' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_StarInfoCell_C, Img_Slash_Shadow) == 0x0003D8, "Member 'UMainMenu_WeaponUpgrade_StarInfoCell_C::Img_Slash_Shadow' has a wrong offset!");

}

