#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_DLC_Top

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_DLC_Top.MainMenu_DLC_Top_C
// 0x00F8 (0x0568 - 0x0470)
class UMainMenu_DLC_Top_C final : public UEndMainDlcTopMenu
{
public:
	class UWidgetAnimation*                       Change_In;                                         // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_Out;                                        // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Black;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_4;                                              // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_11;                                             // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2;                                               // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_1;                                             // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_2;                                             // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_3;                                             // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CategoryIcon;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCategoryTitle_C*                       CategoryTitle;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Info;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2;                                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint;                                         // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_1;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_2;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_3;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_4;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_5;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_6;                                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_7;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_8;                                       // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_Bg_C*                  System_Bg;                                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgLeft_C*              System_BgLeft;                                     // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgLeft_C*              System_BgLeft2;                                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgRight_C*             System_BgRight;                                    // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_DLC_Top_C">();
	}
	static class UMainMenu_DLC_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_DLC_Top_C>();
	}
};
static_assert(alignof(UMainMenu_DLC_Top_C) == 0x000008, "Wrong alignment on UMainMenu_DLC_Top_C");
static_assert(sizeof(UMainMenu_DLC_Top_C) == 0x000568, "Wrong size on UMainMenu_DLC_Top_C");
static_assert(offsetof(UMainMenu_DLC_Top_C, Change_In) == 0x000470, "Member 'UMainMenu_DLC_Top_C::Change_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, Change_Out) == 0x000478, "Member 'UMainMenu_DLC_Top_C::Change_Out' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, Menu_In) == 0x000480, "Member 'UMainMenu_DLC_Top_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, Base) == 0x000488, "Member 'UMainMenu_DLC_Top_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, Base_Black) == 0x000490, "Member 'UMainMenu_DLC_Top_C::Base_Black' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, Bg) == 0x000498, "Member 'UMainMenu_DLC_Top_C::Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, Bg_4) == 0x0004A0, "Member 'UMainMenu_DLC_Top_C::Bg_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, Bg_11) == 0x0004A8, "Member 'UMainMenu_DLC_Top_C::Bg_11' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, Bg2) == 0x0004B0, "Member 'UMainMenu_DLC_Top_C::Bg2' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, Bg2_1) == 0x0004B8, "Member 'UMainMenu_DLC_Top_C::Bg2_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, Bg2_2) == 0x0004C0, "Member 'UMainMenu_DLC_Top_C::Bg2_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, Bg2_3) == 0x0004C8, "Member 'UMainMenu_DLC_Top_C::Bg2_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, Billboard_Bg) == 0x0004D0, "Member 'UMainMenu_DLC_Top_C::Billboard_Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, CategoryIcon) == 0x0004D8, "Member 'UMainMenu_DLC_Top_C::CategoryIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, CategoryTitle) == 0x0004E0, "Member 'UMainMenu_DLC_Top_C::CategoryTitle' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, Line) == 0x0004E8, "Member 'UMainMenu_DLC_Top_C::Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, Line_Info) == 0x0004F0, "Member 'UMainMenu_DLC_Top_C::Line_Info' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, ListBg2) == 0x0004F8, "Member 'UMainMenu_DLC_Top_C::ListBg2' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, ListPoint) == 0x000500, "Member 'UMainMenu_DLC_Top_C::ListPoint' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, ListPoint_1) == 0x000508, "Member 'UMainMenu_DLC_Top_C::ListPoint_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, ListPoint_2) == 0x000510, "Member 'UMainMenu_DLC_Top_C::ListPoint_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, ListPoint_3) == 0x000518, "Member 'UMainMenu_DLC_Top_C::ListPoint_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, ListPoint_4) == 0x000520, "Member 'UMainMenu_DLC_Top_C::ListPoint_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, ListPoint_5) == 0x000528, "Member 'UMainMenu_DLC_Top_C::ListPoint_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, ListPoint_6) == 0x000530, "Member 'UMainMenu_DLC_Top_C::ListPoint_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, ListPoint_7) == 0x000538, "Member 'UMainMenu_DLC_Top_C::ListPoint_7' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, ListPoint_8) == 0x000540, "Member 'UMainMenu_DLC_Top_C::ListPoint_8' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, System_Bg) == 0x000548, "Member 'UMainMenu_DLC_Top_C::System_Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, System_BgLeft) == 0x000550, "Member 'UMainMenu_DLC_Top_C::System_BgLeft' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, System_BgLeft2) == 0x000558, "Member 'UMainMenu_DLC_Top_C::System_BgLeft2' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_Top_C, System_BgRight) == 0x000560, "Member 'UMainMenu_DLC_Top_C::System_BgRight' has a wrong offset!");

}

