#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Tutorial_Window

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Tutorial_Window.MainMenu_Tutorial_Window_C
// 0x0028 (0x03F8 - 0x03D0)
class UMainMenu_Tutorial_Window_C final : public UEndDescriptionWindow
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase1;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Tutorial_Window_C">();
	}
	static class UMainMenu_Tutorial_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Tutorial_Window_C>();
	}
};
static_assert(alignof(UMainMenu_Tutorial_Window_C) == 0x000008, "Wrong alignment on UMainMenu_Tutorial_Window_C");
static_assert(sizeof(UMainMenu_Tutorial_Window_C) == 0x0003F8, "Wrong size on UMainMenu_Tutorial_Window_C");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, Out) == 0x0003D0, "Member 'UMainMenu_Tutorial_Window_C::Out' has a wrong offset!");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, In) == 0x0003D8, "Member 'UMainMenu_Tutorial_Window_C::In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, Bg) == 0x0003E0, "Member 'UMainMenu_Tutorial_Window_C::Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, BtnBase1) == 0x0003E8, "Member 'UMainMenu_Tutorial_Window_C::BtnBase1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, Frame) == 0x0003F0, "Member 'UMainMenu_Tutorial_Window_C::Frame' has a wrong offset!");

}

