#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_WeaponUpgrade_SpBox

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_WeaponUpgrade_SpBox.MainMenu_WeaponUpgrade_SpBox_C
// 0x0018 (0x03E0 - 0x03C8)
class UMainMenu_WeaponUpgrade_SpBox_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Base2;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame1;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame2;                                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_WeaponUpgrade_SpBox_C">();
	}
	static class UMainMenu_WeaponUpgrade_SpBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_WeaponUpgrade_SpBox_C>();
	}
};
static_assert(alignof(UMainMenu_WeaponUpgrade_SpBox_C) == 0x000008, "Wrong alignment on UMainMenu_WeaponUpgrade_SpBox_C");
static_assert(sizeof(UMainMenu_WeaponUpgrade_SpBox_C) == 0x0003E0, "Wrong size on UMainMenu_WeaponUpgrade_SpBox_C");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SpBox_C, Base2) == 0x0003C8, "Member 'UMainMenu_WeaponUpgrade_SpBox_C::Base2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SpBox_C, Frame1) == 0x0003D0, "Member 'UMainMenu_WeaponUpgrade_SpBox_C::Frame1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_SpBox_C, Frame2) == 0x0003D8, "Member 'UMainMenu_WeaponUpgrade_SpBox_C::Frame2' has a wrong offset!");

}

