#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_CategoryChangeBtn

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_CategoryChangeBtn.MainMenu_CategoryChangeBtn_C
// 0x0038 (0x0408 - 0x03D0)
class UMainMenu_CategoryChangeBtn_C final : public UEndMenuCategoryChangeBtn
{
public:
	class UWidgetAnimation*                       OnPressR2;                                         // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnPressL2;                                         // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NoActive;                                          // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              EndImage_65;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Left;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Right;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_CategoryChangeBtn_C">();
	}
	static class UMainMenu_CategoryChangeBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_CategoryChangeBtn_C>();
	}
};
static_assert(alignof(UMainMenu_CategoryChangeBtn_C) == 0x000008, "Wrong alignment on UMainMenu_CategoryChangeBtn_C");
static_assert(sizeof(UMainMenu_CategoryChangeBtn_C) == 0x000408, "Wrong size on UMainMenu_CategoryChangeBtn_C");
static_assert(offsetof(UMainMenu_CategoryChangeBtn_C, OnPressR2) == 0x0003D0, "Member 'UMainMenu_CategoryChangeBtn_C::OnPressR2' has a wrong offset!");
static_assert(offsetof(UMainMenu_CategoryChangeBtn_C, OnPressL2) == 0x0003D8, "Member 'UMainMenu_CategoryChangeBtn_C::OnPressL2' has a wrong offset!");
static_assert(offsetof(UMainMenu_CategoryChangeBtn_C, Normal) == 0x0003E0, "Member 'UMainMenu_CategoryChangeBtn_C::Normal' has a wrong offset!");
static_assert(offsetof(UMainMenu_CategoryChangeBtn_C, NoActive) == 0x0003E8, "Member 'UMainMenu_CategoryChangeBtn_C::NoActive' has a wrong offset!");
static_assert(offsetof(UMainMenu_CategoryChangeBtn_C, EndImage_65) == 0x0003F0, "Member 'UMainMenu_CategoryChangeBtn_C::EndImage_65' has a wrong offset!");
static_assert(offsetof(UMainMenu_CategoryChangeBtn_C, Icon_Left) == 0x0003F8, "Member 'UMainMenu_CategoryChangeBtn_C::Icon_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_CategoryChangeBtn_C, Icon_Right) == 0x000400, "Member 'UMainMenu_CategoryChangeBtn_C::Icon_Right' has a wrong offset!");

}

