#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Item_SelectMember_List

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Item_SelectMember_List.MainMenu_Item_SelectMember_List_C
// 0x0048 (0x0410 - 0x03C8)
class UMainMenu_Item_SelectMember_List_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Base1_4;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_69;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point2_1;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point2_4;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title_1;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TitleValue;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TitleValue_1;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Item_SelectMember_List_C">();
	}
	static class UMainMenu_Item_SelectMember_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Item_SelectMember_List_C>();
	}
};
static_assert(alignof(UMainMenu_Item_SelectMember_List_C) == 0x000008, "Wrong alignment on UMainMenu_Item_SelectMember_List_C");
static_assert(sizeof(UMainMenu_Item_SelectMember_List_C) == 0x000410, "Wrong size on UMainMenu_Item_SelectMember_List_C");
static_assert(offsetof(UMainMenu_Item_SelectMember_List_C, Base1_4) == 0x0003C8, "Member 'UMainMenu_Item_SelectMember_List_C::Base1_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_SelectMember_List_C, Bg) == 0x0003D0, "Member 'UMainMenu_Item_SelectMember_List_C::Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_SelectMember_List_C, EndImage_69) == 0x0003D8, "Member 'UMainMenu_Item_SelectMember_List_C::EndImage_69' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_SelectMember_List_C, Line) == 0x0003E0, "Member 'UMainMenu_Item_SelectMember_List_C::Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_SelectMember_List_C, Point2_1) == 0x0003E8, "Member 'UMainMenu_Item_SelectMember_List_C::Point2_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_SelectMember_List_C, Point2_4) == 0x0003F0, "Member 'UMainMenu_Item_SelectMember_List_C::Point2_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_SelectMember_List_C, Txt_Title_1) == 0x0003F8, "Member 'UMainMenu_Item_SelectMember_List_C::Txt_Title_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_SelectMember_List_C, Txt_TitleValue) == 0x000400, "Member 'UMainMenu_Item_SelectMember_List_C::Txt_TitleValue' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_SelectMember_List_C, Txt_TitleValue_1) == 0x000408, "Member 'UMainMenu_Item_SelectMember_List_C::Txt_TitleValue_1' has a wrong offset!");

}

