#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Options_Btn3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Options_Btn3.MainMenu_Options_Btn3_C
// 0x0048 (0x0478 - 0x0430)
class UMainMenu_Options_Btn3_C final : public UEndMainItemSelectBtnText
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_Btn;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Hover;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_74;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Icon_Auto;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MarkBase;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MarkFrame;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_Options_Btn3(int32 EntryPoint);
	void BndEvt__SelectBtn_K2Node_ComponentBoundEvent_53_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SelectBtn_K2Node_ComponentBoundEvent_40_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Options_Btn3_C">();
	}
	static class UMainMenu_Options_Btn3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Options_Btn3_C>();
	}
};
static_assert(alignof(UMainMenu_Options_Btn3_C) == 0x000008, "Wrong alignment on UMainMenu_Options_Btn3_C");
static_assert(sizeof(UMainMenu_Options_Btn3_C) == 0x000478, "Wrong size on UMainMenu_Options_Btn3_C");
static_assert(offsetof(UMainMenu_Options_Btn3_C, UberGraphFrame) == 0x000430, "Member 'UMainMenu_Options_Btn3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn3_C, BtnHover) == 0x000438, "Member 'UMainMenu_Options_Btn3_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn3_C, Base_Btn) == 0x000440, "Member 'UMainMenu_Options_Btn3_C::Base_Btn' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn3_C, Base_Hover) == 0x000448, "Member 'UMainMenu_Options_Btn3_C::Base_Hover' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn3_C, EndImage) == 0x000450, "Member 'UMainMenu_Options_Btn3_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn3_C, EndImage_74) == 0x000458, "Member 'UMainMenu_Options_Btn3_C::EndImage_74' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn3_C, Icon_Auto) == 0x000460, "Member 'UMainMenu_Options_Btn3_C::Icon_Auto' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn3_C, MarkBase) == 0x000468, "Member 'UMainMenu_Options_Btn3_C::MarkBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn3_C, MarkFrame) == 0x000470, "Member 'UMainMenu_Options_Btn3_C::MarkFrame' has a wrong offset!");

}

