#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Item_Member_Btn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EndDataBase_structs.hpp"
#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Item_Member_Btn.MainMenu_Item_Member_Btn_C
// 0x00A0 (0x0468 - 0x03C8)
class UMainMenu_Item_Member_Btn_C final : public UEndMenuMemberSelectBtn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       BtnDeath;                                          // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnDanger;                                         // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              BtnDangerBase;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          EndBillboard_CharaBtn;                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_172;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_01;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_02;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_HP_Num;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Hp_Total;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_MP_Num;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Mp_Total;                                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Name;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPlayerType                                   PlayerType;                                        // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoftObjectPath>                BillBoardPaths;                                    // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_MainMenu_Item_Member_Btn(int32 EntryPoint);
	void OnChangeCharacterCell(EPlayerType PlayerType_0);
	void OnSetupCharacterCell(EPlayerType PlayerType_0);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Item_Member_Btn_C">();
	}
	static class UMainMenu_Item_Member_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Item_Member_Btn_C>();
	}
};
static_assert(alignof(UMainMenu_Item_Member_Btn_C) == 0x000008, "Wrong alignment on UMainMenu_Item_Member_Btn_C");
static_assert(sizeof(UMainMenu_Item_Member_Btn_C) == 0x000468, "Wrong size on UMainMenu_Item_Member_Btn_C");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, UberGraphFrame) == 0x0003C8, "Member 'UMainMenu_Item_Member_Btn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, BtnDeath) == 0x0003D0, "Member 'UMainMenu_Item_Member_Btn_C::BtnDeath' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, BtnDanger) == 0x0003D8, "Member 'UMainMenu_Item_Member_Btn_C::BtnDanger' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, BtnHover) == 0x0003E0, "Member 'UMainMenu_Item_Member_Btn_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, Menu_In) == 0x0003E8, "Member 'UMainMenu_Item_Member_Btn_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, BtnDangerBase) == 0x0003F0, "Member 'UMainMenu_Item_Member_Btn_C::BtnDangerBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, EndBillboard_CharaBtn) == 0x0003F8, "Member 'UMainMenu_Item_Member_Btn_C::EndBillboard_CharaBtn' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, EndImage) == 0x000400, "Member 'UMainMenu_Item_Member_Btn_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, EndImage_172) == 0x000408, "Member 'UMainMenu_Item_Member_Btn_C::EndImage_172' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, Img_Slash_01) == 0x000410, "Member 'UMainMenu_Item_Member_Btn_C::Img_Slash_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, Img_Slash_02) == 0x000418, "Member 'UMainMenu_Item_Member_Btn_C::Img_Slash_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, MainMenu_Btn) == 0x000420, "Member 'UMainMenu_Item_Member_Btn_C::MainMenu_Btn' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, Txt_HP_Num) == 0x000428, "Member 'UMainMenu_Item_Member_Btn_C::Txt_HP_Num' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, Txt_Hp_Total) == 0x000430, "Member 'UMainMenu_Item_Member_Btn_C::Txt_Hp_Total' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, Txt_MP_Num) == 0x000438, "Member 'UMainMenu_Item_Member_Btn_C::Txt_MP_Num' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, Txt_Mp_Total) == 0x000440, "Member 'UMainMenu_Item_Member_Btn_C::Txt_Mp_Total' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, Txt_Name) == 0x000448, "Member 'UMainMenu_Item_Member_Btn_C::Txt_Name' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, PlayerType) == 0x000450, "Member 'UMainMenu_Item_Member_Btn_C::PlayerType' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Member_Btn_C, BillBoardPaths) == 0x000458, "Member 'UMainMenu_Item_Member_Btn_C::BillBoardPaths' has a wrong offset!");

}

