#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Item_Cell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Item_Cell.MainMenu_Item_Cell_C
// 0x0048 (0x0410 - 0x03C8)
class UMainMenu_Item_Cell_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       BtnHover;                                          // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_172;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_301;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Item;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_Item_Cell(int32 EntryPoint);
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Item_Cell_C">();
	}
	static class UMainMenu_Item_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Item_Cell_C>();
	}
};
static_assert(alignof(UMainMenu_Item_Cell_C) == 0x000008, "Wrong alignment on UMainMenu_Item_Cell_C");
static_assert(sizeof(UMainMenu_Item_Cell_C) == 0x000410, "Wrong size on UMainMenu_Item_Cell_C");
static_assert(offsetof(UMainMenu_Item_Cell_C, UberGraphFrame) == 0x0003C8, "Member 'UMainMenu_Item_Cell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, BtnHover) == 0x0003D0, "Member 'UMainMenu_Item_Cell_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, Menu_In) == 0x0003D8, "Member 'UMainMenu_Item_Cell_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, EndImage) == 0x0003E0, "Member 'UMainMenu_Item_Cell_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, EndImage_172) == 0x0003E8, "Member 'UMainMenu_Item_Cell_C::EndImage_172' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, EndImage_301) == 0x0003F0, "Member 'UMainMenu_Item_Cell_C::EndImage_301' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, Icon_Item) == 0x0003F8, "Member 'UMainMenu_Item_Cell_C::Icon_Item' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, MainMenu_Btn) == 0x000400, "Member 'UMainMenu_Item_Cell_C::MainMenu_Btn' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, Txt_Title) == 0x000408, "Member 'UMainMenu_Item_Cell_C::Txt_Title' has a wrong offset!");

}

