#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_ChapterSelect_BtnLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_ChapterSelect_BtnLight.MainMenu_ChapterSelect_BtnLight_C
// 0x0028 (0x03F0 - 0x03C8)
class UMainMenu_ChapterSelect_BtnLight_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Cursor_Left;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_ChapterSelect_BtnLight(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_ChapterSelect_BtnLight_C">();
	}
	static class UMainMenu_ChapterSelect_BtnLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_ChapterSelect_BtnLight_C>();
	}
};
static_assert(alignof(UMainMenu_ChapterSelect_BtnLight_C) == 0x000008, "Wrong alignment on UMainMenu_ChapterSelect_BtnLight_C");
static_assert(sizeof(UMainMenu_ChapterSelect_BtnLight_C) == 0x0003F0, "Wrong size on UMainMenu_ChapterSelect_BtnLight_C");
static_assert(offsetof(UMainMenu_ChapterSelect_BtnLight_C, UberGraphFrame) == 0x0003C8, "Member 'UMainMenu_ChapterSelect_BtnLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_BtnLight_C, Loop) == 0x0003D0, "Member 'UMainMenu_ChapterSelect_BtnLight_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_BtnLight_C, Cursor_Left) == 0x0003D8, "Member 'UMainMenu_ChapterSelect_BtnLight_C::Cursor_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_BtnLight_C, EndImage) == 0x0003E0, "Member 'UMainMenu_ChapterSelect_BtnLight_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_BtnLight_C, Img_BtnLight) == 0x0003E8, "Member 'UMainMenu_ChapterSelect_BtnLight_C::Img_BtnLight' has a wrong offset!");

}

