#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_DLC_CellLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_DLC_CellLight.MainMenu_DLC_CellLight_C
// 0x0060 (0x0470 - 0x0410)
class UMainMenu_DLC_CellLight_C final : public UEndSaveDataCell
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_SaveDate_List;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_Left;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverBase;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light1;                                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light2;                                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class USaveData_Cell_C* Sender)> OnClicked;                                         // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnCancelled;                                       // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_MainMenu_DLC_CellLight(int32 EntryPoint);
	void Construct();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_DLC_CellLight_C">();
	}
	static class UMainMenu_DLC_CellLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_DLC_CellLight_C>();
	}
};
static_assert(alignof(UMainMenu_DLC_CellLight_C) == 0x000008, "Wrong alignment on UMainMenu_DLC_CellLight_C");
static_assert(sizeof(UMainMenu_DLC_CellLight_C) == 0x000470, "Wrong size on UMainMenu_DLC_CellLight_C");
static_assert(offsetof(UMainMenu_DLC_CellLight_C, UberGraphFrame) == 0x000410, "Member 'UMainMenu_DLC_CellLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_CellLight_C, Loop) == 0x000418, "Member 'UMainMenu_DLC_CellLight_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_CellLight_C, All_SaveDate_List) == 0x000420, "Member 'UMainMenu_DLC_CellLight_C::All_SaveDate_List' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_CellLight_C, Cursor_Left) == 0x000428, "Member 'UMainMenu_DLC_CellLight_C::Cursor_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_CellLight_C, HoverBase) == 0x000430, "Member 'UMainMenu_DLC_CellLight_C::HoverBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_CellLight_C, Img_BtnLight) == 0x000438, "Member 'UMainMenu_DLC_CellLight_C::Img_BtnLight' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_CellLight_C, Light1) == 0x000440, "Member 'UMainMenu_DLC_CellLight_C::Light1' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_CellLight_C, Light2) == 0x000448, "Member 'UMainMenu_DLC_CellLight_C::Light2' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_CellLight_C, OnClicked) == 0x000450, "Member 'UMainMenu_DLC_CellLight_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UMainMenu_DLC_CellLight_C, OnCancelled) == 0x000460, "Member 'UMainMenu_DLC_CellLight_C::OnCancelled' has a wrong offset!");

}

