#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_System_BgLeft

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_System_BgLeft.MainMenu_System_BgLeft_C
// 0x0080 (0x0448 - 0x03C8)
class UMainMenu_System_BgLeft_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop3;                                             // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop2;                                             // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_1;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndGauge*                              EndGauge1;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndGauge*                              EndGauge2;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndGauge*                              EndGauge3;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndGauge*                              EndGauge4;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndGauge*                              EndGauge5;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_63;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left1;                                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left2;                                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left3;                                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left4;                                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_System_BgLeft(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_System_BgLeft_C">();
	}
	static class UMainMenu_System_BgLeft_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_System_BgLeft_C>();
	}
};
static_assert(alignof(UMainMenu_System_BgLeft_C) == 0x000008, "Wrong alignment on UMainMenu_System_BgLeft_C");
static_assert(sizeof(UMainMenu_System_BgLeft_C) == 0x000448, "Wrong size on UMainMenu_System_BgLeft_C");
static_assert(offsetof(UMainMenu_System_BgLeft_C, UberGraphFrame) == 0x0003C8, "Member 'UMainMenu_System_BgLeft_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgLeft_C, Loop3) == 0x0003D0, "Member 'UMainMenu_System_BgLeft_C::Loop3' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgLeft_C, Loop2) == 0x0003D8, "Member 'UMainMenu_System_BgLeft_C::Loop2' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgLeft_C, In) == 0x0003E0, "Member 'UMainMenu_System_BgLeft_C::In' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgLeft_C, Base1) == 0x0003E8, "Member 'UMainMenu_System_BgLeft_C::Base1' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgLeft_C, Base1_1) == 0x0003F0, "Member 'UMainMenu_System_BgLeft_C::Base1_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgLeft_C, EndGauge1) == 0x0003F8, "Member 'UMainMenu_System_BgLeft_C::EndGauge1' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgLeft_C, EndGauge2) == 0x000400, "Member 'UMainMenu_System_BgLeft_C::EndGauge2' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgLeft_C, EndGauge3) == 0x000408, "Member 'UMainMenu_System_BgLeft_C::EndGauge3' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgLeft_C, EndGauge4) == 0x000410, "Member 'UMainMenu_System_BgLeft_C::EndGauge4' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgLeft_C, EndGauge5) == 0x000418, "Member 'UMainMenu_System_BgLeft_C::EndGauge5' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgLeft_C, EndImage_63) == 0x000420, "Member 'UMainMenu_System_BgLeft_C::EndImage_63' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgLeft_C, Left1) == 0x000428, "Member 'UMainMenu_System_BgLeft_C::Left1' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgLeft_C, Left2) == 0x000430, "Member 'UMainMenu_System_BgLeft_C::Left2' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgLeft_C, Left3) == 0x000438, "Member 'UMainMenu_System_BgLeft_C::Left3' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_BgLeft_C, Left4) == 0x000440, "Member 'UMainMenu_System_BgLeft_C::Left4' has a wrong offset!");

}

