#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Status

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Status.MainMenu_Status_C
// 0x01A0 (0x08F0 - 0x0750)
class UMainMenu_Status_C final : public UEndStatusWindow
{
public:
	class UWidgetAnimation*                       AbilityList_Out;                                   // 0x0750(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AbilityList_In;                                    // 0x0758(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0760(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_3;                                              // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2;                                               // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_1;                                             // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_2;                                             // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_3;                                             // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_4;                                             // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_5;                                             // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_6;                                             // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_7;                                             // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_InfoWindowBg_C*               InfoWindowBg_1;                                    // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1;                                             // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2;                                             // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2_1;                                           // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2_2;                                           // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2_3;                                           // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line3;                                             // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint;                                         // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_1;                                       // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_2;                                       // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_3;                                       // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_4;                                       // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_5;                                       // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_6;                                       // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_7;                                       // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_8;                                       // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_9;                                       // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_10;                                      // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_11;                                      // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_12;                                      // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_13;                                      // 0x0858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_14;                                      // 0x0860(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_15;                                      // 0x0868(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_16;                                      // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_17;                                      // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Materia_Line1;                                     // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Materia_Line2;                                     // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerLevel_C*                         PlayerLevel;                                       // 0x0890(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatusList_2_C*                        StatusList_2;                                      // 0x0898(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusIconList_C*             StatusList_IconList;                               // 0x08A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusIconList_C*             StatusList_IconList_1;                             // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusIconList_C*             StatusList_IconList_2;                             // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusIconList_C*             StatusList_IconList_3;                             // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusIconList_C*             StatusList_IconList_4;                             // 0x08C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgLeft_C*              System_BgLeft;                                     // 0x08C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgRight_C*             System_BgRight;                                    // 0x08D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_Title_C*           Title_Atk_Attribution_2;                           // 0x08D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_Title_C*           Title_Def_Attribution_2;                           // 0x08E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_Title_C*           Title_Passive;                                     // 0x08E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Status_C">();
	}
	static class UMainMenu_Status_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Status_C>();
	}
};
static_assert(alignof(UMainMenu_Status_C) == 0x000008, "Wrong alignment on UMainMenu_Status_C");
static_assert(sizeof(UMainMenu_Status_C) == 0x0008F0, "Wrong size on UMainMenu_Status_C");
static_assert(offsetof(UMainMenu_Status_C, AbilityList_Out) == 0x000750, "Member 'UMainMenu_Status_C::AbilityList_Out' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, AbilityList_In) == 0x000758, "Member 'UMainMenu_Status_C::AbilityList_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, In) == 0x000760, "Member 'UMainMenu_Status_C::In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Bg) == 0x000768, "Member 'UMainMenu_Status_C::Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Bg_3) == 0x000770, "Member 'UMainMenu_Status_C::Bg_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Bg2) == 0x000778, "Member 'UMainMenu_Status_C::Bg2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Bg2_1) == 0x000780, "Member 'UMainMenu_Status_C::Bg2_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Bg2_2) == 0x000788, "Member 'UMainMenu_Status_C::Bg2_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Bg2_3) == 0x000790, "Member 'UMainMenu_Status_C::Bg2_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Bg2_4) == 0x000798, "Member 'UMainMenu_Status_C::Bg2_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Bg2_5) == 0x0007A0, "Member 'UMainMenu_Status_C::Bg2_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Bg2_6) == 0x0007A8, "Member 'UMainMenu_Status_C::Bg2_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Bg2_7) == 0x0007B0, "Member 'UMainMenu_Status_C::Bg2_7' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, InfoWindowBg_1) == 0x0007B8, "Member 'UMainMenu_Status_C::InfoWindowBg_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Line1) == 0x0007C0, "Member 'UMainMenu_Status_C::Line1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Line2) == 0x0007C8, "Member 'UMainMenu_Status_C::Line2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Line2_1) == 0x0007D0, "Member 'UMainMenu_Status_C::Line2_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Line2_2) == 0x0007D8, "Member 'UMainMenu_Status_C::Line2_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Line2_3) == 0x0007E0, "Member 'UMainMenu_Status_C::Line2_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Line3) == 0x0007E8, "Member 'UMainMenu_Status_C::Line3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint) == 0x0007F0, "Member 'UMainMenu_Status_C::ListPoint' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_1) == 0x0007F8, "Member 'UMainMenu_Status_C::ListPoint_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_2) == 0x000800, "Member 'UMainMenu_Status_C::ListPoint_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_3) == 0x000808, "Member 'UMainMenu_Status_C::ListPoint_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_4) == 0x000810, "Member 'UMainMenu_Status_C::ListPoint_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_5) == 0x000818, "Member 'UMainMenu_Status_C::ListPoint_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_6) == 0x000820, "Member 'UMainMenu_Status_C::ListPoint_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_7) == 0x000828, "Member 'UMainMenu_Status_C::ListPoint_7' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_8) == 0x000830, "Member 'UMainMenu_Status_C::ListPoint_8' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_9) == 0x000838, "Member 'UMainMenu_Status_C::ListPoint_9' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_10) == 0x000840, "Member 'UMainMenu_Status_C::ListPoint_10' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_11) == 0x000848, "Member 'UMainMenu_Status_C::ListPoint_11' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_12) == 0x000850, "Member 'UMainMenu_Status_C::ListPoint_12' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_13) == 0x000858, "Member 'UMainMenu_Status_C::ListPoint_13' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_14) == 0x000860, "Member 'UMainMenu_Status_C::ListPoint_14' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_15) == 0x000868, "Member 'UMainMenu_Status_C::ListPoint_15' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_16) == 0x000870, "Member 'UMainMenu_Status_C::ListPoint_16' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, ListPoint_17) == 0x000878, "Member 'UMainMenu_Status_C::ListPoint_17' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Materia_Line1) == 0x000880, "Member 'UMainMenu_Status_C::Materia_Line1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Materia_Line2) == 0x000888, "Member 'UMainMenu_Status_C::Materia_Line2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, PlayerLevel) == 0x000890, "Member 'UMainMenu_Status_C::PlayerLevel' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, StatusList_2) == 0x000898, "Member 'UMainMenu_Status_C::StatusList_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, StatusList_IconList) == 0x0008A0, "Member 'UMainMenu_Status_C::StatusList_IconList' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, StatusList_IconList_1) == 0x0008A8, "Member 'UMainMenu_Status_C::StatusList_IconList_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, StatusList_IconList_2) == 0x0008B0, "Member 'UMainMenu_Status_C::StatusList_IconList_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, StatusList_IconList_3) == 0x0008B8, "Member 'UMainMenu_Status_C::StatusList_IconList_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, StatusList_IconList_4) == 0x0008C0, "Member 'UMainMenu_Status_C::StatusList_IconList_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, System_BgLeft) == 0x0008C8, "Member 'UMainMenu_Status_C::System_BgLeft' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, System_BgRight) == 0x0008D0, "Member 'UMainMenu_Status_C::System_BgRight' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Title_Atk_Attribution_2) == 0x0008D8, "Member 'UMainMenu_Status_C::Title_Atk_Attribution_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Title_Def_Attribution_2) == 0x0008E0, "Member 'UMainMenu_Status_C::Title_Def_Attribution_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Status_C, Title_Passive) == 0x0008E8, "Member 'UMainMenu_Status_C::Title_Passive' has a wrong offset!");

}

