#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_WeaponUpgrade_CircleGauge3

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_WeaponUpgrade_CircleGauge3.MainMenu_WeaponUpgrade_CircleGauge3_C
// 0x0120 (0x05B8 - 0x0498)
class UMainMenu_WeaponUpgrade_CircleGauge3_C final : public UEndWeaponUpgradeCircleGauge
{
public:
	class UEndImage*                              Base1;                                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Base_Frame1;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseSp;                                            // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseSpFrame;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot2_1;                                            // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot2_2;                                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              dot3_1;                                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              dot3_2;                                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot4_1;                                            // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot4_2;                                            // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot5_1;                                            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot5_2;                                            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot6_1;                                            // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot6_2;                                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DotFrame2;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DotFrame3;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DotFrame4;                                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DotFrame5;                                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DotFrame6;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_5;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Level_BG;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_2;                                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_3;                                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_4;                                       // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_5;                                       // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2_1;                                           // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2_2;                                           // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line3_1;                                           // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line3_2;                                           // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line4_1;                                           // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line4_2;                                           // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line5_1;                                           // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line5_2;                                           // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line6_1;                                           // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line6_2;                                           // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_WeaponUpgrade_CircleGauge3_C">();
	}
	static class UMainMenu_WeaponUpgrade_CircleGauge3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_WeaponUpgrade_CircleGauge3_C>();
	}
};
static_assert(alignof(UMainMenu_WeaponUpgrade_CircleGauge3_C) == 0x000008, "Wrong alignment on UMainMenu_WeaponUpgrade_CircleGauge3_C");
static_assert(sizeof(UMainMenu_WeaponUpgrade_CircleGauge3_C) == 0x0005B8, "Wrong size on UMainMenu_WeaponUpgrade_CircleGauge3_C");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Base1) == 0x000498, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Base1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Base2) == 0x0004A0, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Base2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Base_Frame1) == 0x0004A8, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Base_Frame1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, BaseSp) == 0x0004B0, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::BaseSp' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, BaseSpFrame) == 0x0004B8, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::BaseSpFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Dot2_1) == 0x0004C0, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Dot2_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Dot2_2) == 0x0004C8, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Dot2_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, dot3_1) == 0x0004D0, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::dot3_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, dot3_2) == 0x0004D8, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::dot3_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Dot4_1) == 0x0004E0, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Dot4_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Dot4_2) == 0x0004E8, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Dot4_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Dot5_1) == 0x0004F0, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Dot5_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Dot5_2) == 0x0004F8, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Dot5_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Dot6_1) == 0x000500, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Dot6_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Dot6_2) == 0x000508, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Dot6_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, DotFrame2) == 0x000510, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::DotFrame2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, DotFrame3) == 0x000518, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::DotFrame3' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, DotFrame4) == 0x000520, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::DotFrame4' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, DotFrame5) == 0x000528, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::DotFrame5' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, DotFrame6) == 0x000530, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::DotFrame6' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, EndImage_5) == 0x000538, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::EndImage_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Img_Level_BG) == 0x000540, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Img_Level_BG' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Img_Slash_2) == 0x000548, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Img_Slash_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Img_Slash_3) == 0x000550, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Img_Slash_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Img_Slash_4) == 0x000558, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Img_Slash_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Img_Slash_5) == 0x000560, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Img_Slash_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Line2_1) == 0x000568, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Line2_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Line2_2) == 0x000570, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Line2_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Line3_1) == 0x000578, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Line3_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Line3_2) == 0x000580, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Line3_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Line4_1) == 0x000588, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Line4_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Line4_2) == 0x000590, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Line4_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Line5_1) == 0x000598, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Line5_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Line5_2) == 0x0005A0, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Line5_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Line6_1) == 0x0005A8, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Line6_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge3_C, Line6_2) == 0x0005B0, "Member 'UMainMenu_WeaponUpgrade_CircleGauge3_C::Line6_2' has a wrong offset!");

}

