#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Craft_Popup

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Craft_Popup.MainMenu_Craft_Popup_C
// 0x0090 (0x0478 - 0x03E8)
class UMainMenu_Craft_Popup_C final : public UEndItemCraftPopupWindow
{
public:
	class UWidgetAnimation*                       In;                                                // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GetRecipeOnly;                                     // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              BG_LevelRelease;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Circle1;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Circle2;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Circle3;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Circle4;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Circle5;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco1;                                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco2;                                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_36;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_251;                                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1;                                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_1;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_2;                                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2;                                             // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LineRight;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LineRight_1;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Craft_Popup_C">();
	}
	static class UMainMenu_Craft_Popup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Craft_Popup_C>();
	}
};
static_assert(alignof(UMainMenu_Craft_Popup_C) == 0x000008, "Wrong alignment on UMainMenu_Craft_Popup_C");
static_assert(sizeof(UMainMenu_Craft_Popup_C) == 0x000478, "Wrong size on UMainMenu_Craft_Popup_C");
static_assert(offsetof(UMainMenu_Craft_Popup_C, In) == 0x0003E8, "Member 'UMainMenu_Craft_Popup_C::In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, GetRecipeOnly) == 0x0003F0, "Member 'UMainMenu_Craft_Popup_C::GetRecipeOnly' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, BG_LevelRelease) == 0x0003F8, "Member 'UMainMenu_Craft_Popup_C::BG_LevelRelease' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, Circle1) == 0x000400, "Member 'UMainMenu_Craft_Popup_C::Circle1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, Circle2) == 0x000408, "Member 'UMainMenu_Craft_Popup_C::Circle2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, Circle3) == 0x000410, "Member 'UMainMenu_Craft_Popup_C::Circle3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, Circle4) == 0x000418, "Member 'UMainMenu_Craft_Popup_C::Circle4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, Circle5) == 0x000420, "Member 'UMainMenu_Craft_Popup_C::Circle5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, Deco1) == 0x000428, "Member 'UMainMenu_Craft_Popup_C::Deco1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, Deco2) == 0x000430, "Member 'UMainMenu_Craft_Popup_C::Deco2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, EndImage_36) == 0x000438, "Member 'UMainMenu_Craft_Popup_C::EndImage_36' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, EndImage_251) == 0x000440, "Member 'UMainMenu_Craft_Popup_C::EndImage_251' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, Line1) == 0x000448, "Member 'UMainMenu_Craft_Popup_C::Line1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, Line1_1) == 0x000450, "Member 'UMainMenu_Craft_Popup_C::Line1_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, Line1_2) == 0x000458, "Member 'UMainMenu_Craft_Popup_C::Line1_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, Line2) == 0x000460, "Member 'UMainMenu_Craft_Popup_C::Line2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, LineRight) == 0x000468, "Member 'UMainMenu_Craft_Popup_C::LineRight' has a wrong offset!");
static_assert(offsetof(UMainMenu_Craft_Popup_C, LineRight_1) == 0x000470, "Member 'UMainMenu_Craft_Popup_C::LineRight_1' has a wrong offset!");

}

