#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_CardCursor

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_CardCursor.MainMenu_Card_CardCursor_C
// 0x0018 (0x03E0 - 0x03C8)
class UMainMenu_Card_CardCursor_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Hover;                                             // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_Cursor_1;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CursorFrame;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_CardCursor_C">();
	}
	static class UMainMenu_Card_CardCursor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_CardCursor_C>();
	}
};
static_assert(alignof(UMainMenu_Card_CardCursor_C) == 0x000008, "Wrong alignment on UMainMenu_Card_CardCursor_C");
static_assert(sizeof(UMainMenu_Card_CardCursor_C) == 0x0003E0, "Wrong size on UMainMenu_Card_CardCursor_C");
static_assert(offsetof(UMainMenu_Card_CardCursor_C, Hover) == 0x0003C8, "Member 'UMainMenu_Card_CardCursor_C::Hover' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardCursor_C, Img_Cursor_1) == 0x0003D0, "Member 'UMainMenu_Card_CardCursor_C::Img_Cursor_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_CardCursor_C, Img_CursorFrame) == 0x0003D8, "Member 'UMainMenu_Card_CardCursor_C::Img_CursorFrame' has a wrong offset!");

}

