#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Item_SelectList2

#include "Basic.hpp"


namespace SDK::Params
{

// Function MainMenu_Item_SelectList2.MainMenu_Item_SelectList2_C.ExecuteUbergraph_MainMenu_Item_SelectList2
// 0x0020 (0x0020 - 0x0000)
struct MainMenu_Item_SelectList2_C_ExecuteUbergraph_MainMenu_Item_SelectList2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetCursorWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEndUserWidget*                         K2Node_DynamicCast_AsEnd_User_Widget;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_Item_SelectList2_C_ExecuteUbergraph_MainMenu_Item_SelectList2) == 0x000008, "Wrong alignment on MainMenu_Item_SelectList2_C_ExecuteUbergraph_MainMenu_Item_SelectList2");
static_assert(sizeof(MainMenu_Item_SelectList2_C_ExecuteUbergraph_MainMenu_Item_SelectList2) == 0x000020, "Wrong size on MainMenu_Item_SelectList2_C_ExecuteUbergraph_MainMenu_Item_SelectList2");
static_assert(offsetof(MainMenu_Item_SelectList2_C_ExecuteUbergraph_MainMenu_Item_SelectList2, EntryPoint) == 0x000000, "Member 'MainMenu_Item_SelectList2_C_ExecuteUbergraph_MainMenu_Item_SelectList2::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_Item_SelectList2_C_ExecuteUbergraph_MainMenu_Item_SelectList2, CallFunc_GetCursorWidget_ReturnValue) == 0x000008, "Member 'MainMenu_Item_SelectList2_C_ExecuteUbergraph_MainMenu_Item_SelectList2::CallFunc_GetCursorWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_Item_SelectList2_C_ExecuteUbergraph_MainMenu_Item_SelectList2, K2Node_DynamicCast_AsEnd_User_Widget) == 0x000010, "Member 'MainMenu_Item_SelectList2_C_ExecuteUbergraph_MainMenu_Item_SelectList2::K2Node_DynamicCast_AsEnd_User_Widget' has a wrong offset!");
static_assert(offsetof(MainMenu_Item_SelectList2_C_ExecuteUbergraph_MainMenu_Item_SelectList2, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'MainMenu_Item_SelectList2_C_ExecuteUbergraph_MainMenu_Item_SelectList2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainMenu_Item_SelectList2_C_ExecuteUbergraph_MainMenu_Item_SelectList2, CallFunc_PlayAnimationByName_ReturnValue) == 0x000019, "Member 'MainMenu_Item_SelectList2_C_ExecuteUbergraph_MainMenu_Item_SelectList2::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");

}

