#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Magic_Top2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Magic_Top2.MainMenu_Magic_Top2_C
// 0x0038 (0x0538 - 0x0500)
class UMainMenu_Magic_Top2_C final : public UEndMainMagicMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       SelectMember_In;                                   // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus_Change;                                      // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Bg_1;                                              // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_Left;                                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DetailBg;                                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_Magic_Top2(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Magic_Top2_C">();
	}
	static class UMainMenu_Magic_Top2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Magic_Top2_C>();
	}
};
static_assert(alignof(UMainMenu_Magic_Top2_C) == 0x000008, "Wrong alignment on UMainMenu_Magic_Top2_C");
static_assert(sizeof(UMainMenu_Magic_Top2_C) == 0x000538, "Wrong size on UMainMenu_Magic_Top2_C");
static_assert(offsetof(UMainMenu_Magic_Top2_C, UberGraphFrame) == 0x000500, "Member 'UMainMenu_Magic_Top2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Magic_Top2_C, SelectMember_In) == 0x000508, "Member 'UMainMenu_Magic_Top2_C::SelectMember_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Magic_Top2_C, Focus_Change) == 0x000510, "Member 'UMainMenu_Magic_Top2_C::Focus_Change' has a wrong offset!");
static_assert(offsetof(UMainMenu_Magic_Top2_C, Menu_In) == 0x000518, "Member 'UMainMenu_Magic_Top2_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Magic_Top2_C, Bg_1) == 0x000520, "Member 'UMainMenu_Magic_Top2_C::Bg_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Magic_Top2_C, Bg_Left) == 0x000528, "Member 'UMainMenu_Magic_Top2_C::Bg_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_Magic_Top2_C, DetailBg) == 0x000530, "Member 'UMainMenu_Magic_Top2_C::DetailBg' has a wrong offset!");

}

