#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_WeaponUpgrade_Top2

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_WeaponUpgrade_Top2.MainMenu_WeaponUpgrade_Top2_C
// 0x0070 (0x06E8 - 0x0678)
class UMainMenu_WeaponUpgrade_Top2_C final : public UEndMainWeaponUpgradeMenu
{
public:
	class UWidgetAnimation*                       Menu_In;                                           // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SkillList_In;                                      // 0x0680(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMainMenu_CategoryChangeBtn_C*          CategoryChangeBtn;                                 // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_WeaponUpgrade_CircleGauge2_C* CircleGauge;                                       // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_WeaponUpgrade_CircleGaugeSmall_C* CircleGaugeSmall;                                  // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot_BottomLeft;                                    // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot_BottomRight;                                   // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_05_C*              EquipCell_Top;                                     // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_WeaponUpgrade_Info2_C*        info2;                                             // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Bottom;                                       // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Foot_C*                       MainMenu_Foot;                                     // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_WeaponUpgrade_SelectMenu_C*   SelectMenu;                                        // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_WeaponUpgrade_SkillList2_C*   SkillList;                                         // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_WeaponUpgrade_Top2_C">();
	}
	static class UMainMenu_WeaponUpgrade_Top2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_WeaponUpgrade_Top2_C>();
	}
};
static_assert(alignof(UMainMenu_WeaponUpgrade_Top2_C) == 0x000008, "Wrong alignment on UMainMenu_WeaponUpgrade_Top2_C");
static_assert(sizeof(UMainMenu_WeaponUpgrade_Top2_C) == 0x0006E8, "Wrong size on UMainMenu_WeaponUpgrade_Top2_C");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Top2_C, Menu_In) == 0x000678, "Member 'UMainMenu_WeaponUpgrade_Top2_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Top2_C, SkillList_In) == 0x000680, "Member 'UMainMenu_WeaponUpgrade_Top2_C::SkillList_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Top2_C, CategoryChangeBtn) == 0x000688, "Member 'UMainMenu_WeaponUpgrade_Top2_C::CategoryChangeBtn' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Top2_C, CircleGauge) == 0x000690, "Member 'UMainMenu_WeaponUpgrade_Top2_C::CircleGauge' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Top2_C, CircleGaugeSmall) == 0x000698, "Member 'UMainMenu_WeaponUpgrade_Top2_C::CircleGaugeSmall' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Top2_C, Dot_BottomLeft) == 0x0006A0, "Member 'UMainMenu_WeaponUpgrade_Top2_C::Dot_BottomLeft' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Top2_C, Dot_BottomRight) == 0x0006A8, "Member 'UMainMenu_WeaponUpgrade_Top2_C::Dot_BottomRight' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Top2_C, EquipCell_Top) == 0x0006B0, "Member 'UMainMenu_WeaponUpgrade_Top2_C::EquipCell_Top' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Top2_C, info2) == 0x0006B8, "Member 'UMainMenu_WeaponUpgrade_Top2_C::info2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Top2_C, Line) == 0x0006C0, "Member 'UMainMenu_WeaponUpgrade_Top2_C::Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Top2_C, Line_Bottom) == 0x0006C8, "Member 'UMainMenu_WeaponUpgrade_Top2_C::Line_Bottom' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Top2_C, MainMenu_Foot) == 0x0006D0, "Member 'UMainMenu_WeaponUpgrade_Top2_C::MainMenu_Foot' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Top2_C, SelectMenu) == 0x0006D8, "Member 'UMainMenu_WeaponUpgrade_Top2_C::SelectMenu' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Top2_C, SkillList) == 0x0006E0, "Member 'UMainMenu_WeaponUpgrade_Top2_C::SkillList' has a wrong offset!");

}

