#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_List

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_List.MainMenu_Card_List_C
// 0x00C8 (0x04E0 - 0x0418)
class UMainMenu_Card_List_C final : public UEndCardListWindow
{
public:
	class UWidgetAnimation*                       Btn_Inactive;                                      // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CardList_Inactive;                                 // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CardList_Active;                                   // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CardList_Enemy;                                    // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CardList_Player;                                   // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              EndImage_152;                                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Card;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Arrow;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_1;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_2;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_01;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnBg;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_01;                                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_02;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_03;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_04;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_EnemyName_Base;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Icon;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Light;                                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_NumberBg;                                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_ScrBarBg;                                      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_TitleBg;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Card_CardInformation_C*       Information;                                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_NoCard;                                        // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_List_C">();
	}
	static class UMainMenu_Card_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_List_C>();
	}
};
static_assert(alignof(UMainMenu_Card_List_C) == 0x000008, "Wrong alignment on UMainMenu_Card_List_C");
static_assert(sizeof(UMainMenu_Card_List_C) == 0x0004E0, "Wrong size on UMainMenu_Card_List_C");
static_assert(offsetof(UMainMenu_Card_List_C, Btn_Inactive) == 0x000418, "Member 'UMainMenu_Card_List_C::Btn_Inactive' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, CardList_Inactive) == 0x000420, "Member 'UMainMenu_Card_List_C::CardList_Inactive' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, CardList_Active) == 0x000428, "Member 'UMainMenu_Card_List_C::CardList_Active' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, CardList_Enemy) == 0x000430, "Member 'UMainMenu_Card_List_C::CardList_Enemy' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, CardList_Player) == 0x000438, "Member 'UMainMenu_Card_List_C::CardList_Player' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, EndImage_152) == 0x000440, "Member 'UMainMenu_Card_List_C::EndImage_152' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Icon_Card) == 0x000448, "Member 'UMainMenu_Card_List_C::Icon_Card' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_Arrow) == 0x000450, "Member 'UMainMenu_Card_List_C::Img_Arrow' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_Base) == 0x000458, "Member 'UMainMenu_Card_List_C::Img_Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_Base_1) == 0x000460, "Member 'UMainMenu_Card_List_C::Img_Base_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_Base_2) == 0x000468, "Member 'UMainMenu_Card_List_C::Img_Base_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_Base_01) == 0x000470, "Member 'UMainMenu_Card_List_C::Img_Base_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_BtnBg) == 0x000478, "Member 'UMainMenu_Card_List_C::Img_BtnBg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_CornerDeco_01) == 0x000480, "Member 'UMainMenu_Card_List_C::Img_CornerDeco_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_CornerDeco_02) == 0x000488, "Member 'UMainMenu_Card_List_C::Img_CornerDeco_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_CornerDeco_03) == 0x000490, "Member 'UMainMenu_Card_List_C::Img_CornerDeco_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_CornerDeco_04) == 0x000498, "Member 'UMainMenu_Card_List_C::Img_CornerDeco_04' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_EnemyName_Base) == 0x0004A0, "Member 'UMainMenu_Card_List_C::Img_EnemyName_Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_Icon) == 0x0004A8, "Member 'UMainMenu_Card_List_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_Light) == 0x0004B0, "Member 'UMainMenu_Card_List_C::Img_Light' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_NumberBg) == 0x0004B8, "Member 'UMainMenu_Card_List_C::Img_NumberBg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_ScrBarBg) == 0x0004C0, "Member 'UMainMenu_Card_List_C::Img_ScrBarBg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Img_TitleBg) == 0x0004C8, "Member 'UMainMenu_Card_List_C::Img_TitleBg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Information) == 0x0004D0, "Member 'UMainMenu_Card_List_C::Information' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_List_C, Txt_NoCard) == 0x0004D8, "Member 'UMainMenu_Card_List_C::Txt_NoCard' has a wrong offset!");

}

