#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_System_BgLeft

#include "Basic.hpp"


namespace SDK::Params
{

// Function MainMenu_System_BgLeft.MainMenu_System_BgLeft_C.ExecuteUbergraph_MainMenu_System_BgLeft
// 0x0008 (0x0008 - 0x0000)
struct MainMenu_System_BgLeft_C_ExecuteUbergraph_MainMenu_System_BgLeft final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_2;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_System_BgLeft_C_ExecuteUbergraph_MainMenu_System_BgLeft) == 0x000004, "Wrong alignment on MainMenu_System_BgLeft_C_ExecuteUbergraph_MainMenu_System_BgLeft");
static_assert(sizeof(MainMenu_System_BgLeft_C_ExecuteUbergraph_MainMenu_System_BgLeft) == 0x000008, "Wrong size on MainMenu_System_BgLeft_C_ExecuteUbergraph_MainMenu_System_BgLeft");
static_assert(offsetof(MainMenu_System_BgLeft_C_ExecuteUbergraph_MainMenu_System_BgLeft, EntryPoint) == 0x000000, "Member 'MainMenu_System_BgLeft_C_ExecuteUbergraph_MainMenu_System_BgLeft::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_System_BgLeft_C_ExecuteUbergraph_MainMenu_System_BgLeft, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'MainMenu_System_BgLeft_C_ExecuteUbergraph_MainMenu_System_BgLeft::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_System_BgLeft_C_ExecuteUbergraph_MainMenu_System_BgLeft, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000005, "Member 'MainMenu_System_BgLeft_C_ExecuteUbergraph_MainMenu_System_BgLeft::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_System_BgLeft_C_ExecuteUbergraph_MainMenu_System_BgLeft, CallFunc_PlayAnimationByName_ReturnValue_2) == 0x000006, "Member 'MainMenu_System_BgLeft_C_ExecuteUbergraph_MainMenu_System_BgLeft::CallFunc_PlayAnimationByName_ReturnValue_2' has a wrong offset!");

}

