#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_LeftMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_LeftMenu.MainMenu_LeftMenu_C
// 0x0048 (0x0410 - 0x03C8)
class UMainMenu_LeftMenu_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UEndImage*                              BtnBase1;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase2;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnFrame1;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnFrame2;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FieldLeader;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   LeftMenu_ScrollBox;                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_BattleLeaderBtn;                               // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_MemberChange;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_LeftMenu(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_LeftMenu_C">();
	}
	static class UMainMenu_LeftMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_LeftMenu_C>();
	}
};
static_assert(alignof(UMainMenu_LeftMenu_C) == 0x000008, "Wrong alignment on UMainMenu_LeftMenu_C");
static_assert(sizeof(UMainMenu_LeftMenu_C) == 0x000410, "Wrong size on UMainMenu_LeftMenu_C");
static_assert(offsetof(UMainMenu_LeftMenu_C, UberGraphFrame) == 0x0003C8, "Member 'UMainMenu_LeftMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_LeftMenu_C, BtnBase1) == 0x0003D0, "Member 'UMainMenu_LeftMenu_C::BtnBase1' has a wrong offset!");
static_assert(offsetof(UMainMenu_LeftMenu_C, BtnBase2) == 0x0003D8, "Member 'UMainMenu_LeftMenu_C::BtnBase2' has a wrong offset!");
static_assert(offsetof(UMainMenu_LeftMenu_C, BtnFrame1) == 0x0003E0, "Member 'UMainMenu_LeftMenu_C::BtnFrame1' has a wrong offset!");
static_assert(offsetof(UMainMenu_LeftMenu_C, BtnFrame2) == 0x0003E8, "Member 'UMainMenu_LeftMenu_C::BtnFrame2' has a wrong offset!");
static_assert(offsetof(UMainMenu_LeftMenu_C, FieldLeader) == 0x0003F0, "Member 'UMainMenu_LeftMenu_C::FieldLeader' has a wrong offset!");
static_assert(offsetof(UMainMenu_LeftMenu_C, LeftMenu_ScrollBox) == 0x0003F8, "Member 'UMainMenu_LeftMenu_C::LeftMenu_ScrollBox' has a wrong offset!");
static_assert(offsetof(UMainMenu_LeftMenu_C, Txt_BattleLeaderBtn) == 0x000400, "Member 'UMainMenu_LeftMenu_C::Txt_BattleLeaderBtn' has a wrong offset!");
static_assert(offsetof(UMainMenu_LeftMenu_C, Txt_MemberChange) == 0x000408, "Member 'UMainMenu_LeftMenu_C::Txt_MemberChange' has a wrong offset!");

}

