#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Options_Btn2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Options_Btn2.MainMenu_Options_Btn2_C
// 0x0090 (0x0458 - 0x03C8)
class UMainMenu_Options_Btn2_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Selected;                                          // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Hover;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             BattleSetting_Btn;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBaseLeft;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBaseLeft_1;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBaseLeft_2;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBaseRight;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBaseRight_1;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterLight;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_AbilityName;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_Options_Btn2(int32 EntryPoint);
	void BndEvt__BattleSetting_Btn_K2Node_ComponentBoundEvent_46_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BattleSetting_Btn_K2Node_ComponentBoundEvent_33_OnButtonHoverEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Options_Btn2_C">();
	}
	static class UMainMenu_Options_Btn2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Options_Btn2_C>();
	}
};
static_assert(alignof(UMainMenu_Options_Btn2_C) == 0x000008, "Wrong alignment on UMainMenu_Options_Btn2_C");
static_assert(sizeof(UMainMenu_Options_Btn2_C) == 0x000458, "Wrong size on UMainMenu_Options_Btn2_C");
static_assert(offsetof(UMainMenu_Options_Btn2_C, UberGraphFrame) == 0x0003C8, "Member 'UMainMenu_Options_Btn2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, Selected) == 0x0003D0, "Member 'UMainMenu_Options_Btn2_C::Selected' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, Loop) == 0x0003D8, "Member 'UMainMenu_Options_Btn2_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, BtnHover) == 0x0003E0, "Member 'UMainMenu_Options_Btn2_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, Menu_In) == 0x0003E8, "Member 'UMainMenu_Options_Btn2_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, Base) == 0x0003F0, "Member 'UMainMenu_Options_Btn2_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, Base2) == 0x0003F8, "Member 'UMainMenu_Options_Btn2_C::Base2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, Base_Hover) == 0x000400, "Member 'UMainMenu_Options_Btn2_C::Base_Hover' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, BattleSetting_Btn) == 0x000408, "Member 'UMainMenu_Options_Btn2_C::BattleSetting_Btn' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, BtnBaseLeft) == 0x000410, "Member 'UMainMenu_Options_Btn2_C::BtnBaseLeft' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, BtnBaseLeft_1) == 0x000418, "Member 'UMainMenu_Options_Btn2_C::BtnBaseLeft_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, BtnBaseLeft_2) == 0x000420, "Member 'UMainMenu_Options_Btn2_C::BtnBaseLeft_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, BtnBaseRight) == 0x000428, "Member 'UMainMenu_Options_Btn2_C::BtnBaseRight' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, BtnBaseRight_1) == 0x000430, "Member 'UMainMenu_Options_Btn2_C::BtnBaseRight_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, CenterLight) == 0x000438, "Member 'UMainMenu_Options_Btn2_C::CenterLight' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, Line) == 0x000440, "Member 'UMainMenu_Options_Btn2_C::Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, Txt_AbilityName) == 0x000448, "Member 'UMainMenu_Options_Btn2_C::Txt_AbilityName' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn2_C, Txt_Title) == 0x000450, "Member 'UMainMenu_Options_Btn2_C::Txt_Title' has a wrong offset!");

}

