#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_View

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_View.MainMenu_Card_View_C
// 0x0060 (0x0450 - 0x03F0)
class UMainMenu_Card_View_C final : public UEndCardViewWindow
{
public:
	class UWidgetAnimation*                       CDS;                                               // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMainMenu_Card_CardInformation_C*       CardInfo;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Card;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_01;                                 // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_02;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_03;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_CornerDeco_04;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Power;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Target;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              WindowBg;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_View_C">();
	}
	static class UMainMenu_Card_View_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_View_C>();
	}
};
static_assert(alignof(UMainMenu_Card_View_C) == 0x000008, "Wrong alignment on UMainMenu_Card_View_C");
static_assert(sizeof(UMainMenu_Card_View_C) == 0x000450, "Wrong size on UMainMenu_Card_View_C");
static_assert(offsetof(UMainMenu_Card_View_C, CDS) == 0x0003F0, "Member 'UMainMenu_Card_View_C::CDS' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_View_C, CardInfo) == 0x0003F8, "Member 'UMainMenu_Card_View_C::CardInfo' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_View_C, Img_Base) == 0x000400, "Member 'UMainMenu_Card_View_C::Img_Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_View_C, Img_Card) == 0x000408, "Member 'UMainMenu_Card_View_C::Img_Card' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_View_C, Img_CornerDeco_01) == 0x000410, "Member 'UMainMenu_Card_View_C::Img_CornerDeco_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_View_C, Img_CornerDeco_02) == 0x000418, "Member 'UMainMenu_Card_View_C::Img_CornerDeco_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_View_C, Img_CornerDeco_03) == 0x000420, "Member 'UMainMenu_Card_View_C::Img_CornerDeco_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_View_C, Img_CornerDeco_04) == 0x000428, "Member 'UMainMenu_Card_View_C::Img_CornerDeco_04' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_View_C, Img_Line) == 0x000430, "Member 'UMainMenu_Card_View_C::Img_Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_View_C, Img_Power) == 0x000438, "Member 'UMainMenu_Card_View_C::Img_Power' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_View_C, Img_Target) == 0x000440, "Member 'UMainMenu_Card_View_C::Img_Target' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_View_C, WindowBg) == 0x000448, "Member 'UMainMenu_Card_View_C::WindowBg' has a wrong offset!");

}

