#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_Preset_ListItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Card_Preset_ListItem.MainMenu_Card_Preset_ListItem_C
// 0x0050 (0x0480 - 0x0430)
class UMainMenu_Card_Preset_ListItem_C final : public UEndMainItemSelectBtnText
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Normal;                                            // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gray_BtnHover;                                     // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gray;                                              // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              GrayOut;                                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_New;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BG;                                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line_01;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line_02;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_Card_Preset_ListItem(int32 EntryPoint);
	void BndEvt__SelectBtn_K2Node_ComponentBoundEvent_53_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SelectBtn_K2Node_ComponentBoundEvent_40_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Card_Preset_ListItem_C">();
	}
	static class UMainMenu_Card_Preset_ListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Card_Preset_ListItem_C>();
	}
};
static_assert(alignof(UMainMenu_Card_Preset_ListItem_C) == 0x000008, "Wrong alignment on UMainMenu_Card_Preset_ListItem_C");
static_assert(sizeof(UMainMenu_Card_Preset_ListItem_C) == 0x000480, "Wrong size on UMainMenu_Card_Preset_ListItem_C");
static_assert(offsetof(UMainMenu_Card_Preset_ListItem_C, UberGraphFrame) == 0x000430, "Member 'UMainMenu_Card_Preset_ListItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_ListItem_C, Normal) == 0x000438, "Member 'UMainMenu_Card_Preset_ListItem_C::Normal' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_ListItem_C, Gray_BtnHover) == 0x000440, "Member 'UMainMenu_Card_Preset_ListItem_C::Gray_BtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_ListItem_C, Gray) == 0x000448, "Member 'UMainMenu_Card_Preset_ListItem_C::Gray' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_ListItem_C, BtnHover) == 0x000450, "Member 'UMainMenu_Card_Preset_ListItem_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_ListItem_C, GrayOut) == 0x000458, "Member 'UMainMenu_Card_Preset_ListItem_C::GrayOut' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_ListItem_C, Icon_New) == 0x000460, "Member 'UMainMenu_Card_Preset_ListItem_C::Icon_New' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_ListItem_C, Img_BG) == 0x000468, "Member 'UMainMenu_Card_Preset_ListItem_C::Img_BG' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_ListItem_C, Img_Line_01) == 0x000470, "Member 'UMainMenu_Card_Preset_ListItem_C::Img_Line_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Card_Preset_ListItem_C, Img_Line_02) == 0x000478, "Member 'UMainMenu_Card_Preset_ListItem_C::Img_Line_02' has a wrong offset!");

}

