#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Card_ConfirmBtn

#include "Basic.hpp"


namespace SDK::Params
{

// Function MainMenu_Card_ConfirmBtn.MainMenu_Card_ConfirmBtn_C.ExecuteUbergraph_MainMenu_Card_ConfirmBtn
// 0x0008 (0x0008 - 0x0000)
struct MainMenu_Card_ConfirmBtn_C_ExecuteUbergraph_MainMenu_Card_ConfirmBtn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_2;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_Card_ConfirmBtn_C_ExecuteUbergraph_MainMenu_Card_ConfirmBtn) == 0x000004, "Wrong alignment on MainMenu_Card_ConfirmBtn_C_ExecuteUbergraph_MainMenu_Card_ConfirmBtn");
static_assert(sizeof(MainMenu_Card_ConfirmBtn_C_ExecuteUbergraph_MainMenu_Card_ConfirmBtn) == 0x000008, "Wrong size on MainMenu_Card_ConfirmBtn_C_ExecuteUbergraph_MainMenu_Card_ConfirmBtn");
static_assert(offsetof(MainMenu_Card_ConfirmBtn_C_ExecuteUbergraph_MainMenu_Card_ConfirmBtn, EntryPoint) == 0x000000, "Member 'MainMenu_Card_ConfirmBtn_C_ExecuteUbergraph_MainMenu_Card_ConfirmBtn::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_Card_ConfirmBtn_C_ExecuteUbergraph_MainMenu_Card_ConfirmBtn, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'MainMenu_Card_ConfirmBtn_C_ExecuteUbergraph_MainMenu_Card_ConfirmBtn::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_Card_ConfirmBtn_C_ExecuteUbergraph_MainMenu_Card_ConfirmBtn, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000005, "Member 'MainMenu_Card_ConfirmBtn_C_ExecuteUbergraph_MainMenu_Card_ConfirmBtn::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_Card_ConfirmBtn_C_ExecuteUbergraph_MainMenu_Card_ConfirmBtn, CallFunc_PlayAnimationByName_ReturnValue_2) == 0x000006, "Member 'MainMenu_Card_ConfirmBtn_C_ExecuteUbergraph_MainMenu_Card_ConfirmBtn::CallFunc_PlayAnimationByName_ReturnValue_2' has a wrong offset!");

}

