#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_System_Bg

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_System_Bg.MainMenu_System_Bg_C
// 0x0198 (0x0560 - 0x03C8)
class UMainMenu_System_Bg_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       In;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Zero1;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Zero2;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Zero3;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Zero4;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Zero5;                                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Zero6;                                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Zero7;                                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Zero8;                                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Zero9;                                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              One0;                                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              One1;                                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_3;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_4;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_5;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_6;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_7;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_8;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_9;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_10;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_11;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_12;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_13;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_14;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_15;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_16;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_17;                                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_18;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_19;                                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_20;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_21;                                       // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_22;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_23;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_25;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_26;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_27;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_49;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_96;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_117;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_277;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_386;                                      // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_L;                                            // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_R;                                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MainStar;                                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Shop_Bg3;                                          // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Shop_Bg3_1;                                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_System_Bg(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_System_Bg_C">();
	}
	static class UMainMenu_System_Bg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_System_Bg_C>();
	}
};
static_assert(alignof(UMainMenu_System_Bg_C) == 0x000008, "Wrong alignment on UMainMenu_System_Bg_C");
static_assert(sizeof(UMainMenu_System_Bg_C) == 0x000560, "Wrong size on UMainMenu_System_Bg_C");
static_assert(offsetof(UMainMenu_System_Bg_C, UberGraphFrame) == 0x0003C8, "Member 'UMainMenu_System_Bg_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, In) == 0x0003D0, "Member 'UMainMenu_System_Bg_C::In' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, Zero1) == 0x0003D8, "Member 'UMainMenu_System_Bg_C::Zero1' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, Zero2) == 0x0003E0, "Member 'UMainMenu_System_Bg_C::Zero2' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, Zero3) == 0x0003E8, "Member 'UMainMenu_System_Bg_C::Zero3' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, Zero4) == 0x0003F0, "Member 'UMainMenu_System_Bg_C::Zero4' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, Zero5) == 0x0003F8, "Member 'UMainMenu_System_Bg_C::Zero5' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, Zero6) == 0x000400, "Member 'UMainMenu_System_Bg_C::Zero6' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, Zero7) == 0x000408, "Member 'UMainMenu_System_Bg_C::Zero7' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, Zero8) == 0x000410, "Member 'UMainMenu_System_Bg_C::Zero8' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, Zero9) == 0x000418, "Member 'UMainMenu_System_Bg_C::Zero9' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, One0) == 0x000420, "Member 'UMainMenu_System_Bg_C::One0' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, One1) == 0x000428, "Member 'UMainMenu_System_Bg_C::One1' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, Base) == 0x000430, "Member 'UMainMenu_System_Bg_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage) == 0x000438, "Member 'UMainMenu_System_Bg_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_1) == 0x000440, "Member 'UMainMenu_System_Bg_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_2) == 0x000448, "Member 'UMainMenu_System_Bg_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_3) == 0x000450, "Member 'UMainMenu_System_Bg_C::EndImage_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_4) == 0x000458, "Member 'UMainMenu_System_Bg_C::EndImage_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_5) == 0x000460, "Member 'UMainMenu_System_Bg_C::EndImage_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_6) == 0x000468, "Member 'UMainMenu_System_Bg_C::EndImage_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_7) == 0x000470, "Member 'UMainMenu_System_Bg_C::EndImage_7' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_8) == 0x000478, "Member 'UMainMenu_System_Bg_C::EndImage_8' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_9) == 0x000480, "Member 'UMainMenu_System_Bg_C::EndImage_9' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_10) == 0x000488, "Member 'UMainMenu_System_Bg_C::EndImage_10' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_11) == 0x000490, "Member 'UMainMenu_System_Bg_C::EndImage_11' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_12) == 0x000498, "Member 'UMainMenu_System_Bg_C::EndImage_12' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_13) == 0x0004A0, "Member 'UMainMenu_System_Bg_C::EndImage_13' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_14) == 0x0004A8, "Member 'UMainMenu_System_Bg_C::EndImage_14' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_15) == 0x0004B0, "Member 'UMainMenu_System_Bg_C::EndImage_15' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_16) == 0x0004B8, "Member 'UMainMenu_System_Bg_C::EndImage_16' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_17) == 0x0004C0, "Member 'UMainMenu_System_Bg_C::EndImage_17' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_18) == 0x0004C8, "Member 'UMainMenu_System_Bg_C::EndImage_18' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_19) == 0x0004D0, "Member 'UMainMenu_System_Bg_C::EndImage_19' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_20) == 0x0004D8, "Member 'UMainMenu_System_Bg_C::EndImage_20' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_21) == 0x0004E0, "Member 'UMainMenu_System_Bg_C::EndImage_21' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_22) == 0x0004E8, "Member 'UMainMenu_System_Bg_C::EndImage_22' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_23) == 0x0004F0, "Member 'UMainMenu_System_Bg_C::EndImage_23' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_25) == 0x0004F8, "Member 'UMainMenu_System_Bg_C::EndImage_25' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_26) == 0x000500, "Member 'UMainMenu_System_Bg_C::EndImage_26' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_27) == 0x000508, "Member 'UMainMenu_System_Bg_C::EndImage_27' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_49) == 0x000510, "Member 'UMainMenu_System_Bg_C::EndImage_49' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_96) == 0x000518, "Member 'UMainMenu_System_Bg_C::EndImage_96' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_117) == 0x000520, "Member 'UMainMenu_System_Bg_C::EndImage_117' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_277) == 0x000528, "Member 'UMainMenu_System_Bg_C::EndImage_277' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, EndImage_386) == 0x000530, "Member 'UMainMenu_System_Bg_C::EndImage_386' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, Line_L) == 0x000538, "Member 'UMainMenu_System_Bg_C::Line_L' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, Line_R) == 0x000540, "Member 'UMainMenu_System_Bg_C::Line_R' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, MainStar) == 0x000548, "Member 'UMainMenu_System_Bg_C::MainStar' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, Shop_Bg3) == 0x000550, "Member 'UMainMenu_System_Bg_C::Shop_Bg3' has a wrong offset!");
static_assert(offsetof(UMainMenu_System_Bg_C, Shop_Bg3_1) == 0x000558, "Member 'UMainMenu_System_Bg_C::Shop_Bg3_1' has a wrong offset!");

}

