#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_Cursor

#include "Basic.hpp"


namespace SDK::Params
{

// Function Map_Cursor.Map_Cursor_C.ExecuteUbergraph_Map_Cursor
// 0x0008 (0x0008 - 0x0000)
struct Map_Cursor_C_ExecuteUbergraph_Map_Cursor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Map_Cursor_C_ExecuteUbergraph_Map_Cursor) == 0x000004, "Wrong alignment on Map_Cursor_C_ExecuteUbergraph_Map_Cursor");
static_assert(sizeof(Map_Cursor_C_ExecuteUbergraph_Map_Cursor) == 0x000008, "Wrong size on Map_Cursor_C_ExecuteUbergraph_Map_Cursor");
static_assert(offsetof(Map_Cursor_C_ExecuteUbergraph_Map_Cursor, EntryPoint) == 0x000000, "Member 'Map_Cursor_C_ExecuteUbergraph_Map_Cursor::EntryPoint' has a wrong offset!");
static_assert(offsetof(Map_Cursor_C_ExecuteUbergraph_Map_Cursor, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'Map_Cursor_C_ExecuteUbergraph_Map_Cursor::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Map_Cursor_C_ExecuteUbergraph_Map_Cursor, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000005, "Member 'Map_Cursor_C_ExecuteUbergraph_Map_Cursor::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");

}

