#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_LeftMenuCell

#include "Basic.hpp"


namespace SDK::Params
{

// Function Map_LeftMenuCell.Map_LeftMenuCell_C.ExecuteUbergraph_Map_LeftMenuCell
// 0x0008 (0x0008 - 0x0000)
struct Map_LeftMenuCell_C_ExecuteUbergraph_Map_LeftMenuCell final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_2;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Map_LeftMenuCell_C_ExecuteUbergraph_Map_LeftMenuCell) == 0x000004, "Wrong alignment on Map_LeftMenuCell_C_ExecuteUbergraph_Map_LeftMenuCell");
static_assert(sizeof(Map_LeftMenuCell_C_ExecuteUbergraph_Map_LeftMenuCell) == 0x000008, "Wrong size on Map_LeftMenuCell_C_ExecuteUbergraph_Map_LeftMenuCell");
static_assert(offsetof(Map_LeftMenuCell_C_ExecuteUbergraph_Map_LeftMenuCell, EntryPoint) == 0x000000, "Member 'Map_LeftMenuCell_C_ExecuteUbergraph_Map_LeftMenuCell::EntryPoint' has a wrong offset!");
static_assert(offsetof(Map_LeftMenuCell_C_ExecuteUbergraph_Map_LeftMenuCell, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'Map_LeftMenuCell_C_ExecuteUbergraph_Map_LeftMenuCell::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Map_LeftMenuCell_C_ExecuteUbergraph_Map_LeftMenuCell, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000005, "Member 'Map_LeftMenuCell_C_ExecuteUbergraph_Map_LeftMenuCell::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Map_LeftMenuCell_C_ExecuteUbergraph_Map_LeftMenuCell, CallFunc_PlayAnimationByName_ReturnValue_2) == 0x000006, "Member 'Map_LeftMenuCell_C_ExecuteUbergraph_Map_LeftMenuCell::CallFunc_PlayAnimationByName_ReturnValue_2' has a wrong offset!");

}

