#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_Range

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Map_Range.Map_Range_C
// 0x0018 (0x03E0 - 0x03C8)
class UMap_Range_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Sub;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Main;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCircle*                             Range;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Map_Range_C">();
	}
	static class UMap_Range_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMap_Range_C>();
	}
};
static_assert(alignof(UMap_Range_C) == 0x000008, "Wrong alignment on UMap_Range_C");
static_assert(sizeof(UMap_Range_C) == 0x0003E0, "Wrong size on UMap_Range_C");
static_assert(offsetof(UMap_Range_C, Sub) == 0x0003C8, "Member 'UMap_Range_C::Sub' has a wrong offset!");
static_assert(offsetof(UMap_Range_C, Main) == 0x0003D0, "Member 'UMap_Range_C::Main' has a wrong offset!");
static_assert(offsetof(UMap_Range_C, Range) == 0x0003D8, "Member 'UMap_Range_C::Range' has a wrong offset!");

}

