#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_ReleaseEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Map_ReleaseEffect.Map_ReleaseEffect_C
// 0x0078 (0x0440 - 0x03C8)
class UMap_ReleaseEffect_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       ReleaseEffect;                                     // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              eff_Flash;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Effect;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Effect2;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Effect3;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Effect4;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00_2;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01_2;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_02;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_02_2;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_03;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_03_2;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Map_ReleaseEffect(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Map_ReleaseEffect_C">();
	}
	static class UMap_ReleaseEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMap_ReleaseEffect_C>();
	}
};
static_assert(alignof(UMap_ReleaseEffect_C) == 0x000008, "Wrong alignment on UMap_ReleaseEffect_C");
static_assert(sizeof(UMap_ReleaseEffect_C) == 0x000440, "Wrong size on UMap_ReleaseEffect_C");
static_assert(offsetof(UMap_ReleaseEffect_C, UberGraphFrame) == 0x0003C8, "Member 'UMap_ReleaseEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMap_ReleaseEffect_C, ReleaseEffect) == 0x0003D0, "Member 'UMap_ReleaseEffect_C::ReleaseEffect' has a wrong offset!");
static_assert(offsetof(UMap_ReleaseEffect_C, eff_Flash) == 0x0003D8, "Member 'UMap_ReleaseEffect_C::eff_Flash' has a wrong offset!");
static_assert(offsetof(UMap_ReleaseEffect_C, Icon_Effect) == 0x0003E0, "Member 'UMap_ReleaseEffect_C::Icon_Effect' has a wrong offset!");
static_assert(offsetof(UMap_ReleaseEffect_C, Icon_Effect2) == 0x0003E8, "Member 'UMap_ReleaseEffect_C::Icon_Effect2' has a wrong offset!");
static_assert(offsetof(UMap_ReleaseEffect_C, Icon_Effect3) == 0x0003F0, "Member 'UMap_ReleaseEffect_C::Icon_Effect3' has a wrong offset!");
static_assert(offsetof(UMap_ReleaseEffect_C, Icon_Effect4) == 0x0003F8, "Member 'UMap_ReleaseEffect_C::Icon_Effect4' has a wrong offset!");
static_assert(offsetof(UMap_ReleaseEffect_C, Img_Effect_00) == 0x000400, "Member 'UMap_ReleaseEffect_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UMap_ReleaseEffect_C, Img_Effect_00_2) == 0x000408, "Member 'UMap_ReleaseEffect_C::Img_Effect_00_2' has a wrong offset!");
static_assert(offsetof(UMap_ReleaseEffect_C, Img_Effect_01) == 0x000410, "Member 'UMap_ReleaseEffect_C::Img_Effect_01' has a wrong offset!");
static_assert(offsetof(UMap_ReleaseEffect_C, Img_Effect_01_2) == 0x000418, "Member 'UMap_ReleaseEffect_C::Img_Effect_01_2' has a wrong offset!");
static_assert(offsetof(UMap_ReleaseEffect_C, Img_Effect_02) == 0x000420, "Member 'UMap_ReleaseEffect_C::Img_Effect_02' has a wrong offset!");
static_assert(offsetof(UMap_ReleaseEffect_C, Img_Effect_02_2) == 0x000428, "Member 'UMap_ReleaseEffect_C::Img_Effect_02_2' has a wrong offset!");
static_assert(offsetof(UMap_ReleaseEffect_C, Img_Effect_03) == 0x000430, "Member 'UMap_ReleaseEffect_C::Img_Effect_03' has a wrong offset!");
static_assert(offsetof(UMap_ReleaseEffect_C, Img_Effect_03_2) == 0x000438, "Member 'UMap_ReleaseEffect_C::Img_Effect_03_2' has a wrong offset!");

}

