#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_AreaInfoListItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Map_AreaInfoListItem.Map_AreaInfoListItem_C
// 0x0080 (0x04B0 - 0x0430)
class UMap_AreaInfoListItem_C final : public UEndMainItemSelectBtnText
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Complete;                                          // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unreleased;                                        // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_1;                                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_3;                                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_86;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Clear;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Complete;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_NaviMap_C*                        Icon_NaviMap;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Report;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Title;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_MissionValue;                                  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ReportTitle;                                   // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Map_AreaInfoListItem(int32 EntryPoint);
	void BndEvt__SelectBtn_K2Node_ComponentBoundEvent_53_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SelectBtn_K2Node_ComponentBoundEvent_40_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Map_AreaInfoListItem_C">();
	}
	static class UMap_AreaInfoListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMap_AreaInfoListItem_C>();
	}
};
static_assert(alignof(UMap_AreaInfoListItem_C) == 0x000008, "Wrong alignment on UMap_AreaInfoListItem_C");
static_assert(sizeof(UMap_AreaInfoListItem_C) == 0x0004B0, "Wrong size on UMap_AreaInfoListItem_C");
static_assert(offsetof(UMap_AreaInfoListItem_C, UberGraphFrame) == 0x000430, "Member 'UMap_AreaInfoListItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMap_AreaInfoListItem_C, Complete) == 0x000438, "Member 'UMap_AreaInfoListItem_C::Complete' has a wrong offset!");
static_assert(offsetof(UMap_AreaInfoListItem_C, Unreleased) == 0x000440, "Member 'UMap_AreaInfoListItem_C::Unreleased' has a wrong offset!");
static_assert(offsetof(UMap_AreaInfoListItem_C, Normal) == 0x000448, "Member 'UMap_AreaInfoListItem_C::Normal' has a wrong offset!");
static_assert(offsetof(UMap_AreaInfoListItem_C, Base) == 0x000450, "Member 'UMap_AreaInfoListItem_C::Base' has a wrong offset!");
static_assert(offsetof(UMap_AreaInfoListItem_C, Base1) == 0x000458, "Member 'UMap_AreaInfoListItem_C::Base1' has a wrong offset!");
static_assert(offsetof(UMap_AreaInfoListItem_C, Base1_1) == 0x000460, "Member 'UMap_AreaInfoListItem_C::Base1_1' has a wrong offset!");
static_assert(offsetof(UMap_AreaInfoListItem_C, Base1_3) == 0x000468, "Member 'UMap_AreaInfoListItem_C::Base1_3' has a wrong offset!");
static_assert(offsetof(UMap_AreaInfoListItem_C, EndImage_86) == 0x000470, "Member 'UMap_AreaInfoListItem_C::EndImage_86' has a wrong offset!");
static_assert(offsetof(UMap_AreaInfoListItem_C, Icon_Clear) == 0x000478, "Member 'UMap_AreaInfoListItem_C::Icon_Clear' has a wrong offset!");
static_assert(offsetof(UMap_AreaInfoListItem_C, Icon_Complete) == 0x000480, "Member 'UMap_AreaInfoListItem_C::Icon_Complete' has a wrong offset!");
static_assert(offsetof(UMap_AreaInfoListItem_C, Icon_NaviMap) == 0x000488, "Member 'UMap_AreaInfoListItem_C::Icon_NaviMap' has a wrong offset!");
static_assert(offsetof(UMap_AreaInfoListItem_C, Icon_Report) == 0x000490, "Member 'UMap_AreaInfoListItem_C::Icon_Report' has a wrong offset!");
static_assert(offsetof(UMap_AreaInfoListItem_C, Icon_Title) == 0x000498, "Member 'UMap_AreaInfoListItem_C::Icon_Title' has a wrong offset!");
static_assert(offsetof(UMap_AreaInfoListItem_C, Txt_MissionValue) == 0x0004A0, "Member 'UMap_AreaInfoListItem_C::Txt_MissionValue' has a wrong offset!");
static_assert(offsetof(UMap_AreaInfoListItem_C, Txt_ReportTitle) == 0x0004A8, "Member 'UMap_AreaInfoListItem_C::Txt_ReportTitle' has a wrong offset!");

}

