#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_LeftMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Map_LeftMenu.Map_LeftMenu_C
// 0x0020 (0x03E8 - 0x03C8)
class UMap_LeftMenu_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UEndImage*                              EndImage;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   LeftMenu_ScrollBox;                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Map_LeftMenu(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Map_LeftMenu_C">();
	}
	static class UMap_LeftMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMap_LeftMenu_C>();
	}
};
static_assert(alignof(UMap_LeftMenu_C) == 0x000008, "Wrong alignment on UMap_LeftMenu_C");
static_assert(sizeof(UMap_LeftMenu_C) == 0x0003E8, "Wrong size on UMap_LeftMenu_C");
static_assert(offsetof(UMap_LeftMenu_C, UberGraphFrame) == 0x0003C8, "Member 'UMap_LeftMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenu_C, EndImage) == 0x0003D0, "Member 'UMap_LeftMenu_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenu_C, EndImage_1) == 0x0003D8, "Member 'UMap_LeftMenu_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenu_C, LeftMenu_ScrollBox) == 0x0003E0, "Member 'UMap_LeftMenu_C::LeftMenu_ScrollBox' has a wrong offset!");

}

