#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_BtnGuide

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Map_BtnGuide.Map_BtnGuide_C
// 0x0018 (0x03E0 - 0x03C8)
class UMap_BtnGuide_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       WorldMap;                                          // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AreaMap;                                           // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Map_BtnGuide_C">();
	}
	static class UMap_BtnGuide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMap_BtnGuide_C>();
	}
};
static_assert(alignof(UMap_BtnGuide_C) == 0x000008, "Wrong alignment on UMap_BtnGuide_C");
static_assert(sizeof(UMap_BtnGuide_C) == 0x0003E0, "Wrong size on UMap_BtnGuide_C");
static_assert(offsetof(UMap_BtnGuide_C, WorldMap) == 0x0003C8, "Member 'UMap_BtnGuide_C::WorldMap' has a wrong offset!");
static_assert(offsetof(UMap_BtnGuide_C, AreaMap) == 0x0003D0, "Member 'UMap_BtnGuide_C::AreaMap' has a wrong offset!");
static_assert(offsetof(UMap_BtnGuide_C, Base) == 0x0003D8, "Member 'UMap_BtnGuide_C::Base' has a wrong offset!");

}

