#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_PlayerLoca

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Map_PlayerLoca.Map_PlayerLoca_C
// 0x0030 (0x03F8 - 0x03C8)
class UMap_PlayerLoca_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop_PlayerLoca;                                   // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_02;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Map_PlayerLoca;                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Map_PlayerLoca(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Map_PlayerLoca_C">();
	}
	static class UMap_PlayerLoca_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMap_PlayerLoca_C>();
	}
};
static_assert(alignof(UMap_PlayerLoca_C) == 0x000008, "Wrong alignment on UMap_PlayerLoca_C");
static_assert(sizeof(UMap_PlayerLoca_C) == 0x0003F8, "Wrong size on UMap_PlayerLoca_C");
static_assert(offsetof(UMap_PlayerLoca_C, UberGraphFrame) == 0x0003C8, "Member 'UMap_PlayerLoca_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMap_PlayerLoca_C, Loop_PlayerLoca) == 0x0003D0, "Member 'UMap_PlayerLoca_C::Loop_PlayerLoca' has a wrong offset!");
static_assert(offsetof(UMap_PlayerLoca_C, Img_Effect_00) == 0x0003D8, "Member 'UMap_PlayerLoca_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UMap_PlayerLoca_C, Img_Effect_01) == 0x0003E0, "Member 'UMap_PlayerLoca_C::Img_Effect_01' has a wrong offset!");
static_assert(offsetof(UMap_PlayerLoca_C, Img_Effect_02) == 0x0003E8, "Member 'UMap_PlayerLoca_C::Img_Effect_02' has a wrong offset!");
static_assert(offsetof(UMap_PlayerLoca_C, Img_Map_PlayerLoca) == 0x0003F0, "Member 'UMap_PlayerLoca_C::Img_Map_PlayerLoca' has a wrong offset!");

}

