#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Materia_SelectList

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Materia_SelectList.Materia_SelectList_C
// 0x0070 (0x0460 - 0x03F0)
class UMateria_SelectList_C final : public UEndMateriaSelectList
{
public:
	class UEndImage*                              Bg;                                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2;                                               // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_1;                                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_2;                                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_3;                                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_3;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_4;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_5;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_6;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_7;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_8;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Materia_SelectList_C">();
	}
	static class UMateria_SelectList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMateria_SelectList_C>();
	}
};
static_assert(alignof(UMateria_SelectList_C) == 0x000008, "Wrong alignment on UMateria_SelectList_C");
static_assert(sizeof(UMateria_SelectList_C) == 0x000460, "Wrong size on UMateria_SelectList_C");
static_assert(offsetof(UMateria_SelectList_C, Bg) == 0x0003F0, "Member 'UMateria_SelectList_C::Bg' has a wrong offset!");
static_assert(offsetof(UMateria_SelectList_C, Bg2) == 0x0003F8, "Member 'UMateria_SelectList_C::Bg2' has a wrong offset!");
static_assert(offsetof(UMateria_SelectList_C, Bg2_1) == 0x000400, "Member 'UMateria_SelectList_C::Bg2_1' has a wrong offset!");
static_assert(offsetof(UMateria_SelectList_C, Bg2_2) == 0x000408, "Member 'UMateria_SelectList_C::Bg2_2' has a wrong offset!");
static_assert(offsetof(UMateria_SelectList_C, Bg2_3) == 0x000410, "Member 'UMateria_SelectList_C::Bg2_3' has a wrong offset!");
static_assert(offsetof(UMateria_SelectList_C, EndImage) == 0x000418, "Member 'UMateria_SelectList_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMateria_SelectList_C, ListBg2) == 0x000420, "Member 'UMateria_SelectList_C::ListBg2' has a wrong offset!");
static_assert(offsetof(UMateria_SelectList_C, ListPoint_3) == 0x000428, "Member 'UMateria_SelectList_C::ListPoint_3' has a wrong offset!");
static_assert(offsetof(UMateria_SelectList_C, ListPoint_4) == 0x000430, "Member 'UMateria_SelectList_C::ListPoint_4' has a wrong offset!");
static_assert(offsetof(UMateria_SelectList_C, ListPoint_5) == 0x000438, "Member 'UMateria_SelectList_C::ListPoint_5' has a wrong offset!");
static_assert(offsetof(UMateria_SelectList_C, ListPoint_6) == 0x000440, "Member 'UMateria_SelectList_C::ListPoint_6' has a wrong offset!");
static_assert(offsetof(UMateria_SelectList_C, ListPoint_7) == 0x000448, "Member 'UMateria_SelectList_C::ListPoint_7' has a wrong offset!");
static_assert(offsetof(UMateria_SelectList_C, ListPoint_8) == 0x000450, "Member 'UMateria_SelectList_C::ListPoint_8' has a wrong offset!");
static_assert(offsetof(UMateria_SelectList_C, Txt_Title) == 0x000458, "Member 'UMateria_SelectList_C::Txt_Title' has a wrong offset!");

}

