#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MateriaSet_SelectList

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MateriaSet_SelectList.MateriaSet_SelectList_C
// 0x0020 (0x0410 - 0x03F0)
class UMateriaSet_SelectList_C final : public UEndMateriaSetSelectListWindow
{
public:
	class UEndImage*                              Base2;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot1;                                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot2;                                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_01;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MateriaSet_SelectList_C">();
	}
	static class UMateriaSet_SelectList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMateriaSet_SelectList_C>();
	}
};
static_assert(alignof(UMateriaSet_SelectList_C) == 0x000008, "Wrong alignment on UMateriaSet_SelectList_C");
static_assert(sizeof(UMateriaSet_SelectList_C) == 0x000410, "Wrong size on UMateriaSet_SelectList_C");
static_assert(offsetof(UMateriaSet_SelectList_C, Base2) == 0x0003F0, "Member 'UMateriaSet_SelectList_C::Base2' has a wrong offset!");
static_assert(offsetof(UMateriaSet_SelectList_C, Dot1) == 0x0003F8, "Member 'UMateriaSet_SelectList_C::Dot1' has a wrong offset!");
static_assert(offsetof(UMateriaSet_SelectList_C, Dot2) == 0x000400, "Member 'UMateriaSet_SelectList_C::Dot2' has a wrong offset!");
static_assert(offsetof(UMateriaSet_SelectList_C, Shadow_01) == 0x000408, "Member 'UMateriaSet_SelectList_C::Shadow_01' has a wrong offset!");

}

