#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MateriaSet_InfoList_All

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MateriaSet_InfoList_All.MateriaSet_InfoList_All_C
// 0x0088 (0x0488 - 0x0400)
class UMateriaSet_InfoList_All_C final : public UEndMateriaSetInfoListWindow
{
public:
	class UEndImage*                              Base1;                                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base3;                                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_ArmorIcon;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Equip1;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Equip2;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Summon;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_WeaponIcon;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft1;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft2;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft3;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight1;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight2;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight3;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   List_Bg1;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   List_Bg2;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   List_Bg3;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MateriaSet_InfoList_All_C">();
	}
	static class UMateriaSet_InfoList_All_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMateriaSet_InfoList_All_C>();
	}
};
static_assert(alignof(UMateriaSet_InfoList_All_C) == 0x000008, "Wrong alignment on UMateriaSet_InfoList_All_C");
static_assert(sizeof(UMateriaSet_InfoList_All_C) == 0x000488, "Wrong size on UMateriaSet_InfoList_All_C");
static_assert(offsetof(UMateriaSet_InfoList_All_C, Base1) == 0x000400, "Member 'UMateriaSet_InfoList_All_C::Base1' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, Base2) == 0x000408, "Member 'UMateriaSet_InfoList_All_C::Base2' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, Base3) == 0x000410, "Member 'UMateriaSet_InfoList_All_C::Base3' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, Icon_ArmorIcon) == 0x000418, "Member 'UMateriaSet_InfoList_All_C::Icon_ArmorIcon' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, Icon_Equip1) == 0x000420, "Member 'UMateriaSet_InfoList_All_C::Icon_Equip1' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, Icon_Equip2) == 0x000428, "Member 'UMateriaSet_InfoList_All_C::Icon_Equip2' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, Icon_Summon) == 0x000430, "Member 'UMateriaSet_InfoList_All_C::Icon_Summon' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, Icon_WeaponIcon) == 0x000438, "Member 'UMateriaSet_InfoList_All_C::Icon_WeaponIcon' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, IconLeft1) == 0x000440, "Member 'UMateriaSet_InfoList_All_C::IconLeft1' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, IconLeft2) == 0x000448, "Member 'UMateriaSet_InfoList_All_C::IconLeft2' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, IconLeft3) == 0x000450, "Member 'UMateriaSet_InfoList_All_C::IconLeft3' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, IconRight1) == 0x000458, "Member 'UMateriaSet_InfoList_All_C::IconRight1' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, IconRight2) == 0x000460, "Member 'UMateriaSet_InfoList_All_C::IconRight2' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, IconRight3) == 0x000468, "Member 'UMateriaSet_InfoList_All_C::IconRight3' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, List_Bg1) == 0x000470, "Member 'UMateriaSet_InfoList_All_C::List_Bg1' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, List_Bg2) == 0x000478, "Member 'UMateriaSet_InfoList_All_C::List_Bg2' has a wrong offset!");
static_assert(offsetof(UMateriaSet_InfoList_All_C, List_Bg3) == 0x000480, "Member 'UMateriaSet_InfoList_All_C::List_Bg3' has a wrong offset!");

}

