#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Materia_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Materia_List.Materia_List_C
// 0x0020 (0x0438 - 0x0418)
class UMateria_List_C final : public UEndMainMateriaListBoxWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UEndBorder*                             All_Nut_Materia_List;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Summon;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateria_List_Cell_C*                   Materia_Summon_Cell;                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Materia_List(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Materia_List_C">();
	}
	static class UMateria_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMateria_List_C>();
	}
};
static_assert(alignof(UMateria_List_C) == 0x000008, "Wrong alignment on UMateria_List_C");
static_assert(sizeof(UMateria_List_C) == 0x000438, "Wrong size on UMateria_List_C");
static_assert(offsetof(UMateria_List_C, UberGraphFrame) == 0x000418, "Member 'UMateria_List_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMateria_List_C, All_Nut_Materia_List) == 0x000420, "Member 'UMateria_List_C::All_Nut_Materia_List' has a wrong offset!");
static_assert(offsetof(UMateria_List_C, Icon_Summon) == 0x000428, "Member 'UMateria_List_C::Icon_Summon' has a wrong offset!");
static_assert(offsetof(UMateria_List_C, Materia_Summon_Cell) == 0x000430, "Member 'UMateria_List_C::Materia_Summon_Cell' has a wrong offset!");

}

