#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MateriaSet_Cell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MateriaSet_Cell.MateriaSet_Cell_C
// 0x00B8 (0x0480 - 0x03C8)
class UMateriaSet_Cell_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       BtnHover;                                          // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_ArmorIcon;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Equip1;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Equip2;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Summon;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_WeaponIcon;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft1;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft2;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft3;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight1;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight2;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight3;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1;                                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2;                                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateria_List_C*                        Materia_List1;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateria_List_C*                        Materia_List2;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateria_List_Cell_C*                   Materia_Summon_Cell;                               // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MateriaSet_Btn;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              SelectCover;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              SummonLine;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Equip1;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Equip2;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MateriaSet_Cell_C">();
	}
	static class UMateriaSet_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMateriaSet_Cell_C>();
	}
};
static_assert(alignof(UMateriaSet_Cell_C) == 0x000008, "Wrong alignment on UMateriaSet_Cell_C");
static_assert(sizeof(UMateriaSet_Cell_C) == 0x000480, "Wrong size on UMateriaSet_Cell_C");
static_assert(offsetof(UMateriaSet_Cell_C, BtnHover) == 0x0003C8, "Member 'UMateriaSet_Cell_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, Icon_ArmorIcon) == 0x0003D0, "Member 'UMateriaSet_Cell_C::Icon_ArmorIcon' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, Icon_Equip1) == 0x0003D8, "Member 'UMateriaSet_Cell_C::Icon_Equip1' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, Icon_Equip2) == 0x0003E0, "Member 'UMateriaSet_Cell_C::Icon_Equip2' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, Icon_Summon) == 0x0003E8, "Member 'UMateriaSet_Cell_C::Icon_Summon' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, Icon_WeaponIcon) == 0x0003F0, "Member 'UMateriaSet_Cell_C::Icon_WeaponIcon' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, IconLeft1) == 0x0003F8, "Member 'UMateriaSet_Cell_C::IconLeft1' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, IconLeft2) == 0x000400, "Member 'UMateriaSet_Cell_C::IconLeft2' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, IconLeft3) == 0x000408, "Member 'UMateriaSet_Cell_C::IconLeft3' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, IconRight1) == 0x000410, "Member 'UMateriaSet_Cell_C::IconRight1' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, IconRight2) == 0x000418, "Member 'UMateriaSet_Cell_C::IconRight2' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, IconRight3) == 0x000420, "Member 'UMateriaSet_Cell_C::IconRight3' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, Line) == 0x000428, "Member 'UMateriaSet_Cell_C::Line' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, Line1) == 0x000430, "Member 'UMateriaSet_Cell_C::Line1' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, Line2) == 0x000438, "Member 'UMateriaSet_Cell_C::Line2' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, Materia_List1) == 0x000440, "Member 'UMateriaSet_Cell_C::Materia_List1' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, Materia_List2) == 0x000448, "Member 'UMateriaSet_Cell_C::Materia_List2' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, Materia_Summon_Cell) == 0x000450, "Member 'UMateriaSet_Cell_C::Materia_Summon_Cell' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, MateriaSet_Btn) == 0x000458, "Member 'UMateriaSet_Cell_C::MateriaSet_Btn' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, SelectCover) == 0x000460, "Member 'UMateriaSet_Cell_C::SelectCover' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, SummonLine) == 0x000468, "Member 'UMateriaSet_Cell_C::SummonLine' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, Txt_Equip1) == 0x000470, "Member 'UMateriaSet_Cell_C::Txt_Equip1' has a wrong offset!");
static_assert(offsetof(UMateriaSet_Cell_C, Txt_Equip2) == 0x000478, "Member 'UMateriaSet_Cell_C::Txt_Equip2' has a wrong offset!");

}

