#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MateriaQuick

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MateriaQuick.MateriaQuick_C
// 0x00F8 (0x0900 - 0x0808)
class UMateriaQuick_C final : public UEndNewQuickMateriaMenu
{
public:
	class UWidgetAnimation*                       Sort_In;                                           // 0x0808(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MateriaSelectList_In;                              // 0x0810(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0818(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Bg_1;                                              // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2;                                               // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_1;                                             // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_2;                                             // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_3;                                             // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase1;                                          // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase2;                                          // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase3;                                          // 0x0858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnFrame1;                                         // 0x0860(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnFrame2;                                         // 0x0868(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnFrame3;                                         // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1;                                             // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2;                                             // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint;                                         // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_1;                                       // 0x0890(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_2;                                       // 0x0898(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_3;                                       // 0x08A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_4;                                       // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_5;                                       // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_6;                                       // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_7;                                       // 0x08C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_8;                                       // 0x08C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListTitle_C*                           ListTitle_Category;                                // 0x08D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgLeft_C*              System_BgLeft;                                     // 0x08D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn;                                           // 0x08E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn2;                                          // 0x08E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn3;                                          // 0x08F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ListTitle_Category;                            // 0x08F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MateriaQuick_C">();
	}
	static class UMateriaQuick_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMateriaQuick_C>();
	}
};
static_assert(alignof(UMateriaQuick_C) == 0x000008, "Wrong alignment on UMateriaQuick_C");
static_assert(sizeof(UMateriaQuick_C) == 0x000900, "Wrong size on UMateriaQuick_C");
static_assert(offsetof(UMateriaQuick_C, Sort_In) == 0x000808, "Member 'UMateriaQuick_C::Sort_In' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, MateriaSelectList_In) == 0x000810, "Member 'UMateriaQuick_C::MateriaSelectList_In' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, In) == 0x000818, "Member 'UMateriaQuick_C::In' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, Bg_1) == 0x000820, "Member 'UMateriaQuick_C::Bg_1' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, Bg2) == 0x000828, "Member 'UMateriaQuick_C::Bg2' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, Bg2_1) == 0x000830, "Member 'UMateriaQuick_C::Bg2_1' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, Bg2_2) == 0x000838, "Member 'UMateriaQuick_C::Bg2_2' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, Bg2_3) == 0x000840, "Member 'UMateriaQuick_C::Bg2_3' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, BtnBase1) == 0x000848, "Member 'UMateriaQuick_C::BtnBase1' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, BtnBase2) == 0x000850, "Member 'UMateriaQuick_C::BtnBase2' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, BtnBase3) == 0x000858, "Member 'UMateriaQuick_C::BtnBase3' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, BtnFrame1) == 0x000860, "Member 'UMateriaQuick_C::BtnFrame1' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, BtnFrame2) == 0x000868, "Member 'UMateriaQuick_C::BtnFrame2' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, BtnFrame3) == 0x000870, "Member 'UMateriaQuick_C::BtnFrame3' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, Line1) == 0x000878, "Member 'UMateriaQuick_C::Line1' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, Line2) == 0x000880, "Member 'UMateriaQuick_C::Line2' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, ListPoint) == 0x000888, "Member 'UMateriaQuick_C::ListPoint' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, ListPoint_1) == 0x000890, "Member 'UMateriaQuick_C::ListPoint_1' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, ListPoint_2) == 0x000898, "Member 'UMateriaQuick_C::ListPoint_2' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, ListPoint_3) == 0x0008A0, "Member 'UMateriaQuick_C::ListPoint_3' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, ListPoint_4) == 0x0008A8, "Member 'UMateriaQuick_C::ListPoint_4' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, ListPoint_5) == 0x0008B0, "Member 'UMateriaQuick_C::ListPoint_5' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, ListPoint_6) == 0x0008B8, "Member 'UMateriaQuick_C::ListPoint_6' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, ListPoint_7) == 0x0008C0, "Member 'UMateriaQuick_C::ListPoint_7' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, ListPoint_8) == 0x0008C8, "Member 'UMateriaQuick_C::ListPoint_8' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, ListTitle_Category) == 0x0008D0, "Member 'UMateriaQuick_C::ListTitle_Category' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, System_BgLeft) == 0x0008D8, "Member 'UMateriaQuick_C::System_BgLeft' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, Txt_Btn) == 0x0008E0, "Member 'UMateriaQuick_C::Txt_Btn' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, Txt_Btn2) == 0x0008E8, "Member 'UMateriaQuick_C::Txt_Btn2' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, Txt_Btn3) == 0x0008F0, "Member 'UMateriaQuick_C::Txt_Btn3' has a wrong offset!");
static_assert(offsetof(UMateriaQuick_C, Txt_ListTitle_Category) == 0x0008F8, "Member 'UMateriaQuick_C::Txt_ListTitle_Category' has a wrong offset!");

}

