#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Materia_List_CellNew

#include "Basic.hpp"


namespace SDK::Params
{

// Function Materia_List_CellNew.Materia_List_CellNew_C.ExecuteUbergraph_Materia_List_CellNew
// 0x0008 (0x0008 - 0x0000)
struct Materia_List_CellNew_C_ExecuteUbergraph_Materia_List_CellNew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_2;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Materia_List_CellNew_C_ExecuteUbergraph_Materia_List_CellNew) == 0x000004, "Wrong alignment on Materia_List_CellNew_C_ExecuteUbergraph_Materia_List_CellNew");
static_assert(sizeof(Materia_List_CellNew_C_ExecuteUbergraph_Materia_List_CellNew) == 0x000008, "Wrong size on Materia_List_CellNew_C_ExecuteUbergraph_Materia_List_CellNew");
static_assert(offsetof(Materia_List_CellNew_C_ExecuteUbergraph_Materia_List_CellNew, EntryPoint) == 0x000000, "Member 'Materia_List_CellNew_C_ExecuteUbergraph_Materia_List_CellNew::EntryPoint' has a wrong offset!");
static_assert(offsetof(Materia_List_CellNew_C_ExecuteUbergraph_Materia_List_CellNew, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'Materia_List_CellNew_C_ExecuteUbergraph_Materia_List_CellNew::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Materia_List_CellNew_C_ExecuteUbergraph_Materia_List_CellNew, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000005, "Member 'Materia_List_CellNew_C_ExecuteUbergraph_Materia_List_CellNew::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Materia_List_CellNew_C_ExecuteUbergraph_Materia_List_CellNew, CallFunc_PlayAnimationByName_ReturnValue_2) == 0x000006, "Member 'Materia_List_CellNew_C_ExecuteUbergraph_Materia_List_CellNew::CallFunc_PlayAnimationByName_ReturnValue_2' has a wrong offset!");

}

