#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MemberList_CellContent

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MemberList_CellContent.MemberList_CellContent_C
// 0x0100 (0x06E0 - 0x05E0)
class UMemberList_CellContent_C final : public UEndMemberListCellContent
{
public:
	class UWidgetAnimation*                       RecoverList_Reserve_Danger;                        // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RecoverList_Party_Danger;                          // 0x05E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RecoverList_Reserve_DangerHover;                   // 0x05F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RecoverList_Party_DangerHover;                     // 0x05F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NameAndSp_SkillTree;                               // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NameAndSp;                                         // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NameAndMp;                                         // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NameOnly;                                          // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RecoverList_Out_Hover;                             // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RecoverList_Reserve_Hover;                         // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RecoverList_Party_Hover;                           // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MemberList_Out_Hover;                              // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MemberList_Reserve_Hover;                          // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MemberList_Party_Hover;                            // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RecoverList_Out;                                   // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RecoverList_Reserve;                               // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RecoverList_Party;                                 // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MemberList_Out;                                    // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MemberList_Reserve;                                // 0x0670(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MemberList_Party;                                  // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCircle*                             Gauge_Frame;                                       // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              GuageBase;                                         // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HP_Bg;                                             // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HP_Frame;                                          // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_SkillBook;                                    // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash;                                         // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_01;                                      // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_02;                                      // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MP_Bg;                                             // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MP_Frame;                                          // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MpBg;                                              // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              SpBg;                                              // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MemberList_CellContent_C">();
	}
	static class UMemberList_CellContent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMemberList_CellContent_C>();
	}
};
static_assert(alignof(UMemberList_CellContent_C) == 0x000008, "Wrong alignment on UMemberList_CellContent_C");
static_assert(sizeof(UMemberList_CellContent_C) == 0x0006E0, "Wrong size on UMemberList_CellContent_C");
static_assert(offsetof(UMemberList_CellContent_C, RecoverList_Reserve_Danger) == 0x0005E0, "Member 'UMemberList_CellContent_C::RecoverList_Reserve_Danger' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, RecoverList_Party_Danger) == 0x0005E8, "Member 'UMemberList_CellContent_C::RecoverList_Party_Danger' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, RecoverList_Reserve_DangerHover) == 0x0005F0, "Member 'UMemberList_CellContent_C::RecoverList_Reserve_DangerHover' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, RecoverList_Party_DangerHover) == 0x0005F8, "Member 'UMemberList_CellContent_C::RecoverList_Party_DangerHover' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, NameAndSp_SkillTree) == 0x000600, "Member 'UMemberList_CellContent_C::NameAndSp_SkillTree' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, NameAndSp) == 0x000608, "Member 'UMemberList_CellContent_C::NameAndSp' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, NameAndMp) == 0x000610, "Member 'UMemberList_CellContent_C::NameAndMp' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, NameOnly) == 0x000618, "Member 'UMemberList_CellContent_C::NameOnly' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, RecoverList_Out_Hover) == 0x000620, "Member 'UMemberList_CellContent_C::RecoverList_Out_Hover' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, RecoverList_Reserve_Hover) == 0x000628, "Member 'UMemberList_CellContent_C::RecoverList_Reserve_Hover' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, RecoverList_Party_Hover) == 0x000630, "Member 'UMemberList_CellContent_C::RecoverList_Party_Hover' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, MemberList_Out_Hover) == 0x000638, "Member 'UMemberList_CellContent_C::MemberList_Out_Hover' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, MemberList_Reserve_Hover) == 0x000640, "Member 'UMemberList_CellContent_C::MemberList_Reserve_Hover' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, MemberList_Party_Hover) == 0x000648, "Member 'UMemberList_CellContent_C::MemberList_Party_Hover' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, RecoverList_Out) == 0x000650, "Member 'UMemberList_CellContent_C::RecoverList_Out' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, RecoverList_Reserve) == 0x000658, "Member 'UMemberList_CellContent_C::RecoverList_Reserve' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, RecoverList_Party) == 0x000660, "Member 'UMemberList_CellContent_C::RecoverList_Party' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, MemberList_Out) == 0x000668, "Member 'UMemberList_CellContent_C::MemberList_Out' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, MemberList_Reserve) == 0x000670, "Member 'UMemberList_CellContent_C::MemberList_Reserve' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, MemberList_Party) == 0x000678, "Member 'UMemberList_CellContent_C::MemberList_Party' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, Gauge_Frame) == 0x000680, "Member 'UMemberList_CellContent_C::Gauge_Frame' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, GuageBase) == 0x000688, "Member 'UMemberList_CellContent_C::GuageBase' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, HP_Bg) == 0x000690, "Member 'UMemberList_CellContent_C::HP_Bg' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, HP_Frame) == 0x000698, "Member 'UMemberList_CellContent_C::HP_Frame' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, Icon_SkillBook) == 0x0006A0, "Member 'UMemberList_CellContent_C::Icon_SkillBook' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, Img_Slash) == 0x0006A8, "Member 'UMemberList_CellContent_C::Img_Slash' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, Img_Slash_01) == 0x0006B0, "Member 'UMemberList_CellContent_C::Img_Slash_01' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, Img_Slash_02) == 0x0006B8, "Member 'UMemberList_CellContent_C::Img_Slash_02' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, MP_Bg) == 0x0006C0, "Member 'UMemberList_CellContent_C::MP_Bg' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, MP_Frame) == 0x0006C8, "Member 'UMemberList_CellContent_C::MP_Frame' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, MpBg) == 0x0006D0, "Member 'UMemberList_CellContent_C::MpBg' has a wrong offset!");
static_assert(offsetof(UMemberList_CellContent_C, SpBg) == 0x0006D8, "Member 'UMemberList_CellContent_C::SpBg' has a wrong offset!");

}

