#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MemberChange_Status

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MemberChange_Status.MemberChange_Status_C
// 0x0018 (0x0460 - 0x0448)
class UMemberChange_Status_C final : public UEndMemberChangeStatus
{
public:
	class UWidgetAnimation*                       Normal;                                            // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Lock;                                              // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Line1;                                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MemberChange_Status_C">();
	}
	static class UMemberChange_Status_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMemberChange_Status_C>();
	}
};
static_assert(alignof(UMemberChange_Status_C) == 0x000008, "Wrong alignment on UMemberChange_Status_C");
static_assert(sizeof(UMemberChange_Status_C) == 0x000460, "Wrong size on UMemberChange_Status_C");
static_assert(offsetof(UMemberChange_Status_C, Normal) == 0x000448, "Member 'UMemberChange_Status_C::Normal' has a wrong offset!");
static_assert(offsetof(UMemberChange_Status_C, Lock) == 0x000450, "Member 'UMemberChange_Status_C::Lock' has a wrong offset!");
static_assert(offsetof(UMemberChange_Status_C, Line1) == 0x000458, "Member 'UMemberChange_Status_C::Line1' has a wrong offset!");

}

