#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MemberList_Cell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MemberList_Cell.MemberList_Cell_C
// 0x0050 (0x0480 - 0x0430)
class UMemberList_Cell_C final : public UEndMemberListCell
{
public:
	class UWidgetAnimation*                       Member_In;                                         // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Effect_00;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_01;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_02;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_301;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gradation1;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_AbilityExp_Waku;                               // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MemberList_Cell_C">();
	}
	static class UMemberList_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMemberList_Cell_C>();
	}
};
static_assert(alignof(UMemberList_Cell_C) == 0x000008, "Wrong alignment on UMemberList_Cell_C");
static_assert(sizeof(UMemberList_Cell_C) == 0x000480, "Wrong size on UMemberList_Cell_C");
static_assert(offsetof(UMemberList_Cell_C, Member_In) == 0x000430, "Member 'UMemberList_Cell_C::Member_In' has a wrong offset!");
static_assert(offsetof(UMemberList_Cell_C, BtnHover) == 0x000438, "Member 'UMemberList_Cell_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMemberList_Cell_C, Effect_00) == 0x000440, "Member 'UMemberList_Cell_C::Effect_00' has a wrong offset!");
static_assert(offsetof(UMemberList_Cell_C, Effect_01) == 0x000448, "Member 'UMemberList_Cell_C::Effect_01' has a wrong offset!");
static_assert(offsetof(UMemberList_Cell_C, Effect_02) == 0x000450, "Member 'UMemberList_Cell_C::Effect_02' has a wrong offset!");
static_assert(offsetof(UMemberList_Cell_C, EndImage) == 0x000458, "Member 'UMemberList_Cell_C::EndImage' has a wrong offset!");
static_assert(offsetof(UMemberList_Cell_C, EndImage_301) == 0x000460, "Member 'UMemberList_Cell_C::EndImage_301' has a wrong offset!");
static_assert(offsetof(UMemberList_Cell_C, Gradation1) == 0x000468, "Member 'UMemberList_Cell_C::Gradation1' has a wrong offset!");
static_assert(offsetof(UMemberList_Cell_C, Img_AbilityExp_Waku) == 0x000470, "Member 'UMemberList_Cell_C::Img_AbilityExp_Waku' has a wrong offset!");
static_assert(offsetof(UMemberList_Cell_C, MainMenu_Btn) == 0x000478, "Member 'UMemberList_Cell_C::MainMenu_Btn' has a wrong offset!");

}

