#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MemberChange_List

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MemberChange_List.MemberChange_List_C
// 0x0038 (0x0418 - 0x03E0)
class UMemberChange_List_C final : public UEndMemberChangeList
{
public:
	class UWidgetAnimation*                       Off;                                               // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       On;                                                // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_4;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point2;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point2_2;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MemberChange_List_C">();
	}
	static class UMemberChange_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMemberChange_List_C>();
	}
};
static_assert(alignof(UMemberChange_List_C) == 0x000008, "Wrong alignment on UMemberChange_List_C");
static_assert(sizeof(UMemberChange_List_C) == 0x000418, "Wrong size on UMemberChange_List_C");
static_assert(offsetof(UMemberChange_List_C, Off) == 0x0003E0, "Member 'UMemberChange_List_C::Off' has a wrong offset!");
static_assert(offsetof(UMemberChange_List_C, On) == 0x0003E8, "Member 'UMemberChange_List_C::On' has a wrong offset!");
static_assert(offsetof(UMemberChange_List_C, Base) == 0x0003F0, "Member 'UMemberChange_List_C::Base' has a wrong offset!");
static_assert(offsetof(UMemberChange_List_C, Base1_4) == 0x0003F8, "Member 'UMemberChange_List_C::Base1_4' has a wrong offset!");
static_assert(offsetof(UMemberChange_List_C, Frame) == 0x000400, "Member 'UMemberChange_List_C::Frame' has a wrong offset!");
static_assert(offsetof(UMemberChange_List_C, Point2) == 0x000408, "Member 'UMemberChange_List_C::Point2' has a wrong offset!");
static_assert(offsetof(UMemberChange_List_C, Point2_2) == 0x000410, "Member 'UMemberChange_List_C::Point2_2' has a wrong offset!");

}

