#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MemberJoin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MemberJoin.MemberJoin_C
// 0x0098 (0x0460 - 0x03C8)
class UMemberJoin_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Out;                                               // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              EndImage_810;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BG;                                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Chara;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line_00;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_B;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1_T;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2_B;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2_T;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Shadow;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Name00_TextBase;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Name00_TextBase_1;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Tex_0;                                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Tex_1;                                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Tex_2;                                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Tex_3;                                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MemberJoin(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MemberJoin_C">();
	}
	static class UMemberJoin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMemberJoin_C>();
	}
};
static_assert(alignof(UMemberJoin_C) == 0x000008, "Wrong alignment on UMemberJoin_C");
static_assert(sizeof(UMemberJoin_C) == 0x000460, "Wrong size on UMemberJoin_C");
static_assert(offsetof(UMemberJoin_C, UberGraphFrame) == 0x0003C8, "Member 'UMemberJoin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Out) == 0x0003D0, "Member 'UMemberJoin_C::Out' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Loop) == 0x0003D8, "Member 'UMemberJoin_C::Loop' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, In) == 0x0003E0, "Member 'UMemberJoin_C::In' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, EndImage_810) == 0x0003E8, "Member 'UMemberJoin_C::EndImage_810' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Img_BG) == 0x0003F0, "Member 'UMemberJoin_C::Img_BG' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Img_Chara) == 0x0003F8, "Member 'UMemberJoin_C::Img_Chara' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Img_Line_00) == 0x000400, "Member 'UMemberJoin_C::Img_Line_00' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Line1_B) == 0x000408, "Member 'UMemberJoin_C::Line1_B' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Line1_T) == 0x000410, "Member 'UMemberJoin_C::Line1_T' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Line2_B) == 0x000418, "Member 'UMemberJoin_C::Line2_B' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Line2_T) == 0x000420, "Member 'UMemberJoin_C::Line2_T' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Line_Shadow) == 0x000428, "Member 'UMemberJoin_C::Line_Shadow' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Name00_TextBase) == 0x000430, "Member 'UMemberJoin_C::Name00_TextBase' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Name00_TextBase_1) == 0x000438, "Member 'UMemberJoin_C::Name00_TextBase_1' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Tex_0) == 0x000440, "Member 'UMemberJoin_C::Tex_0' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Tex_1) == 0x000448, "Member 'UMemberJoin_C::Tex_1' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Tex_2) == 0x000450, "Member 'UMemberJoin_C::Tex_2' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Tex_3) == 0x000458, "Member 'UMemberJoin_C::Tex_3' has a wrong offset!");

}

