#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniGame_Com_Result

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MiniGame_Com_Result.MiniGame_Com_Result_C
// 0x0138 (0x0548 - 0x0410)
class UMiniGame_Com_Result_C final : public UEndMessageWindow
{
public:
	class UWidgetAnimation*                       ChocoboRing;                                       // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Saboten;                                           // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BoxGame;                                           // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GambitFort;                                        // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Dolphin;                                           // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShootingGame_2;                                    // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Muscle;                                            // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FrogFlap;                                          // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShootingGame;                                      // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Piano;                                             // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Draw;                                              // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Lose;                                              // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Win;                                               // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewScore;                                          // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShootingCoaster;                                   // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChocoboTimeAttack;                                 // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Bg2;                                               // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Clear;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Clear2;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light1;                                            // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light1_1;                                          // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light1_3;                                          // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1;                                             // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListBg;                                            // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListFrame;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMiniGame_Com_ResultNewIcon_C*          New;                                               // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Total_Line;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TotalDeco;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn;                                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn_1;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn_Retry;                                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              WinDeco;                                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              WinDeco2;                                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              WinLoseLight;                                      // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              WinLoseLight_1;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MiniGame_Com_Result_C">();
	}
	static class UMiniGame_Com_Result_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMiniGame_Com_Result_C>();
	}
};
static_assert(alignof(UMiniGame_Com_Result_C) == 0x000008, "Wrong alignment on UMiniGame_Com_Result_C");
static_assert(sizeof(UMiniGame_Com_Result_C) == 0x000548, "Wrong size on UMiniGame_Com_Result_C");
static_assert(offsetof(UMiniGame_Com_Result_C, ChocoboRing) == 0x000410, "Member 'UMiniGame_Com_Result_C::ChocoboRing' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Saboten) == 0x000418, "Member 'UMiniGame_Com_Result_C::Saboten' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, BoxGame) == 0x000420, "Member 'UMiniGame_Com_Result_C::BoxGame' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, GambitFort) == 0x000428, "Member 'UMiniGame_Com_Result_C::GambitFort' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Dolphin) == 0x000430, "Member 'UMiniGame_Com_Result_C::Dolphin' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, ShootingGame_2) == 0x000438, "Member 'UMiniGame_Com_Result_C::ShootingGame_2' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Muscle) == 0x000440, "Member 'UMiniGame_Com_Result_C::Muscle' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, FrogFlap) == 0x000448, "Member 'UMiniGame_Com_Result_C::FrogFlap' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, ShootingGame) == 0x000450, "Member 'UMiniGame_Com_Result_C::ShootingGame' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Piano) == 0x000458, "Member 'UMiniGame_Com_Result_C::Piano' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Draw) == 0x000460, "Member 'UMiniGame_Com_Result_C::Draw' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Lose) == 0x000468, "Member 'UMiniGame_Com_Result_C::Lose' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Win) == 0x000470, "Member 'UMiniGame_Com_Result_C::Win' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, NewScore) == 0x000478, "Member 'UMiniGame_Com_Result_C::NewScore' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, ShootingCoaster) == 0x000480, "Member 'UMiniGame_Com_Result_C::ShootingCoaster' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, ChocoboTimeAttack) == 0x000488, "Member 'UMiniGame_Com_Result_C::ChocoboTimeAttack' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Out) == 0x000490, "Member 'UMiniGame_Com_Result_C::Out' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, In) == 0x000498, "Member 'UMiniGame_Com_Result_C::In' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Bg2) == 0x0004A0, "Member 'UMiniGame_Com_Result_C::Bg2' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Billboard_Bg) == 0x0004A8, "Member 'UMiniGame_Com_Result_C::Billboard_Bg' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Icon_Clear) == 0x0004B0, "Member 'UMiniGame_Com_Result_C::Icon_Clear' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Icon_Clear2) == 0x0004B8, "Member 'UMiniGame_Com_Result_C::Icon_Clear2' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Light1) == 0x0004C0, "Member 'UMiniGame_Com_Result_C::Light1' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Light1_1) == 0x0004C8, "Member 'UMiniGame_Com_Result_C::Light1_1' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Light1_3) == 0x0004D0, "Member 'UMiniGame_Com_Result_C::Light1_3' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Line) == 0x0004D8, "Member 'UMiniGame_Com_Result_C::Line' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Line1) == 0x0004E0, "Member 'UMiniGame_Com_Result_C::Line1' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, ListBg) == 0x0004E8, "Member 'UMiniGame_Com_Result_C::ListBg' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, ListFrame) == 0x0004F0, "Member 'UMiniGame_Com_Result_C::ListFrame' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, New) == 0x0004F8, "Member 'UMiniGame_Com_Result_C::New' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Total_Line) == 0x000500, "Member 'UMiniGame_Com_Result_C::Total_Line' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, TotalDeco) == 0x000508, "Member 'UMiniGame_Com_Result_C::TotalDeco' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Txt_Btn) == 0x000510, "Member 'UMiniGame_Com_Result_C::Txt_Btn' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Txt_Btn_1) == 0x000518, "Member 'UMiniGame_Com_Result_C::Txt_Btn_1' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, Txt_Btn_Retry) == 0x000520, "Member 'UMiniGame_Com_Result_C::Txt_Btn_Retry' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, WinDeco) == 0x000528, "Member 'UMiniGame_Com_Result_C::WinDeco' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, WinDeco2) == 0x000530, "Member 'UMiniGame_Com_Result_C::WinDeco2' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, WinLoseLight) == 0x000538, "Member 'UMiniGame_Com_Result_C::WinLoseLight' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Result_C, WinLoseLight_1) == 0x000540, "Member 'UMiniGame_Com_Result_C::WinLoseLight_1' has a wrong offset!");

}

