#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniGame_Com_ResultCell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MiniGame_Com_ResultCell.MiniGame_Com_ResultCell_C
// 0x0030 (0x03F8 - 0x03C8)
class UMiniGame_Com_ResultCell_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       NewScore;                                          // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Icon_Equal;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_X;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMiniGame_Com_ResultNewIcon_C*          New;                                               // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MiniGame_Com_ResultCell_C">();
	}
	static class UMiniGame_Com_ResultCell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMiniGame_Com_ResultCell_C>();
	}
};
static_assert(alignof(UMiniGame_Com_ResultCell_C) == 0x000008, "Wrong alignment on UMiniGame_Com_ResultCell_C");
static_assert(sizeof(UMiniGame_Com_ResultCell_C) == 0x0003F8, "Wrong size on UMiniGame_Com_ResultCell_C");
static_assert(offsetof(UMiniGame_Com_ResultCell_C, NewScore) == 0x0003C8, "Member 'UMiniGame_Com_ResultCell_C::NewScore' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_ResultCell_C, In) == 0x0003D0, "Member 'UMiniGame_Com_ResultCell_C::In' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_ResultCell_C, Icon_Equal) == 0x0003D8, "Member 'UMiniGame_Com_ResultCell_C::Icon_Equal' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_ResultCell_C, Icon_X) == 0x0003E0, "Member 'UMiniGame_Com_ResultCell_C::Icon_X' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_ResultCell_C, Line) == 0x0003E8, "Member 'UMiniGame_Com_ResultCell_C::Line' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_ResultCell_C, New) == 0x0003F0, "Member 'UMiniGame_Com_ResultCell_C::New' has a wrong offset!");

}

