#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MobPrefabTemplate_SimpleMove_04

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MobPrefabTemplate_SimpleMove_03_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MobPrefabTemplate_SimpleMove_04.MobPrefabTemplate_SimpleMove_04_C
// 0x0070 (0x06E0 - 0x0670)
class AMobPrefabTemplate_SimpleMove_04_C : public AMobPrefabTemplate_SimpleMove_03_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MobPrefabTemplate_SimpleMove_04_C;  // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	TSoftClassPtr<class UClass>                   CharacterClass04;                                  // 0x0670(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   LoopMotionName04;                                  // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LoopMotionBlendFilter04;                           // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   AttachActor04;                                     // 0x06A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   AttachSocketName04;                                // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSetName04;                                     // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnPreUpdateRegistry();
	void ExecuteUbergraph_MobPrefabTemplate_SimpleMove_04(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MobPrefabTemplate_SimpleMove_04_C">();
	}
	static class AMobPrefabTemplate_SimpleMove_04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMobPrefabTemplate_SimpleMove_04_C>();
	}
};
static_assert(alignof(AMobPrefabTemplate_SimpleMove_04_C) == 0x000010, "Wrong alignment on AMobPrefabTemplate_SimpleMove_04_C");
static_assert(sizeof(AMobPrefabTemplate_SimpleMove_04_C) == 0x0006E0, "Wrong size on AMobPrefabTemplate_SimpleMove_04_C");
static_assert(offsetof(AMobPrefabTemplate_SimpleMove_04_C, UberGraphFrame_MobPrefabTemplate_SimpleMove_04_C) == 0x000668, "Member 'AMobPrefabTemplate_SimpleMove_04_C::UberGraphFrame_MobPrefabTemplate_SimpleMove_04_C' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_SimpleMove_04_C, CharacterClass04) == 0x000670, "Member 'AMobPrefabTemplate_SimpleMove_04_C::CharacterClass04' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_SimpleMove_04_C, LoopMotionName04) == 0x000698, "Member 'AMobPrefabTemplate_SimpleMove_04_C::LoopMotionName04' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_SimpleMove_04_C, LoopMotionBlendFilter04) == 0x0006A0, "Member 'AMobPrefabTemplate_SimpleMove_04_C::LoopMotionBlendFilter04' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_SimpleMove_04_C, AttachActor04) == 0x0006A8, "Member 'AMobPrefabTemplate_SimpleMove_04_C::AttachActor04' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_SimpleMove_04_C, AttachSocketName04) == 0x0006D0, "Member 'AMobPrefabTemplate_SimpleMove_04_C::AttachSocketName04' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_SimpleMove_04_C, AnimSetName04) == 0x0006D8, "Member 'AMobPrefabTemplate_SimpleMove_04_C::AnimSetName04' has a wrong offset!");

}

