#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MobPrefabTemplate_ReactionAndContact_03

#include "Basic.hpp"


namespace SDK::Params
{

// Function MobPrefabTemplate_ReactionAndContact_03.MobPrefabTemplate_ReactionAndContact_03_C.ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_03
// 0x0004 (0x0004 - 0x0000)
struct MobPrefabTemplate_ReactionAndContact_03_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_03 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MobPrefabTemplate_ReactionAndContact_03_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_03) == 0x000004, "Wrong alignment on MobPrefabTemplate_ReactionAndContact_03_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_03");
static_assert(sizeof(MobPrefabTemplate_ReactionAndContact_03_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_03) == 0x000004, "Wrong size on MobPrefabTemplate_ReactionAndContact_03_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_03");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_03, EntryPoint) == 0x000000, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_03::EntryPoint' has a wrong offset!");

// Function MobPrefabTemplate_ReactionAndContact_03.MobPrefabTemplate_ReactionAndContact_03_C.GetContext
// 0x0408 (0x0408 - 0x0000)
struct MobPrefabTemplate_ReactionAndContact_03_C_GetContext final
{
public:
	class FName                                   MobId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableReaction;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          EnableContact;                                     // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ContactDuringReaction;                             // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ForwardLeftMotion;                                 // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ForwardRightMotion;                                // 0x0014(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BackLeftMotion;                                    // 0x001C(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BackRightMotion;                                   // 0x0024(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ContactBlendTime;                                  // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FName>                ContactPropagateMotionTable;                       // 0x0030(0x0050)(Parm, OutParm)
	TMap<class FName, class FName>                ContactPropagateForwardLeftMotionTable;            // 0x0080(0x0050)(Parm, OutParm)
	TMap<class FName, class FName>                ContactPropagateForwardRightMotionTable;           // 0x00D0(0x0050)(Parm, OutParm)
	TMap<class FName, class FName>                ContactPropagateBackLeftMotionTable;               // 0x0120(0x0050)(Parm, OutParm)
	TMap<class FName, class FName>                ContactPropagateBackRightMotionTable;              // 0x0170(0x0050)(Parm, OutParm)
	float                                         ContactPropagateBlendTime;                         // 0x01C0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactOutMotionName;                              // 0x01C4(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ContactOutBlendTime;                               // 0x01CC(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactOutReplaceBaseMotionName;                   // 0x01D0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Motion;                                            // 0x01D8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendTime;                                         // 0x01E0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReplaceBaseMotion;                                 // 0x01E4(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReactionOutMotionName;                             // 0x01EC(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReactionOutBlendTime;                              // 0x01F4(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReactionOutReplaceBaseMotionName;                  // 0x01F8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayMotionOnce;                                    // 0x0200(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetContext_EnableReaction;                // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetContext_EnableContact;                 // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetContext_ContactDuringReaction;         // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetContext_ForwardLeftMotion;             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_ForwardRightMotion;            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_BackLeftMotion;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_BackRightMotion;               // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetContext_ContactBlendTime;              // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FName>                CallFunc_GetContext_ContactPropagateMotionTable;   // 0x0230(0x0050)()
	TMap<class FName, class FName>                CallFunc_GetContext_ContactPropagateForwardLeftMotionTable; // 0x0280(0x0050)()
	TMap<class FName, class FName>                CallFunc_GetContext_ContactPropagateForwardRightMotionTable; // 0x02D0(0x0050)()
	TMap<class FName, class FName>                CallFunc_GetContext_ContactPropagateBackLeftMotionTable; // 0x0320(0x0050)()
	TMap<class FName, class FName>                CallFunc_GetContext_ContactPropagateBackRightMotionTable; // 0x0370(0x0050)()
	float                                         CallFunc_GetContext_ContactPropagateBlendTime;     // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_ContactOutMotionName;          // 0x03C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetContext_ContactOutBlendTime;           // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_ContactOutReplaceBaseMotionName; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_Motion;                        // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetContext_BlendTime;                     // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_ReplaceBaseMotion;             // 0x03E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_ReactionOutMotionName;         // 0x03EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetContext_ReactionOutBlendTime;          // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_ReactionOutReplaceBaseMotionName; // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetContext_PlayMotionOnce;                // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext) == 0x000008, "Wrong alignment on MobPrefabTemplate_ReactionAndContact_03_C_GetContext");
static_assert(sizeof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext) == 0x000408, "Wrong size on MobPrefabTemplate_ReactionAndContact_03_C_GetContext");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, MobId) == 0x000000, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::MobId' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, EnableReaction) == 0x000008, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::EnableReaction' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, EnableContact) == 0x000009, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::EnableContact' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ContactDuringReaction) == 0x00000A, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ContactDuringReaction' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ForwardLeftMotion) == 0x00000C, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ForwardLeftMotion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ForwardRightMotion) == 0x000014, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ForwardRightMotion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, BackLeftMotion) == 0x00001C, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::BackLeftMotion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, BackRightMotion) == 0x000024, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::BackRightMotion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ContactBlendTime) == 0x00002C, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ContactBlendTime' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ContactPropagateMotionTable) == 0x000030, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ContactPropagateMotionTable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ContactPropagateForwardLeftMotionTable) == 0x000080, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ContactPropagateForwardLeftMotionTable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ContactPropagateForwardRightMotionTable) == 0x0000D0, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ContactPropagateForwardRightMotionTable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ContactPropagateBackLeftMotionTable) == 0x000120, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ContactPropagateBackLeftMotionTable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ContactPropagateBackRightMotionTable) == 0x000170, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ContactPropagateBackRightMotionTable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ContactPropagateBlendTime) == 0x0001C0, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ContactPropagateBlendTime' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ContactOutMotionName) == 0x0001C4, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ContactOutMotionName' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ContactOutBlendTime) == 0x0001CC, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ContactOutBlendTime' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ContactOutReplaceBaseMotionName) == 0x0001D0, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ContactOutReplaceBaseMotionName' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, Motion) == 0x0001D8, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::Motion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, BlendTime) == 0x0001E0, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::BlendTime' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ReplaceBaseMotion) == 0x0001E4, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ReplaceBaseMotion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ReactionOutMotionName) == 0x0001EC, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ReactionOutMotionName' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ReactionOutBlendTime) == 0x0001F4, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ReactionOutBlendTime' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, ReactionOutReplaceBaseMotionName) == 0x0001F8, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::ReactionOutReplaceBaseMotionName' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, PlayMotionOnce) == 0x000200, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::PlayMotionOnce' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000201, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_EnableReaction) == 0x000202, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_EnableReaction' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_EnableContact) == 0x000203, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_EnableContact' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ContactDuringReaction) == 0x000204, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ContactDuringReaction' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ForwardLeftMotion) == 0x000208, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ForwardLeftMotion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ForwardRightMotion) == 0x000210, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ForwardRightMotion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_BackLeftMotion) == 0x000218, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_BackLeftMotion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_BackRightMotion) == 0x000220, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_BackRightMotion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ContactBlendTime) == 0x000228, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ContactBlendTime' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ContactPropagateMotionTable) == 0x000230, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ContactPropagateMotionTable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ContactPropagateForwardLeftMotionTable) == 0x000280, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ContactPropagateForwardLeftMotionTable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ContactPropagateForwardRightMotionTable) == 0x0002D0, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ContactPropagateForwardRightMotionTable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ContactPropagateBackLeftMotionTable) == 0x000320, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ContactPropagateBackLeftMotionTable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ContactPropagateBackRightMotionTable) == 0x000370, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ContactPropagateBackRightMotionTable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ContactPropagateBlendTime) == 0x0003C0, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ContactPropagateBlendTime' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ContactOutMotionName) == 0x0003C4, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ContactOutMotionName' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ContactOutBlendTime) == 0x0003CC, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ContactOutBlendTime' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ContactOutReplaceBaseMotionName) == 0x0003D0, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ContactOutReplaceBaseMotionName' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_Motion) == 0x0003D8, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_Motion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_BlendTime) == 0x0003E0, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_BlendTime' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ReplaceBaseMotion) == 0x0003E4, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ReplaceBaseMotion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ReactionOutMotionName) == 0x0003EC, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ReactionOutMotionName' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ReactionOutBlendTime) == 0x0003F4, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ReactionOutBlendTime' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_ReactionOutReplaceBaseMotionName) == 0x0003F8, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_ReactionOutReplaceBaseMotionName' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_03_C_GetContext, CallFunc_GetContext_PlayMotionOnce) == 0x000400, "Member 'MobPrefabTemplate_ReactionAndContact_03_C_GetContext::CallFunc_GetContext_PlayMotionOnce' has a wrong offset!");

}

