#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MobPrefabTemplate_SimpleMove_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MobPrefabBase01_Single_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MobPrefabTemplate_SimpleMove_01.MobPrefabTemplate_SimpleMove_01_C
// 0x0080 (0x0580 - 0x0500)
#pragma pack(push, 0x1)
class alignas(0x10) AMobPrefabTemplate_SimpleMove_01_C : public AMobPrefabBase01_Single_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	TSoftClassPtr<class UClass>                   CharacterClass01;                                  // 0x0508(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   LoopMotionName01;                                  // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LoopMotionBlendFilter01;                           // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   AttachActor01;                                     // 0x0540(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   AttachSocketName01;                                // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSetName01;                                     // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MobPrefabTemplate_SimpleMove_01(int32 EntryPoint);
	void OnPreUpdateRegistry();
	void CreateMobCommand();
	void Initialize(class FName MobId, TSoftClassPtr<class UClass> CharacterClass, class FName LoopMotionName, class FName LoopMotionBlendFilter, const TSoftClassPtr<class UClass>& AttachActor, class FName AttachSocketName, class FName AnimSetName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MobPrefabTemplate_SimpleMove_01_C">();
	}
	static class AMobPrefabTemplate_SimpleMove_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMobPrefabTemplate_SimpleMove_01_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(AMobPrefabTemplate_SimpleMove_01_C) == 0x000010, "Wrong alignment on AMobPrefabTemplate_SimpleMove_01_C");
static_assert(sizeof(AMobPrefabTemplate_SimpleMove_01_C) == 0x000580, "Wrong size on AMobPrefabTemplate_SimpleMove_01_C");
static_assert(offsetof(AMobPrefabTemplate_SimpleMove_01_C, UberGraphFrame) == 0x000500, "Member 'AMobPrefabTemplate_SimpleMove_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_SimpleMove_01_C, CharacterClass01) == 0x000508, "Member 'AMobPrefabTemplate_SimpleMove_01_C::CharacterClass01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_SimpleMove_01_C, LoopMotionName01) == 0x000530, "Member 'AMobPrefabTemplate_SimpleMove_01_C::LoopMotionName01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_SimpleMove_01_C, LoopMotionBlendFilter01) == 0x000538, "Member 'AMobPrefabTemplate_SimpleMove_01_C::LoopMotionBlendFilter01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_SimpleMove_01_C, AttachActor01) == 0x000540, "Member 'AMobPrefabTemplate_SimpleMove_01_C::AttachActor01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_SimpleMove_01_C, AttachSocketName01) == 0x000568, "Member 'AMobPrefabTemplate_SimpleMove_01_C::AttachSocketName01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_SimpleMove_01_C, AnimSetName01) == 0x000570, "Member 'AMobPrefabTemplate_SimpleMove_01_C::AnimSetName01' has a wrong offset!");

}

