#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MobPrefabTemplate_LookAtAndContact_03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MobPrefabTemplate_LookAtAndContact_02_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MobPrefabTemplate_LookAtAndContact_03.MobPrefabTemplate_LookAtAndContact_03_C
// 0x0230 (0x0BC0 - 0x0990)
class AMobPrefabTemplate_LookAtAndContact_03_C : public AMobPrefabTemplate_LookAtAndContact_02_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MobPrefabTemplate_LookAtAndContact_03_C; // 0x0988(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	TSoftClassPtr<class UClass>                   CharacterClass03;                                  // 0x0990(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   LoopMotionName03;                                  // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   AttachActor03;                                     // 0x09C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   AttachSocketName03;                                // 0x09E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableLookAt03;                                    // 0x09F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnableContact03;                                   // 0x09F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ContactDuringReaction03;                           // 0x09F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F3[0x1];                                      // 0x09F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ContactForwardLeftMotionName03;                    // 0x09F4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactForwardRightMotionName03;                   // 0x09FC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactBackLeftMotionName03;                       // 0x0A04(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactBackRightMotionName03;                      // 0x0A0C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ContactBlendTime03;                                // 0x0A14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FName>                ContactPropagateMotionTable03;                     // 0x0A18(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class FName>                ContactPropagateForwardLeftMotionTable03;          // 0x0A68(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class FName>                ContactPropagateForwardRightMotionTable03;         // 0x0AB8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class FName>                ContactPropagateBackLeftMotionTable03;             // 0x0B08(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class FName>                ContactPropagateBackRightMotionTable03;            // 0x0B58(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         ContactPropagateBlendTime03;                       // 0x0BA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactOutMotionName03;                            // 0x0BAC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ContactOutBlendTime03;                             // 0x0BB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactOutReplaceBaseMotionName03;                 // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MobPrefabTemplate_LookAtAndContact_03(int32 EntryPoint);
	void OnPreUpdateRegistry();
	void GetContext(class FName MobId, bool* EnableLookAt, bool* EnableContact, bool* ContactDuringReaction, class FName* ForwardLeftMotion, class FName* ForwardRightMotion, class FName* BackLeftMotion, class FName* BackRightMotion, float* ContactBlendTime, TMap<class FName, class FName>* ContactPropagateMotionTable, TMap<class FName, class FName>* ContactPropagateForwardLeftMotionTable, TMap<class FName, class FName>* ContactPropagateForwardRightMotionTable, TMap<class FName, class FName>* ContactPropagateBackLeftMotionTable, TMap<class FName, class FName>* ContactPropagateBackRightMotionTable, float* ContactPropagateBlendTime, class FName* ContactOutMotionName, float* ContactOutBlendTime, class FName* ContactOutReplaceBaseMotionName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MobPrefabTemplate_LookAtAndContact_03_C">();
	}
	static class AMobPrefabTemplate_LookAtAndContact_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMobPrefabTemplate_LookAtAndContact_03_C>();
	}
};
static_assert(alignof(AMobPrefabTemplate_LookAtAndContact_03_C) == 0x000010, "Wrong alignment on AMobPrefabTemplate_LookAtAndContact_03_C");
static_assert(sizeof(AMobPrefabTemplate_LookAtAndContact_03_C) == 0x000BC0, "Wrong size on AMobPrefabTemplate_LookAtAndContact_03_C");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, UberGraphFrame_MobPrefabTemplate_LookAtAndContact_03_C) == 0x000988, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::UberGraphFrame_MobPrefabTemplate_LookAtAndContact_03_C' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, CharacterClass03) == 0x000990, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::CharacterClass03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, LoopMotionName03) == 0x0009B8, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::LoopMotionName03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, AttachActor03) == 0x0009C0, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::AttachActor03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, AttachSocketName03) == 0x0009E8, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::AttachSocketName03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, EnableLookAt03) == 0x0009F0, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::EnableLookAt03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, EnableContact03) == 0x0009F1, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::EnableContact03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, ContactDuringReaction03) == 0x0009F2, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::ContactDuringReaction03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, ContactForwardLeftMotionName03) == 0x0009F4, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::ContactForwardLeftMotionName03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, ContactForwardRightMotionName03) == 0x0009FC, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::ContactForwardRightMotionName03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, ContactBackLeftMotionName03) == 0x000A04, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::ContactBackLeftMotionName03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, ContactBackRightMotionName03) == 0x000A0C, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::ContactBackRightMotionName03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, ContactBlendTime03) == 0x000A14, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::ContactBlendTime03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, ContactPropagateMotionTable03) == 0x000A18, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::ContactPropagateMotionTable03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, ContactPropagateForwardLeftMotionTable03) == 0x000A68, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::ContactPropagateForwardLeftMotionTable03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, ContactPropagateForwardRightMotionTable03) == 0x000AB8, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::ContactPropagateForwardRightMotionTable03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, ContactPropagateBackLeftMotionTable03) == 0x000B08, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::ContactPropagateBackLeftMotionTable03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, ContactPropagateBackRightMotionTable03) == 0x000B58, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::ContactPropagateBackRightMotionTable03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, ContactPropagateBlendTime03) == 0x000BA8, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::ContactPropagateBlendTime03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, ContactOutMotionName03) == 0x000BAC, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::ContactOutMotionName03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, ContactOutBlendTime03) == 0x000BB4, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::ContactOutBlendTime03' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_03_C, ContactOutReplaceBaseMotionName03) == 0x000BB8, "Member 'AMobPrefabTemplate_LookAtAndContact_03_C::ContactOutReplaceBaseMotionName03' has a wrong offset!");

}

