#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MobPrefabTemplate_LookAtAndContact_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MobPrefabBase01_Single_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MobPrefabTemplate_LookAtAndContact_01.MobPrefabTemplate_LookAtAndContact_01_C
// 0x0250 (0x0750 - 0x0500)
class AMobPrefabTemplate_LookAtAndContact_01_C : public AMobPrefabBase01_Single_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	TSoftClassPtr<class UClass>                   CharacterClass01;                                  // 0x0508(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   LoopMotionName01;                                  // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   AttachActor01;                                     // 0x0538(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   AttachSocketName01;                                // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableLookAt01;                                    // 0x0568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnableContact01;                                   // 0x0569(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ContactDuringReaction01;                           // 0x056A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56B[0x1];                                      // 0x056B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ContactForwardLeftMotionName01;                    // 0x056C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactForwardRightMotionName01;                   // 0x0574(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactBackLeftMotionName01;                       // 0x057C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactBackRightMotionName01;                      // 0x0584(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance_Threshold;                                // 0x058C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle_Threshold;                                   // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Height_Threshold;                                  // 0x0594(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Continuation_Time;                                 // 0x0598(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Target_Name;                                       // 0x059C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ContactBlendTime01;                                // 0x05A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FName>                ContactPropagateMotionTable01;                     // 0x05A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class FName>                ContactPropagateForwardLeftMotionTable01;          // 0x05F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class FName>                ContactPropagateForwardRightMotionTable01;         // 0x0648(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class FName>                ContactPropagateBackLeftMotionTable01;             // 0x0698(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class FName>                ContactPropagateBackRightMotionTable01;            // 0x06E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         ContactPropagateBlendTime01;                       // 0x0738(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactOutMotionName01;                            // 0x073C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ContactOutBlendTime01;                             // 0x0744(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactOutReplaceBaseMotionName01;                 // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MobPrefabTemplate_LookAtAndContact_01(int32 EntryPoint);
	void OnPreUpdateRegistry();
	void CreateMobCommand();
	void Initialize(class FName MobId, TSoftClassPtr<class UClass> CharacterClass, class FName LoopMotionName, const TSoftClassPtr<class UClass>& AttachActor, class FName AttachSocketName);
	void GetContext(class FName MobId, bool* EnableLookAt, bool* EnableContact, bool* ContactDuringReaction, class FName* ForwardLeftMotion, class FName* ForwardRightMotion, class FName* BackLeftMotion, class FName* BackRightMotion, float* ContactBlendTime, TMap<class FName, class FName>* ContactPropagateMotionTable, TMap<class FName, class FName>* ContactPropagateForwardLeftMotionTable, TMap<class FName, class FName>* ContactPropagateForwardRightMotionTable, TMap<class FName, class FName>* ContactPropagateBackLeftMotionTable, TMap<class FName, class FName>* ContactPropagateBackRightMotionTable, float* ContactPropagateBlendTime, class FName* ContactOutMotionName, float* ContactOutBlendTime, class FName* ContactOutReplaceBaseMotionName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MobPrefabTemplate_LookAtAndContact_01_C">();
	}
	static class AMobPrefabTemplate_LookAtAndContact_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMobPrefabTemplate_LookAtAndContact_01_C>();
	}
};
static_assert(alignof(AMobPrefabTemplate_LookAtAndContact_01_C) == 0x000010, "Wrong alignment on AMobPrefabTemplate_LookAtAndContact_01_C");
static_assert(sizeof(AMobPrefabTemplate_LookAtAndContact_01_C) == 0x000750, "Wrong size on AMobPrefabTemplate_LookAtAndContact_01_C");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, UberGraphFrame) == 0x000500, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, CharacterClass01) == 0x000508, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::CharacterClass01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, LoopMotionName01) == 0x000530, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::LoopMotionName01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, AttachActor01) == 0x000538, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::AttachActor01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, AttachSocketName01) == 0x000560, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::AttachSocketName01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, EnableLookAt01) == 0x000568, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::EnableLookAt01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, EnableContact01) == 0x000569, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::EnableContact01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, ContactDuringReaction01) == 0x00056A, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::ContactDuringReaction01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, ContactForwardLeftMotionName01) == 0x00056C, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::ContactForwardLeftMotionName01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, ContactForwardRightMotionName01) == 0x000574, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::ContactForwardRightMotionName01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, ContactBackLeftMotionName01) == 0x00057C, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::ContactBackLeftMotionName01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, ContactBackRightMotionName01) == 0x000584, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::ContactBackRightMotionName01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, Distance_Threshold) == 0x00058C, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::Distance_Threshold' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, Angle_Threshold) == 0x000590, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::Angle_Threshold' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, Height_Threshold) == 0x000594, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::Height_Threshold' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, Continuation_Time) == 0x000598, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::Continuation_Time' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, Target_Name) == 0x00059C, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::Target_Name' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, ContactBlendTime01) == 0x0005A4, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::ContactBlendTime01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, ContactPropagateMotionTable01) == 0x0005A8, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::ContactPropagateMotionTable01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, ContactPropagateForwardLeftMotionTable01) == 0x0005F8, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::ContactPropagateForwardLeftMotionTable01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, ContactPropagateForwardRightMotionTable01) == 0x000648, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::ContactPropagateForwardRightMotionTable01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, ContactPropagateBackLeftMotionTable01) == 0x000698, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::ContactPropagateBackLeftMotionTable01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, ContactPropagateBackRightMotionTable01) == 0x0006E8, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::ContactPropagateBackRightMotionTable01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, ContactPropagateBlendTime01) == 0x000738, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::ContactPropagateBlendTime01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, ContactOutMotionName01) == 0x00073C, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::ContactOutMotionName01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, ContactOutBlendTime01) == 0x000744, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::ContactOutBlendTime01' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_01_C, ContactOutReplaceBaseMotionName01) == 0x000748, "Member 'AMobPrefabTemplate_LookAtAndContact_01_C::ContactOutReplaceBaseMotionName01' has a wrong offset!");

}

