#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MobPrefabTemplate_MoveArround_01

#include "Basic.hpp"


namespace SDK::Params
{

// Function MobPrefabTemplate_MoveArround_01.MobPrefabTemplate_MoveArround_01_C.ExecuteUbergraph_MobPrefabTemplate_MoveArround_01
// 0x0044 (0x0044 - 0x0000)
struct MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddEmptyConditionCommand_ReturnValue;     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddMoveArroundExecuteCommand_ReturnValue; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01) == 0x000004, "Wrong alignment on MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01");
static_assert(sizeof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01) == 0x000044, "Wrong size on MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01");
static_assert(offsetof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01, EntryPoint) == 0x000000, "Member 'MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01, Temp_int_Array_Index_Variable) == 0x000014, "Member 'MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01, CallFunc_Array_Get_Item) == 0x000018, "Member 'MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01, CallFunc_AddEmptyConditionCommand_ReturnValue) == 0x000020, "Member 'MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01::CallFunc_AddEmptyConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01, CallFunc_Array_Get_Item_1) == 0x000034, "Member 'MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01, CallFunc_Less_IntInt_ReturnValue_1) == 0x00003C, "Member 'MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01, CallFunc_AddMoveArroundExecuteCommand_ReturnValue) == 0x000040, "Member 'MobPrefabTemplate_MoveArround_01_C_ExecuteUbergraph_MobPrefabTemplate_MoveArround_01::CallFunc_AddMoveArroundExecuteCommand_ReturnValue' has a wrong offset!");

}

