#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MobPrefabTemplate_LookAtAndContact_02

#include "Basic.hpp"

#include "MobPrefabTemplate_LookAtAndContact_01_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MobPrefabTemplate_LookAtAndContact_02.MobPrefabTemplate_LookAtAndContact_02_C
// 0x0240 (0x0990 - 0x0750)
#pragma pack(push, 0x1)
class alignas(0x10) AMobPrefabTemplate_LookAtAndContact_02_C : public AMobPrefabTemplate_LookAtAndContact_01_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MobPrefabTemplate_LookAtAndContact_02_C; // 0x0750(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	TSoftClassPtr<class UClass>                   CharacterClass02;                                  // 0x0758(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   LoopMotionName02;                                  // 0x0780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   AttachActor02;                                     // 0x0788(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   AttachSocketName02;                                // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableLookAt02;                                    // 0x07B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnableContact02;                                   // 0x07B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ContactDuringReaction02;                           // 0x07BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BB[0x1];                                      // 0x07BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ContactForwardLeftMotionName02;                    // 0x07BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactForwardRightMotionName02;                   // 0x07C4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactBackLeftMotionName02;                       // 0x07CC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactBackRightMotionName02;                      // 0x07D4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ContactBlendTime02;                                // 0x07DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FName>                ContactPropagateMotionTable02;                     // 0x07E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class FName>                ContactPropagateForwardLeftMotionTable02;          // 0x0830(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class FName>                ContactPropagateForwardRightMotionTable02;         // 0x0880(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class FName>                ContactPropagateBackLeftMotionTable02;             // 0x08D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class FName>                ContactPropagateBackRightMotionTable02;            // 0x0920(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         ContactPropagateBlendTime02;                       // 0x0970(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactOutMotionName02;                            // 0x0974(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ContactOutBlendTime02;                             // 0x097C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactOutReplaceBaseMotionName02;                 // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MobPrefabTemplate_LookAtAndContact_02(int32 EntryPoint);
	void OnPreUpdateRegistry();
	void GetContext(class FName MobId, bool* EnableLookAt, bool* EnableContact, bool* ContactDuringReaction, class FName* ForwardLeftMotion, class FName* ForwardRightMotion, class FName* BackLeftMotion, class FName* BackRightMotion, float* ContactBlendTime, TMap<class FName, class FName>* ContactPropagateMotionTable, TMap<class FName, class FName>* ContactPropagateForwardLeftMotionTable, TMap<class FName, class FName>* ContactPropagateForwardRightMotionTable, TMap<class FName, class FName>* ContactPropagateBackLeftMotionTable, TMap<class FName, class FName>* ContactPropagateBackRightMotionTable, float* ContactPropagateBlendTime, class FName* ContactOutMotionName, float* ContactOutBlendTime, class FName* ContactOutReplaceBaseMotionName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MobPrefabTemplate_LookAtAndContact_02_C">();
	}
	static class AMobPrefabTemplate_LookAtAndContact_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMobPrefabTemplate_LookAtAndContact_02_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(AMobPrefabTemplate_LookAtAndContact_02_C) == 0x000010, "Wrong alignment on AMobPrefabTemplate_LookAtAndContact_02_C");
static_assert(sizeof(AMobPrefabTemplate_LookAtAndContact_02_C) == 0x000990, "Wrong size on AMobPrefabTemplate_LookAtAndContact_02_C");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, UberGraphFrame_MobPrefabTemplate_LookAtAndContact_02_C) == 0x000750, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::UberGraphFrame_MobPrefabTemplate_LookAtAndContact_02_C' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, CharacterClass02) == 0x000758, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::CharacterClass02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, LoopMotionName02) == 0x000780, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::LoopMotionName02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, AttachActor02) == 0x000788, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::AttachActor02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, AttachSocketName02) == 0x0007B0, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::AttachSocketName02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, EnableLookAt02) == 0x0007B8, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::EnableLookAt02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, EnableContact02) == 0x0007B9, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::EnableContact02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, ContactDuringReaction02) == 0x0007BA, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::ContactDuringReaction02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, ContactForwardLeftMotionName02) == 0x0007BC, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::ContactForwardLeftMotionName02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, ContactForwardRightMotionName02) == 0x0007C4, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::ContactForwardRightMotionName02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, ContactBackLeftMotionName02) == 0x0007CC, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::ContactBackLeftMotionName02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, ContactBackRightMotionName02) == 0x0007D4, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::ContactBackRightMotionName02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, ContactBlendTime02) == 0x0007DC, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::ContactBlendTime02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, ContactPropagateMotionTable02) == 0x0007E0, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::ContactPropagateMotionTable02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, ContactPropagateForwardLeftMotionTable02) == 0x000830, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::ContactPropagateForwardLeftMotionTable02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, ContactPropagateForwardRightMotionTable02) == 0x000880, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::ContactPropagateForwardRightMotionTable02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, ContactPropagateBackLeftMotionTable02) == 0x0008D0, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::ContactPropagateBackLeftMotionTable02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, ContactPropagateBackRightMotionTable02) == 0x000920, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::ContactPropagateBackRightMotionTable02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, ContactPropagateBlendTime02) == 0x000970, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::ContactPropagateBlendTime02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, ContactOutMotionName02) == 0x000974, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::ContactOutMotionName02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, ContactOutBlendTime02) == 0x00097C, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::ContactOutBlendTime02' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_LookAtAndContact_02_C, ContactOutReplaceBaseMotionName02) == 0x000980, "Member 'AMobPrefabTemplate_LookAtAndContact_02_C::ContactOutReplaceBaseMotionName02' has a wrong offset!");

}

