#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MobPrefabTemplate_MoveArround_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MobPrefabTemplate_MoveArround_01.MobPrefabTemplate_MoveArround_01_C
// 0x0050 (0x0550 - 0x0500)
class AMobPrefabTemplate_MoveArround_01_C : public AEndMobPrefabActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	TSoftClassPtr<class UClass>                   Character_Class;                                   // 0x0508(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	float                                         Move_Radius;                                       // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Run_Rate;                                          // 0x0534(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Move_Distance_Range;                               // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Move_Wait_Time_Range;                              // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Move_Timeout;                                      // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Caution_Distance;                                  // 0x054C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MobPrefabTemplate_MoveArround_01(int32 EntryPoint);
	void OnPreUpdateRegistry();
	void CreateMobCommand();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MobPrefabTemplate_MoveArround_01_C">();
	}
	static class AMobPrefabTemplate_MoveArround_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMobPrefabTemplate_MoveArround_01_C>();
	}
};
static_assert(alignof(AMobPrefabTemplate_MoveArround_01_C) == 0x000010, "Wrong alignment on AMobPrefabTemplate_MoveArround_01_C");
static_assert(sizeof(AMobPrefabTemplate_MoveArround_01_C) == 0x000550, "Wrong size on AMobPrefabTemplate_MoveArround_01_C");
static_assert(offsetof(AMobPrefabTemplate_MoveArround_01_C, UberGraphFrame) == 0x000500, "Member 'AMobPrefabTemplate_MoveArround_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_MoveArround_01_C, Character_Class) == 0x000508, "Member 'AMobPrefabTemplate_MoveArround_01_C::Character_Class' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_MoveArround_01_C, Move_Radius) == 0x000530, "Member 'AMobPrefabTemplate_MoveArround_01_C::Move_Radius' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_MoveArround_01_C, Run_Rate) == 0x000534, "Member 'AMobPrefabTemplate_MoveArround_01_C::Run_Rate' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_MoveArround_01_C, Move_Distance_Range) == 0x000538, "Member 'AMobPrefabTemplate_MoveArround_01_C::Move_Distance_Range' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_MoveArround_01_C, Move_Wait_Time_Range) == 0x000540, "Member 'AMobPrefabTemplate_MoveArround_01_C::Move_Wait_Time_Range' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_MoveArround_01_C, Move_Timeout) == 0x000548, "Member 'AMobPrefabTemplate_MoveArround_01_C::Move_Timeout' has a wrong offset!");
static_assert(offsetof(AMobPrefabTemplate_MoveArround_01_C, Caution_Distance) == 0x00054C, "Member 'AMobPrefabTemplate_MoveArround_01_C::Caution_Distance' has a wrong offset!");

}

