#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MobPrefabTemplate_ReactionAndContact_01

#include "Basic.hpp"


namespace SDK::Params
{

// Function MobPrefabTemplate_ReactionAndContact_01.MobPrefabTemplate_ReactionAndContact_01_C.ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01
// 0x0230 (0x0230 - 0x0000)
struct MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddEmptyConditionCommand_ReturnValue;     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetContext_EnableReaction;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetContext_EnableContact;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetContext_ContactDuringReaction;         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetContext_ForwardLeftMotion;             // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_ForwardRightMotion;            // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_BackLeftMotion;                // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_BackRightMotion;               // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetContext_ContactBlendTime;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FName>                CallFunc_GetContext_ContactPropagateMotionTable;   // 0x0050(0x0050)()
	TMap<class FName, class FName>                CallFunc_GetContext_ContactPropagateForwardLeftMotionTable; // 0x00A0(0x0050)()
	TMap<class FName, class FName>                CallFunc_GetContext_ContactPropagateForwardRightMotionTable; // 0x00F0(0x0050)()
	TMap<class FName, class FName>                CallFunc_GetContext_ContactPropagateBackLeftMotionTable; // 0x0140(0x0050)()
	TMap<class FName, class FName>                CallFunc_GetContext_ContactPropagateBackRightMotionTable; // 0x0190(0x0050)()
	float                                         CallFunc_GetContext_ContactPropagateBlendTime;     // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_ContactOutMotionName;          // 0x01E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetContext_ContactOutBlendTime;           // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_ContactOutReplaceBaseMotionName; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_Motion;                        // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetContext_BlendTime;                     // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_ReplaceBaseMotion;             // 0x0204(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_ReactionOutMotionName;         // 0x020C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetContext_ReactionOutBlendTime;          // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetContext_ReactionOutReplaceBaseMotionName; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetContext_PlayMotionOnce;                // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddAllowContactPropagateExecuteCommand_ReturnValue; // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddAutoReactionToPartyExecuteCommand_ReturnValue; // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01) == 0x000008, "Wrong alignment on MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01");
static_assert(sizeof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01) == 0x000230, "Wrong size on MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, EntryPoint) == 0x000000, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_AddEmptyConditionCommand_ReturnValue) == 0x000010, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_AddEmptyConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, Temp_int_Array_Index_Variable) == 0x000018, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_Array_Get_Item) == 0x000020, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_EnableReaction) == 0x000028, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_EnableReaction' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_EnableContact) == 0x000029, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_EnableContact' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ContactDuringReaction) == 0x00002A, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ContactDuringReaction' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ForwardLeftMotion) == 0x00002C, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ForwardLeftMotion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ForwardRightMotion) == 0x000034, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ForwardRightMotion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_BackLeftMotion) == 0x00003C, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_BackLeftMotion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_BackRightMotion) == 0x000044, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_BackRightMotion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ContactBlendTime) == 0x00004C, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ContactBlendTime' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ContactPropagateMotionTable) == 0x000050, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ContactPropagateMotionTable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ContactPropagateForwardLeftMotionTable) == 0x0000A0, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ContactPropagateForwardLeftMotionTable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ContactPropagateForwardRightMotionTable) == 0x0000F0, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ContactPropagateForwardRightMotionTable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ContactPropagateBackLeftMotionTable) == 0x000140, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ContactPropagateBackLeftMotionTable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ContactPropagateBackRightMotionTable) == 0x000190, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ContactPropagateBackRightMotionTable' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ContactPropagateBlendTime) == 0x0001E0, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ContactPropagateBlendTime' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ContactOutMotionName) == 0x0001E4, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ContactOutMotionName' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ContactOutBlendTime) == 0x0001EC, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ContactOutBlendTime' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ContactOutReplaceBaseMotionName) == 0x0001F0, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ContactOutReplaceBaseMotionName' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_Motion) == 0x0001F8, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_Motion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_BlendTime) == 0x000200, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_BlendTime' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ReplaceBaseMotion) == 0x000204, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ReplaceBaseMotion' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ReactionOutMotionName) == 0x00020C, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ReactionOutMotionName' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ReactionOutBlendTime) == 0x000214, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ReactionOutBlendTime' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_ReactionOutReplaceBaseMotionName) == 0x000218, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_ReactionOutReplaceBaseMotionName' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_GetContext_PlayMotionOnce) == 0x000220, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_GetContext_PlayMotionOnce' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_AddAllowContactPropagateExecuteCommand_ReturnValue) == 0x000224, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_AddAllowContactPropagateExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_BooleanAND_ReturnValue) == 0x000228, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01, CallFunc_AddAutoReactionToPartyExecuteCommand_ReturnValue) == 0x00022C, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_ExecuteUbergraph_MobPrefabTemplate_ReactionAndContact_01::CallFunc_AddAutoReactionToPartyExecuteCommand_ReturnValue' has a wrong offset!");

// Function MobPrefabTemplate_ReactionAndContact_01.MobPrefabTemplate_ReactionAndContact_01_C.Initialize
// 0x0070 (0x0070 - 0x0000)
struct MobPrefabTemplate_ReactionAndContact_01_C_Initialize final
{
public:
	class FName                                   MobId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CharacterClass;                                    // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   LoopMotionName;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   AttachActor;                                       // 0x0038(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   AttachSocketName;                                  // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MobPrefabTemplate_ReactionAndContact_01_C_Initialize) == 0x000008, "Wrong alignment on MobPrefabTemplate_ReactionAndContact_01_C_Initialize");
static_assert(sizeof(MobPrefabTemplate_ReactionAndContact_01_C_Initialize) == 0x000070, "Wrong size on MobPrefabTemplate_ReactionAndContact_01_C_Initialize");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_Initialize, MobId) == 0x000000, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_Initialize::MobId' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_Initialize, CharacterClass) == 0x000008, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_Initialize::CharacterClass' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_Initialize, LoopMotionName) == 0x000030, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_Initialize::LoopMotionName' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_Initialize, AttachActor) == 0x000038, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_Initialize::AttachActor' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_Initialize, AttachSocketName) == 0x000060, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_Initialize::AttachSocketName' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_Initialize, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x000068, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_Initialize::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");

// Function MobPrefabTemplate_ReactionAndContact_01.MobPrefabTemplate_ReactionAndContact_01_C.GetContext
// 0x0208 (0x0208 - 0x0000)
struct MobPrefabTemplate_ReactionAndContact_01_C_GetContext final
{
public:
	class FName                                   MobId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableReaction;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          EnableContact;                                     // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ContactDuringReaction;                             // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ForwardLeftMotion;                                 // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ForwardRightMotion;                                // 0x0014(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BackLeftMotion;                                    // 0x001C(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BackRightMotion;                                   // 0x0024(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ContactBlendTime;                                  // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FName>                ContactPropagateMotionTable;                       // 0x0030(0x0050)(Parm, OutParm)
	TMap<class FName, class FName>                ContactPropagateForwardLeftMotionTable;            // 0x0080(0x0050)(Parm, OutParm)
	TMap<class FName, class FName>                ContactPropagateForwardRightMotionTable;           // 0x00D0(0x0050)(Parm, OutParm)
	TMap<class FName, class FName>                ContactPropagateBackLeftMotionTable;               // 0x0120(0x0050)(Parm, OutParm)
	TMap<class FName, class FName>                ContactPropagateBackRightMotionTable;              // 0x0170(0x0050)(Parm, OutParm)
	float                                         ContactPropagateBlendTime;                         // 0x01C0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactOutMotionName;                              // 0x01C4(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ContactOutBlendTime;                               // 0x01CC(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContactOutReplaceBaseMotionName;                   // 0x01D0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Motion;                                            // 0x01D8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendTime;                                         // 0x01E0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReplaceBaseMotion;                                 // 0x01E4(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReactionOutMotionName;                             // 0x01EC(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReactionOutBlendTime;                              // 0x01F4(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReactionOutReplaceBaseMotionName;                  // 0x01F8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayMotionOnce;                                    // 0x0200(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MobPrefabTemplate_ReactionAndContact_01_C_GetContext) == 0x000008, "Wrong alignment on MobPrefabTemplate_ReactionAndContact_01_C_GetContext");
static_assert(sizeof(MobPrefabTemplate_ReactionAndContact_01_C_GetContext) == 0x000208, "Wrong size on MobPrefabTemplate_ReactionAndContact_01_C_GetContext");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_GetContext, MobId) == 0x000000, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_GetContext::MobId' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_GetContext, EnableReaction) == 0x000008, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_GetContext::EnableReaction' has a wrong offset!");
static_assert(offsetof(MobPrefabTemplate_ReactionAndContact_01_C_GetContext, EnableContact) == 0x000009, "Member 'MobPrefabTemplate_ReactionAndContact_01_C_GetContext::EnableContact' has a wrong offset!");
