#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoogleHPGauge

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MoogleHPGauge.MoogleHPGauge_C
// 0x0050 (0x0418 - 0x03C8)
class UMoogleHPGauge_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       HP0_Out;                                           // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_00;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_00;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_LevelUp;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Light_Hrz;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Light_Vrt;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           Gauge_00;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Moogle;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MoogleHPGauge_C">();
	}
	static class UMoogleHPGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoogleHPGauge_C>();
	}
};
static_assert(alignof(UMoogleHPGauge_C) == 0x000008, "Wrong alignment on UMoogleHPGauge_C");
static_assert(sizeof(UMoogleHPGauge_C) == 0x000418, "Wrong size on UMoogleHPGauge_C");
static_assert(offsetof(UMoogleHPGauge_C, HP0_Out) == 0x0003C8, "Member 'UMoogleHPGauge_C::HP0_Out' has a wrong offset!");
static_assert(offsetof(UMoogleHPGauge_C, Out) == 0x0003D0, "Member 'UMoogleHPGauge_C::Out' has a wrong offset!");
static_assert(offsetof(UMoogleHPGauge_C, In) == 0x0003D8, "Member 'UMoogleHPGauge_C::In' has a wrong offset!");
static_assert(offsetof(UMoogleHPGauge_C, Base_00) == 0x0003E0, "Member 'UMoogleHPGauge_C::Base_00' has a wrong offset!");
static_assert(offsetof(UMoogleHPGauge_C, Effect_00) == 0x0003E8, "Member 'UMoogleHPGauge_C::Effect_00' has a wrong offset!");
static_assert(offsetof(UMoogleHPGauge_C, Effect_LevelUp) == 0x0003F0, "Member 'UMoogleHPGauge_C::Effect_LevelUp' has a wrong offset!");
static_assert(offsetof(UMoogleHPGauge_C, Effect_Light_Hrz) == 0x0003F8, "Member 'UMoogleHPGauge_C::Effect_Light_Hrz' has a wrong offset!");
static_assert(offsetof(UMoogleHPGauge_C, Effect_Light_Vrt) == 0x000400, "Member 'UMoogleHPGauge_C::Effect_Light_Vrt' has a wrong offset!");
static_assert(offsetof(UMoogleHPGauge_C, Gauge_00) == 0x000408, "Member 'UMoogleHPGauge_C::Gauge_00' has a wrong offset!");
static_assert(offsetof(UMoogleHPGauge_C, Icon_Moogle) == 0x000410, "Member 'UMoogleHPGauge_C::Icon_Moogle' has a wrong offset!");

}

