#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieSceneCapture

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum MovieSceneCapture.EHDRCaptureGamut
// NumValues: 0x0007
enum class EHDRCaptureGamut : uint8
{
	HCGM_Rec709                              = 0,
	HCGM_P3DCI                               = 1,
	HCGM_Rec2020                             = 2,
	HCGM_ACES                                = 3,
	HCGM_ACEScg                              = 4,
	HCGM_Linear                              = 5,
	HCGM_MAX                                 = 6,
};

// Enum MovieSceneCapture.EMovieSceneCaptureProtocolState
// NumValues: 0x0005
enum class EMovieSceneCaptureProtocolState : uint8
{
	Idle                                     = 0,
	Initialized                              = 1,
	Capturing                                = 2,
	Finalizing                               = 3,
	EMovieSceneCaptureProtocolState_MAX      = 4,
};

// Enum MovieSceneCapture.EMovieSceneCaptureAudioChannelTypes
// NumValues: 0x0004
enum class EMovieSceneCaptureAudioChannelTypes : uint8
{
	stereo                                   = 0,
	surround5_1                              = 1,
	surround7_1                              = 2,
	EMovieSceneCaptureAudioChannelTypes_MAX  = 3,
};

// Enum MovieSceneCapture.FMovieSceneCapturePostMixingAudioCodec
// NumValues: 0x0006
enum class EFMovieSceneCapturePostMixingAudioCodec : uint8
{
	none                                     = 0,
	pcm16                                    = 1,
	pcm24                                    = 2,
	mp3                                      = 3,
	vorbis                                   = 4,
	FMovieSceneCapturePostMixingAudioCodec_MAX = 5,
};

// Enum MovieSceneCapture.FMovieSceneCapturePostMixingVideoCodec
// NumValues: 0x0007
enum class EFMovieSceneCapturePostMixingVideoCodec : uint8
{
	none                                     = 0,
	mjpeg                                    = 1,
	libx264                                  = 2,
	h264                                     = 3,
	prores                                   = 4,
	prores_proxy                             = 5,
	FMovieSceneCapturePostMixingVideoCodec_MAX = 6,
};

// Enum MovieSceneCapture.FMovieSceneCapturePostMixingOutputFormat
// NumValues: 0x0004
enum class EFMovieSceneCapturePostMixingOutputFormat : uint8
{
	AVI                                      = 0,
	MP4                                      = 1,
	MOV                                      = 2,
	FMovieSceneCapturePostMixingOutputFormat_MAX = 3,
};

// ScriptStruct MovieSceneCapture.CompositionGraphCapturePasses
// 0x0010 (0x0010 - 0x0000)
struct FCompositionGraphCapturePasses final
{
public:
	TArray<class FString>                         Value;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCompositionGraphCapturePasses) == 0x000008, "Wrong alignment on FCompositionGraphCapturePasses");
static_assert(sizeof(FCompositionGraphCapturePasses) == 0x000010, "Wrong size on FCompositionGraphCapturePasses");
static_assert(offsetof(FCompositionGraphCapturePasses, Value) == 0x000000, "Member 'FCompositionGraphCapturePasses::Value' has a wrong offset!");

// ScriptStruct MovieSceneCapture.FrameMetrics
// 0x0010 (0x0010 - 0x0000)
struct FFrameMetrics final
{
public:
	float                                         TotalElapsedTime;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrameDelta;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameNumber;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumDroppedFrames;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFrameMetrics) == 0x000004, "Wrong alignment on FFrameMetrics");
static_assert(sizeof(FFrameMetrics) == 0x000010, "Wrong size on FFrameMetrics");
static_assert(offsetof(FFrameMetrics, TotalElapsedTime) == 0x000000, "Member 'FFrameMetrics::TotalElapsedTime' has a wrong offset!");
static_assert(offsetof(FFrameMetrics, FrameDelta) == 0x000004, "Member 'FFrameMetrics::FrameDelta' has a wrong offset!");
static_assert(offsetof(FFrameMetrics, FrameNumber) == 0x000008, "Member 'FFrameMetrics::FrameNumber' has a wrong offset!");
static_assert(offsetof(FFrameMetrics, NumDroppedFrames) == 0x00000C, "Member 'FFrameMetrics::NumDroppedFrames' has a wrong offset!");

// ScriptStruct MovieSceneCapture.CaptureResolution
// 0x0008 (0x0008 - 0x0000)
struct FCaptureResolution final
{
public:
	int32                                         ResX;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ResY;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCaptureResolution) == 0x000004, "Wrong alignment on FCaptureResolution");
static_assert(sizeof(FCaptureResolution) == 0x000008, "Wrong size on FCaptureResolution");
static_assert(offsetof(FCaptureResolution, ResX) == 0x000000, "Member 'FCaptureResolution::ResX' has a wrong offset!");
static_assert(offsetof(FCaptureResolution, ResY) == 0x000004, "Member 'FCaptureResolution::ResY' has a wrong offset!");

// ScriptStruct MovieSceneCapture.MovieSceneCaptureEncoding
// 0x0010 (0x0010 - 0x0000)
struct FMovieSceneCaptureEncoding final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DeleteSourcesAfterEncoding;                        // 0x0001(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFMovieSceneCapturePostMixingOutputFormat     Format;                                            // 0x0002(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFMovieSceneCapturePostMixingVideoCodec       VideoCodec;                                        // 0x0003(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        VideoBitrate;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFMovieSceneCapturePostMixingAudioCodec       AudioCodec;                                        // 0x0008(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        AudioRate;                                         // 0x000C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMovieSceneCaptureEncoding) == 0x000004, "Wrong alignment on FMovieSceneCaptureEncoding");
static_assert(sizeof(FMovieSceneCaptureEncoding) == 0x000010, "Wrong size on FMovieSceneCaptureEncoding");
static_assert(offsetof(FMovieSceneCaptureEncoding, Enabled) == 0x000000, "Member 'FMovieSceneCaptureEncoding::Enabled' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureEncoding, DeleteSourcesAfterEncoding) == 0x000001, "Member 'FMovieSceneCaptureEncoding::DeleteSourcesAfterEncoding' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureEncoding, Format) == 0x000002, "Member 'FMovieSceneCaptureEncoding::Format' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureEncoding, VideoCodec) == 0x000003, "Member 'FMovieSceneCaptureEncoding::VideoCodec' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureEncoding, VideoBitrate) == 0x000004, "Member 'FMovieSceneCaptureEncoding::VideoBitrate' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureEncoding, AudioCodec) == 0x000008, "Member 'FMovieSceneCaptureEncoding::AudioCodec' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureEncoding, AudioRate) == 0x00000C, "Member 'FMovieSceneCaptureEncoding::AudioRate' has a wrong offset!");

// ScriptStruct MovieSceneCapture.MovieSceneCaptureSettings
// 0x0098 (0x0098 - 0x0000)
struct FMovieSceneCaptureSettings final
{
public:
	struct FDirectoryPath                         OutputDirectory;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	TSubclassOf<class AGameModeBase>              GameModeOverride;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputFormat;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverwriteExisting;                                // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRelativeFrameNumbers;                          // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HandleFrames;                                      // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MovieExtension;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ZeroPadFrameNumbers;                               // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameRate                             FrameRate;                                         // 0x0044(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCustomFrameRate;                               // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameRate                             CustomFrameRate;                                   // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCaptureResolution                     Resolution;                                        // 0x0058(0x0008)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         FrameDelay;                                        // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDevelopmentMode;                                  // 0x0064(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureCompositeLayer;                            // 0x0065(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureAudio;                                     // 0x0066(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovieSceneCaptureAudioChannelTypes           CaptureAudioChennelType;                           // 0x0067(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureVoice;                                     // 0x0068(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureBGM;                                       // 0x0069(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureSubtitle;                                  // 0x006A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CaptureStartTimeInSeconds;                         // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CaptureEndTimeInSeconds;                           // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneCaptureEncoding             Encoding;                                          // 0x0074(0x0010)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ScreenPercentage;                                  // 0x0084(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabledGrain;                                     // 0x0088(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFullyLoadUsedTextures;                            // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableTextureStreaming;                           // 0x008A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCinematicEngineScalability;                       // 0x008B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCinematicMode;                                    // 0x008C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowMovement;                                    // 0x008D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowTurning;                                     // 0x008E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowPlayer;                                       // 0x008F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowHUD;                                          // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePathTracer;                                    // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PathTracerSamplePerPixel;                          // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMovieSceneCaptureSettings) == 0x000008, "Wrong alignment on FMovieSceneCaptureSettings");
static_assert(sizeof(FMovieSceneCaptureSettings) == 0x000098, "Wrong size on FMovieSceneCaptureSettings");
static_assert(offsetof(FMovieSceneCaptureSettings, OutputDirectory) == 0x000000, "Member 'FMovieSceneCaptureSettings::OutputDirectory' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, GameModeOverride) == 0x000010, "Member 'FMovieSceneCaptureSettings::GameModeOverride' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, OutputFormat) == 0x000018, "Member 'FMovieSceneCaptureSettings::OutputFormat' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bOverwriteExisting) == 0x000028, "Member 'FMovieSceneCaptureSettings::bOverwriteExisting' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bUseRelativeFrameNumbers) == 0x000029, "Member 'FMovieSceneCaptureSettings::bUseRelativeFrameNumbers' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, HandleFrames) == 0x00002C, "Member 'FMovieSceneCaptureSettings::HandleFrames' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, MovieExtension) == 0x000030, "Member 'FMovieSceneCaptureSettings::MovieExtension' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, ZeroPadFrameNumbers) == 0x000040, "Member 'FMovieSceneCaptureSettings::ZeroPadFrameNumbers' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, FrameRate) == 0x000044, "Member 'FMovieSceneCaptureSettings::FrameRate' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bUseCustomFrameRate) == 0x00004C, "Member 'FMovieSceneCaptureSettings::bUseCustomFrameRate' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, CustomFrameRate) == 0x000050, "Member 'FMovieSceneCaptureSettings::CustomFrameRate' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, Resolution) == 0x000058, "Member 'FMovieSceneCaptureSettings::Resolution' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, FrameDelay) == 0x000060, "Member 'FMovieSceneCaptureSettings::FrameDelay' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bDevelopmentMode) == 0x000064, "Member 'FMovieSceneCaptureSettings::bDevelopmentMode' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bCaptureCompositeLayer) == 0x000065, "Member 'FMovieSceneCaptureSettings::bCaptureCompositeLayer' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bCaptureAudio) == 0x000066, "Member 'FMovieSceneCaptureSettings::bCaptureAudio' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, CaptureAudioChennelType) == 0x000067, "Member 'FMovieSceneCaptureSettings::CaptureAudioChennelType' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bCaptureVoice) == 0x000068, "Member 'FMovieSceneCaptureSettings::bCaptureVoice' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bCaptureBGM) == 0x000069, "Member 'FMovieSceneCaptureSettings::bCaptureBGM' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bCaptureSubtitle) == 0x00006A, "Member 'FMovieSceneCaptureSettings::bCaptureSubtitle' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, CaptureStartTimeInSeconds) == 0x00006C, "Member 'FMovieSceneCaptureSettings::CaptureStartTimeInSeconds' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, CaptureEndTimeInSeconds) == 0x000070, "Member 'FMovieSceneCaptureSettings::CaptureEndTimeInSeconds' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, Encoding) == 0x000074, "Member 'FMovieSceneCaptureSettings::Encoding' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, ScreenPercentage) == 0x000084, "Member 'FMovieSceneCaptureSettings::ScreenPercentage' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bEnabledGrain) == 0x000088, "Member 'FMovieSceneCaptureSettings::bEnabledGrain' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bFullyLoadUsedTextures) == 0x000089, "Member 'FMovieSceneCaptureSettings::bFullyLoadUsedTextures' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bEnableTextureStreaming) == 0x00008A, "Member 'FMovieSceneCaptureSettings::bEnableTextureStreaming' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bCinematicEngineScalability) == 0x00008B, "Member 'FMovieSceneCaptureSettings::bCinematicEngineScalability' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bCinematicMode) == 0x00008C, "Member 'FMovieSceneCaptureSettings::bCinematicMode' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bAllowMovement) == 0x00008D, "Member 'FMovieSceneCaptureSettings::bAllowMovement' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bAllowTurning) == 0x00008E, "Member 'FMovieSceneCaptureSettings::bAllowTurning' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bShowPlayer) == 0x00008F, "Member 'FMovieSceneCaptureSettings::bShowPlayer' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bShowHUD) == 0x000090, "Member 'FMovieSceneCaptureSettings::bShowHUD' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, bUsePathTracer) == 0x000091, "Member 'FMovieSceneCaptureSettings::bUsePathTracer' has a wrong offset!");
static_assert(offsetof(FMovieSceneCaptureSettings, PathTracerSamplePerPixel) == 0x000094, "Member 'FMovieSceneCaptureSettings::PathTracerSamplePerPixel' has a wrong offset!");

// ScriptStruct MovieSceneCapture.CapturedPixels
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FCapturedPixels final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCapturedPixels) == 0x000008, "Wrong alignment on FCapturedPixels");
static_assert(sizeof(FCapturedPixels) == 0x000010, "Wrong size on FCapturedPixels");

// ScriptStruct MovieSceneCapture.CapturedPixelsID
// 0x0050 (0x0050 - 0x0000)
struct FCapturedPixelsID final
{
public:
	TMap<class FName, class FName>                Identifiers;                                       // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCapturedPixelsID) == 0x000008, "Wrong alignment on FCapturedPixelsID");
static_assert(sizeof(FCapturedPixelsID) == 0x000050, "Wrong size on FCapturedPixelsID");
static_assert(offsetof(FCapturedPixelsID, Identifiers) == 0x000000, "Member 'FCapturedPixelsID::Identifiers' has a wrong offset!");

}

