#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MPCost0_Effect

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MPCost0_Effect.MPCost0_Effect_C
// 0x0038 (0x0400 - 0x03C8)
class UMPCost0_Effect_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Effect_In_00;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Loop_00;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           Gauge_Time;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_MPCost0;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MPCost0_Effect_C">();
	}
	static class UMPCost0_Effect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMPCost0_Effect_C>();
	}
};
static_assert(alignof(UMPCost0_Effect_C) == 0x000008, "Wrong alignment on UMPCost0_Effect_C");
static_assert(sizeof(UMPCost0_Effect_C) == 0x000400, "Wrong size on UMPCost0_Effect_C");
static_assert(offsetof(UMPCost0_Effect_C, Out) == 0x0003C8, "Member 'UMPCost0_Effect_C::Out' has a wrong offset!");
static_assert(offsetof(UMPCost0_Effect_C, In) == 0x0003D0, "Member 'UMPCost0_Effect_C::In' has a wrong offset!");
static_assert(offsetof(UMPCost0_Effect_C, Loop) == 0x0003D8, "Member 'UMPCost0_Effect_C::Loop' has a wrong offset!");
static_assert(offsetof(UMPCost0_Effect_C, Effect_In_00) == 0x0003E0, "Member 'UMPCost0_Effect_C::Effect_In_00' has a wrong offset!");
static_assert(offsetof(UMPCost0_Effect_C, Effect_Loop_00) == 0x0003E8, "Member 'UMPCost0_Effect_C::Effect_Loop_00' has a wrong offset!");
static_assert(offsetof(UMPCost0_Effect_C, Gauge_Time) == 0x0003F0, "Member 'UMPCost0_Effect_C::Gauge_Time' has a wrong offset!");
static_assert(offsetof(UMPCost0_Effect_C, Icon_MPCost0) == 0x0003F8, "Member 'UMPCost0_Effect_C::Icon_MPCost0' has a wrong offset!");

}

