#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewSenseDetail

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NewSenseDetail.NewSenseDetail_C
// 0x0060 (0x0490 - 0x0430)
class UNewSenseDetail_C final : public UEndNewSenseDetailWindow
{
public:
	class UWidgetAnimation*                       Battle;                                            // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MainMenu;                                          // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MenuOff;                                           // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IconInfo_In;                                       // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UNewSenseBtnHelp_C*                     BtnHelp;                                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Filter;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Line_Left;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Line_Left_2;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Line_Right;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Line_Right_2;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewSenseDetail_C">();
	}
	static class UNewSenseDetail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNewSenseDetail_C>();
	}
};
static_assert(alignof(UNewSenseDetail_C) == 0x000008, "Wrong alignment on UNewSenseDetail_C");
static_assert(sizeof(UNewSenseDetail_C) == 0x000490, "Wrong size on UNewSenseDetail_C");
static_assert(offsetof(UNewSenseDetail_C, Battle) == 0x000430, "Member 'UNewSenseDetail_C::Battle' has a wrong offset!");
static_assert(offsetof(UNewSenseDetail_C, MainMenu) == 0x000438, "Member 'UNewSenseDetail_C::MainMenu' has a wrong offset!");
static_assert(offsetof(UNewSenseDetail_C, MenuOff) == 0x000440, "Member 'UNewSenseDetail_C::MenuOff' has a wrong offset!");
static_assert(offsetof(UNewSenseDetail_C, IconInfo_In) == 0x000448, "Member 'UNewSenseDetail_C::IconInfo_In' has a wrong offset!");
static_assert(offsetof(UNewSenseDetail_C, Out) == 0x000450, "Member 'UNewSenseDetail_C::Out' has a wrong offset!");
static_assert(offsetof(UNewSenseDetail_C, In) == 0x000458, "Member 'UNewSenseDetail_C::In' has a wrong offset!");
static_assert(offsetof(UNewSenseDetail_C, BtnHelp) == 0x000460, "Member 'UNewSenseDetail_C::BtnHelp' has a wrong offset!");
static_assert(offsetof(UNewSenseDetail_C, Img_Filter) == 0x000468, "Member 'UNewSenseDetail_C::Img_Filter' has a wrong offset!");
static_assert(offsetof(UNewSenseDetail_C, Line_Left) == 0x000470, "Member 'UNewSenseDetail_C::Line_Left' has a wrong offset!");
static_assert(offsetof(UNewSenseDetail_C, Line_Left_2) == 0x000478, "Member 'UNewSenseDetail_C::Line_Left_2' has a wrong offset!");
static_assert(offsetof(UNewSenseDetail_C, Line_Right) == 0x000480, "Member 'UNewSenseDetail_C::Line_Right' has a wrong offset!");
static_assert(offsetof(UNewSenseDetail_C, Line_Right_2) == 0x000488, "Member 'UNewSenseDetail_C::Line_Right_2' has a wrong offset!");

}

