#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewSenseIconInfo

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NewSenseIconInfo.NewSenseIconInfo_C
// 0x0038 (0x0438 - 0x0400)
class UNewSenseIconInfo_C final : public UEndNewSenseIconInfo
{
public:
	class UEndImage*                              Base;                                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_4;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_79;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_3;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         Line_4;                                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewSenseIconInfo_C">();
	}
	static class UNewSenseIconInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNewSenseIconInfo_C>();
	}
};
static_assert(alignof(UNewSenseIconInfo_C) == 0x000008, "Wrong alignment on UNewSenseIconInfo_C");
static_assert(sizeof(UNewSenseIconInfo_C) == 0x000438, "Wrong size on UNewSenseIconInfo_C");
static_assert(offsetof(UNewSenseIconInfo_C, Base) == 0x000400, "Member 'UNewSenseIconInfo_C::Base' has a wrong offset!");
static_assert(offsetof(UNewSenseIconInfo_C, Base1_4) == 0x000408, "Member 'UNewSenseIconInfo_C::Base1_4' has a wrong offset!");
static_assert(offsetof(UNewSenseIconInfo_C, EndImage_79) == 0x000410, "Member 'UNewSenseIconInfo_C::EndImage_79' has a wrong offset!");
static_assert(offsetof(UNewSenseIconInfo_C, Line_3) == 0x000418, "Member 'UNewSenseIconInfo_C::Line_3' has a wrong offset!");
static_assert(offsetof(UNewSenseIconInfo_C, Line_4) == 0x000420, "Member 'UNewSenseIconInfo_C::Line_4' has a wrong offset!");
static_assert(offsetof(UNewSenseIconInfo_C, Shadow) == 0x000428, "Member 'UNewSenseIconInfo_C::Shadow' has a wrong offset!");
static_assert(offsetof(UNewSenseIconInfo_C, Txt_Title) == 0x000430, "Member 'UNewSenseIconInfo_C::Txt_Title' has a wrong offset!");

}

