#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NIBLT_Triple_Move_HorizontalWait1_01_NP0114

#include "Basic.hpp"


namespace SDK::Params
{

// Function NIBLT_Triple_Move_HorizontalWait1_01_NP0114.NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C.ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114
// 0x0014 (0x0014 - 0x0000)
struct NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C_ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddTimerConditionCommand_ReturnValue;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddEventUnbindMessageCommand_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddEventUnbindMessageCommand_ReturnValue_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddEventUnbindMessageCommand_ReturnValue_2; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C_ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114) == 0x000004, "Wrong alignment on NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C_ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114");
static_assert(sizeof(NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C_ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114) == 0x000014, "Wrong size on NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C_ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114");
static_assert(offsetof(NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C_ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114, EntryPoint) == 0x000000, "Member 'NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C_ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114::EntryPoint' has a wrong offset!");
static_assert(offsetof(NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C_ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114, CallFunc_AddTimerConditionCommand_ReturnValue) == 0x000004, "Member 'NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C_ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114::CallFunc_AddTimerConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C_ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114, CallFunc_AddEventUnbindMessageCommand_ReturnValue) == 0x000008, "Member 'NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C_ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114::CallFunc_AddEventUnbindMessageCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C_ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114, CallFunc_AddEventUnbindMessageCommand_ReturnValue_1) == 0x00000C, "Member 'NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C_ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114::CallFunc_AddEventUnbindMessageCommand_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C_ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114, CallFunc_AddEventUnbindMessageCommand_ReturnValue_2) == 0x000010, "Member 'NIBLT_Triple_Move_HorizontalWait1_01_NP0114_C_ExecuteUbergraph_NIBLT_Triple_Move_HorizontalWait1_01_NP0114::CallFunc_AddEventUnbindMessageCommand_ReturnValue_2' has a wrong offset!");

}

