#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: obm1350_aljunon_1110_JNONT_Single_WipeMan01

#include "Basic.hpp"


namespace SDK::Params
{

// Function obm1350_aljunon_1110_JNONT_Single_WipeMan01.obm1350_aljunon_1110_JNONT_Single_WipeMan01_C.ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01
// 0x0014 (0x0014 - 0x0000)
struct obm1350_aljunon_1110_JNONT_Single_WipeMan01_C_ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddPartyPositionConditionCommand_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddEmptyConditionCommand_ReturnValue;     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtStartExecuteCommand_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtEndExecuteCommand_ReturnValue;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(obm1350_aljunon_1110_JNONT_Single_WipeMan01_C_ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01) == 0x000004, "Wrong alignment on obm1350_aljunon_1110_JNONT_Single_WipeMan01_C_ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01");
static_assert(sizeof(obm1350_aljunon_1110_JNONT_Single_WipeMan01_C_ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01) == 0x000014, "Wrong size on obm1350_aljunon_1110_JNONT_Single_WipeMan01_C_ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01");
static_assert(offsetof(obm1350_aljunon_1110_JNONT_Single_WipeMan01_C_ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01, EntryPoint) == 0x000000, "Member 'obm1350_aljunon_1110_JNONT_Single_WipeMan01_C_ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01::EntryPoint' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_1110_JNONT_Single_WipeMan01_C_ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01, CallFunc_AddPartyPositionConditionCommand_ReturnValue) == 0x000004, "Member 'obm1350_aljunon_1110_JNONT_Single_WipeMan01_C_ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01::CallFunc_AddPartyPositionConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_1110_JNONT_Single_WipeMan01_C_ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01, CallFunc_AddEmptyConditionCommand_ReturnValue) == 0x000008, "Member 'obm1350_aljunon_1110_JNONT_Single_WipeMan01_C_ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01::CallFunc_AddEmptyConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_1110_JNONT_Single_WipeMan01_C_ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01, CallFunc_AddLookAtStartExecuteCommand_ReturnValue) == 0x00000C, "Member 'obm1350_aljunon_1110_JNONT_Single_WipeMan01_C_ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01::CallFunc_AddLookAtStartExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_1110_JNONT_Single_WipeMan01_C_ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01, CallFunc_AddLookAtEndExecuteCommand_ReturnValue) == 0x000010, "Member 'obm1350_aljunon_1110_JNONT_Single_WipeMan01_C_ExecuteUbergraph_obm1350_aljunon_1110_JNONT_Single_WipeMan01::CallFunc_AddLookAtEndExecuteCommand_ReturnValue' has a wrong offset!");

}

