#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: obm1300_SquareArea_430_JUNOA_Single_Sitting01

#include "Basic.hpp"


namespace SDK::Params
{

// Function obm1300_SquareArea_430_JUNOA_Single_Sitting01.obm1300_SquareArea_430_JUNOA_Single_Sitting01_C.ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01
// 0x0020 (0x0020 - 0x0000)
struct obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactConditionCommand_ReturnValue;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactAnimationExecuteCommand_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddPartyPositionConditionCommand_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddEmptyConditionCommand_ReturnValue;     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddAnimationExecuteCommand_ReturnValue;   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtEndExecuteCommand_ReturnValue;   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtStartExecuteCommand_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01) == 0x000004, "Wrong alignment on obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01");
static_assert(sizeof(obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01) == 0x000020, "Wrong size on obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01");
static_assert(offsetof(obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01, EntryPoint) == 0x000000, "Member 'obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01::EntryPoint' has a wrong offset!");
static_assert(offsetof(obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01, CallFunc_AddContactConditionCommand_ReturnValue) == 0x000004, "Member 'obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01::CallFunc_AddContactConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01, CallFunc_AddContactAnimationExecuteCommand_ReturnValue) == 0x000008, "Member 'obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01::CallFunc_AddContactAnimationExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01, CallFunc_AddPartyPositionConditionCommand_ReturnValue) == 0x00000C, "Member 'obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01::CallFunc_AddPartyPositionConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01, CallFunc_AddEmptyConditionCommand_ReturnValue) == 0x000010, "Member 'obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01::CallFunc_AddEmptyConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01, CallFunc_AddAnimationExecuteCommand_ReturnValue) == 0x000014, "Member 'obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01::CallFunc_AddAnimationExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01, CallFunc_AddLookAtEndExecuteCommand_ReturnValue) == 0x000018, "Member 'obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01::CallFunc_AddLookAtEndExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01, CallFunc_AddLookAtStartExecuteCommand_ReturnValue) == 0x00001C, "Member 'obm1300_SquareArea_430_JUNOA_Single_Sitting01_C_ExecuteUbergraph_obm1300_SquareArea_430_JUNOA_Single_Sitting01::CallFunc_AddLookAtStartExecuteCommand_ReturnValue' has a wrong offset!");

}

