#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: obm1200_FarmArea_060_GRASA_Single_CarryFeed01

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function obm1200_FarmArea_060_GRASA_Single_CarryFeed01.obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C.ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01
// 0x0090 (0x0090 - 0x0000)
struct obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddEmptyConditionCommand_ReturnValue;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem; // 0x0008(0x0010)(NoDestructor)
	int32                                         CallFunc_AddLookAtEndExecuteCommand_ReturnValue;   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1; // 0x001C(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2; // 0x002C(0x0010)(NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEndMobPrefabRandomAnimationExecuteItem> K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3; // 0x0050(0x0010)(NoDestructor)
	int32                                         CallFunc_AddRandomAnimationExecuteCommand_ReturnValue; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEndMobPrefabRandomAnimationExecuteItem> K2Node_MakeArray_Array_1;                          // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddPartyPositionConditionCommand_ReturnValue; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactConditionCommand_ReturnValue;   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddTimerConditionCommand_ReturnValue;     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactAnimationExecuteCommand_ReturnValue; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_1; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtStartExecuteCommand_ReturnValue; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01) == 0x000008, "Wrong alignment on obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01");
static_assert(sizeof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01) == 0x000090, "Wrong size on obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, EntryPoint) == 0x000000, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::EntryPoint' has a wrong offset!");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, CallFunc_AddEmptyConditionCommand_ReturnValue) == 0x000004, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::CallFunc_AddEmptyConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem) == 0x000008, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem' has a wrong offset!");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, CallFunc_AddLookAtEndExecuteCommand_ReturnValue) == 0x000018, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::CallFunc_AddLookAtEndExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1) == 0x00001C, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1' has a wrong offset!");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2) == 0x00002C, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2' has a wrong offset!");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, K2Node_MakeArray_Array) == 0x000040, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3) == 0x000050, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3' has a wrong offset!");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, CallFunc_AddRandomAnimationExecuteCommand_ReturnValue) == 0x000060, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::CallFunc_AddRandomAnimationExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, K2Node_MakeArray_Array_1) == 0x000068, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, CallFunc_AddPartyPositionConditionCommand_ReturnValue) == 0x000078, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::CallFunc_AddPartyPositionConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, CallFunc_AddContactConditionCommand_ReturnValue) == 0x00007C, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::CallFunc_AddContactConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, CallFunc_AddTimerConditionCommand_ReturnValue) == 0x000080, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::CallFunc_AddTimerConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, CallFunc_AddContactAnimationExecuteCommand_ReturnValue) == 0x000084, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::CallFunc_AddContactAnimationExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_1) == 0x000088, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::CallFunc_AddRandomAnimationExecuteCommand_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01, CallFunc_AddLookAtStartExecuteCommand_ReturnValue) == 0x00008C, "Member 'obm1200_FarmArea_060_GRASA_Single_CarryFeed01_C_ExecuteUbergraph_obm1200_FarmArea_060_GRASA_Single_CarryFeed01::CallFunc_AddLookAtStartExecuteCommand_ReturnValue' has a wrong offset!");

}

