#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: obm1350_aljunon_610_JNONT_Double_CoupleWomen01

#include "Basic.hpp"


namespace SDK::Params
{

// Function obm1350_aljunon_610_JNONT_Double_CoupleWomen01.obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C.ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01
// 0x0034 (0x0034 - 0x0000)
struct obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactConditionCommand_ReturnValue;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactConditionCommand_ReturnValue_1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactAnimationExecuteCommand_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactAnimationExecuteCommand_ReturnValue_1; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactAnimationExecuteCommand_ReturnValue_2; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactAnimationExecuteCommand_ReturnValue_3; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddPartyPositionConditionCommand_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtStartExecuteCommand_ReturnValue; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtStartExecuteCommand_ReturnValue_1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddEmptyConditionCommand_ReturnValue;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtEndExecuteCommand_ReturnValue;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtEndExecuteCommand_ReturnValue_1; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01) == 0x000004, "Wrong alignment on obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01");
static_assert(sizeof(obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01) == 0x000034, "Wrong size on obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01");
static_assert(offsetof(obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01, EntryPoint) == 0x000000, "Member 'obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01::EntryPoint' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01, CallFunc_AddContactConditionCommand_ReturnValue) == 0x000004, "Member 'obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01::CallFunc_AddContactConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01, CallFunc_AddContactConditionCommand_ReturnValue_1) == 0x000008, "Member 'obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01::CallFunc_AddContactConditionCommand_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01, CallFunc_AddContactAnimationExecuteCommand_ReturnValue) == 0x00000C, "Member 'obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01::CallFunc_AddContactAnimationExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01, CallFunc_AddContactAnimationExecuteCommand_ReturnValue_1) == 0x000010, "Member 'obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01::CallFunc_AddContactAnimationExecuteCommand_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01, CallFunc_AddContactAnimationExecuteCommand_ReturnValue_2) == 0x000014, "Member 'obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01::CallFunc_AddContactAnimationExecuteCommand_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01, CallFunc_AddContactAnimationExecuteCommand_ReturnValue_3) == 0x000018, "Member 'obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01::CallFunc_AddContactAnimationExecuteCommand_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01, CallFunc_AddPartyPositionConditionCommand_ReturnValue) == 0x00001C, "Member 'obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01::CallFunc_AddPartyPositionConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01, CallFunc_AddLookAtStartExecuteCommand_ReturnValue) == 0x000020, "Member 'obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01::CallFunc_AddLookAtStartExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01, CallFunc_AddLookAtStartExecuteCommand_ReturnValue_1) == 0x000024, "Member 'obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01::CallFunc_AddLookAtStartExecuteCommand_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01, CallFunc_AddEmptyConditionCommand_ReturnValue) == 0x000028, "Member 'obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01::CallFunc_AddEmptyConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01, CallFunc_AddLookAtEndExecuteCommand_ReturnValue) == 0x00002C, "Member 'obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01::CallFunc_AddLookAtEndExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01, CallFunc_AddLookAtEndExecuteCommand_ReturnValue_1) == 0x000030, "Member 'obm1350_aljunon_610_JNONT_Double_CoupleWomen01_C_ExecuteUbergraph_obm1350_aljunon_610_JNONT_Double_CoupleWomen01::CallFunc_AddLookAtEndExecuteCommand_ReturnValue_1' has a wrong offset!");

}

