#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01.obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C.ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01
// 0x0078 (0x0078 - 0x0000)
struct obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem; // 0x0004(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1; // 0x0014(0x0010)(NoDestructor)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2; // 0x0024(0x0010)(NoDestructor, UObjectWrapper)
	struct FEndMobPrefabRandomAnimationExecuteItem K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3; // 0x0034(0x0010)(NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEndMobPrefabRandomAnimationExecuteItem> K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddContactConditionCommand_ReturnValue;   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddContactAnimationExecuteCommand_ReturnValue; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddPartyPositionConditionCommand_ReturnValue; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddEmptyConditionCommand_ReturnValue;     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddRandomAnimationExecuteCommand_ReturnValue; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtEndExecuteCommand_ReturnValue;   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLookAtStartExecuteCommand_ReturnValue; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01) == 0x000008, "Wrong alignment on obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01");
static_assert(sizeof(obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01) == 0x000078, "Wrong size on obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01");
static_assert(offsetof(obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01, EntryPoint) == 0x000000, "Member 'obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01::EntryPoint' has a wrong offset!");
static_assert(offsetof(obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem) == 0x000004, "Member 'obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem' has a wrong offset!");
static_assert(offsetof(obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1) == 0x000014, "Member 'obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_1' has a wrong offset!");
static_assert(offsetof(obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2) == 0x000024, "Member 'obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_2' has a wrong offset!");
static_assert(offsetof(obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01, K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3) == 0x000034, "Member 'obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01::K2Node_MakeStruct_EndMobPrefabRandomAnimationExecuteItem_3' has a wrong offset!");
static_assert(offsetof(obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01, K2Node_MakeArray_Array) == 0x000048, "Member 'obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01, CallFunc_AddContactConditionCommand_ReturnValue) == 0x000058, "Member 'obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01::CallFunc_AddContactConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01, CallFunc_AddContactAnimationExecuteCommand_ReturnValue) == 0x00005C, "Member 'obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01::CallFunc_AddContactAnimationExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01, CallFunc_AddPartyPositionConditionCommand_ReturnValue) == 0x000060, "Member 'obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01::CallFunc_AddPartyPositionConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01, CallFunc_AddEmptyConditionCommand_ReturnValue) == 0x000064, "Member 'obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01::CallFunc_AddEmptyConditionCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01, CallFunc_AddRandomAnimationExecuteCommand_ReturnValue) == 0x000068, "Member 'obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01::CallFunc_AddRandomAnimationExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01, CallFunc_AddLookAtEndExecuteCommand_ReturnValue) == 0x00006C, "Member 'obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01::CallFunc_AddLookAtEndExecuteCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01, CallFunc_AddLookAtStartExecuteCommand_ReturnValue) == 0x000070, "Member 'obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01_C_ExecuteUbergraph_obm2610_SquareAreaAfter_950_NIBLT_Single_NekoQst01::CallFunc_AddLookAtStartExecuteCommand_ReturnValue' has a wrong offset!");

}

