#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: One200_GRASA

#include "Basic.hpp"


namespace SDK::Params
{

// Function 1200-GRASA.1200-GRASA_C.ExecuteUbergraph_1200-GRASA
// 0x0014 (0x0014 - 0x0000)
struct One200_GRASA_C_ExecuteUbergraph_1200_GRASA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_value;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChapterProgress_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(One200_GRASA_C_ExecuteUbergraph_1200_GRASA) == 0x000004, "Wrong alignment on One200_GRASA_C_ExecuteUbergraph_1200_GRASA");
static_assert(sizeof(One200_GRASA_C_ExecuteUbergraph_1200_GRASA) == 0x000014, "Wrong size on One200_GRASA_C_ExecuteUbergraph_1200_GRASA");
static_assert(offsetof(One200_GRASA_C_ExecuteUbergraph_1200_GRASA, EntryPoint) == 0x000000, "Member 'One200_GRASA_C_ExecuteUbergraph_1200_GRASA::EntryPoint' has a wrong offset!");
static_assert(offsetof(One200_GRASA_C_ExecuteUbergraph_1200_GRASA, K2Node_Event_value) == 0x000004, "Member 'One200_GRASA_C_ExecuteUbergraph_1200_GRASA::K2Node_Event_value' has a wrong offset!");
static_assert(offsetof(One200_GRASA_C_ExecuteUbergraph_1200_GRASA, CallFunc_GetChapterProgress_ReturnValue) == 0x000008, "Member 'One200_GRASA_C_ExecuteUbergraph_1200_GRASA::CallFunc_GetChapterProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(One200_GRASA_C_ExecuteUbergraph_1200_GRASA, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'One200_GRASA_C_ExecuteUbergraph_1200_GRASA::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(One200_GRASA_C_ExecuteUbergraph_1200_GRASA, CallFunc_Less_IntInt_ReturnValue_1) == 0x00000D, "Member 'One200_GRASA_C_ExecuteUbergraph_1200_GRASA::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(One200_GRASA_C_ExecuteUbergraph_1200_GRASA, CallFunc_Less_IntInt_ReturnValue_2) == 0x00000E, "Member 'One200_GRASA_C_ExecuteUbergraph_1200_GRASA::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(One200_GRASA_C_ExecuteUbergraph_1200_GRASA, CallFunc_Less_IntInt_ReturnValue_3) == 0x00000F, "Member 'One200_GRASA_C_ExecuteUbergraph_1200_GRASA::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(One200_GRASA_C_ExecuteUbergraph_1200_GRASA, CallFunc_Less_IntInt_ReturnValue_4) == 0x000010, "Member 'One200_GRASA_C_ExecuteUbergraph_1200_GRASA::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(One200_GRASA_C_ExecuteUbergraph_1200_GRASA, CallFunc_Less_IntInt_ReturnValue_5) == 0x000011, "Member 'One200_GRASA_C_ExecuteUbergraph_1200_GRASA::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(One200_GRASA_C_ExecuteUbergraph_1200_GRASA, CallFunc_Less_IntInt_ReturnValue_6) == 0x000012, "Member 'One200_GRASA_C_ExecuteUbergraph_1200_GRASA::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");

// Function 1200-GRASA.1200-GRASA_C.OnSetChapterProgress
// 0x0004 (0x0004 - 0x0000)
struct One200_GRASA_C_OnSetChapterProgress final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(One200_GRASA_C_OnSetChapterProgress) == 0x000004, "Wrong alignment on One200_GRASA_C_OnSetChapterProgress");
static_assert(sizeof(One200_GRASA_C_OnSetChapterProgress) == 0x000004, "Wrong size on One200_GRASA_C_OnSetChapterProgress");
static_assert(offsetof(One200_GRASA_C_OnSetChapterProgress, Value) == 0x000000, "Member 'One200_GRASA_C_OnSetChapterProgress::Value' has a wrong offset!");

}

