#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_Bench_Wood_Multi_05A_Physics

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass P_Bench_Wood_Multi_05A_Physics.P_Bench_Wood_Multi_05A_Physics_C
// 0x00C0 (0x08A8 - 0x07E8)
class AP_Bench_Wood_Multi_05A_Physics_C final : public AEndEnvironmentPhysicsStaticMeshActor
{
public:
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_24_Physics;                   // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_23_Physics;                   // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_22_Physics;                   // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_21_Physics;                   // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_20_Physics;                   // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_19_Physics;                   // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_18_Physics;                   // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_17_Physics;                   // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_16_Physics;                   // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_15_Physics;                   // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_14_Physics;                   // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_13_Physics;                   // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_12_Physics;                   // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_11_Physics;                   // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_10_Physics;                   // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_9_Physics;                    // 0x0860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_8_Physics;                    // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_7_Physics;                    // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_6_Physics;                    // 0x0878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_5_Physics;                    // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_4_Physics1;                   // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_3_Physics1;                   // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_2_Physics1;                   // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Bench_Wood_Multi_05A_1_Physics1;                   // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"P_Bench_Wood_Multi_05A_Physics_C">();
	}
	static class AP_Bench_Wood_Multi_05A_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AP_Bench_Wood_Multi_05A_Physics_C>();
	}
};
static_assert(alignof(AP_Bench_Wood_Multi_05A_Physics_C) == 0x000008, "Wrong alignment on AP_Bench_Wood_Multi_05A_Physics_C");
static_assert(sizeof(AP_Bench_Wood_Multi_05A_Physics_C) == 0x0008A8, "Wrong size on AP_Bench_Wood_Multi_05A_Physics_C");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_24_Physics) == 0x0007E8, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_24_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_23_Physics) == 0x0007F0, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_23_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_22_Physics) == 0x0007F8, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_22_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_21_Physics) == 0x000800, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_21_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_20_Physics) == 0x000808, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_20_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_19_Physics) == 0x000810, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_19_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_18_Physics) == 0x000818, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_18_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_17_Physics) == 0x000820, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_17_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_16_Physics) == 0x000828, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_16_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_15_Physics) == 0x000830, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_15_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_14_Physics) == 0x000838, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_14_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_13_Physics) == 0x000840, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_13_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_12_Physics) == 0x000848, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_12_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_11_Physics) == 0x000850, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_11_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_10_Physics) == 0x000858, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_10_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_9_Physics) == 0x000860, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_9_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_8_Physics) == 0x000868, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_8_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_7_Physics) == 0x000870, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_7_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_6_Physics) == 0x000878, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_6_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_5_Physics) == 0x000880, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_5_Physics' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_4_Physics1) == 0x000888, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_4_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_3_Physics1) == 0x000890, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_3_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_2_Physics1) == 0x000898, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_2_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Bench_Wood_Multi_05A_Physics_C, Bench_Wood_Multi_05A_1_Physics1) == 0x0008A0, "Member 'AP_Bench_Wood_Multi_05A_Physics_C::Bench_Wood_Multi_05A_1_Physics1' has a wrong offset!");

}

