#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_Facility_Barrel_Multi_01A_a_Physics

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass P_Facility_Barrel_Multi_01A_a_Physics.P_Facility_Barrel_Multi_01A_a_Physics_C
// 0x00D8 (0x08C0 - 0x07E8)
class AP_Facility_Barrel_Multi_01A_a_Physics_C final : public AEndEnvironmentPhysicsStaticMeshActor
{
public:
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_9_Physics1;              // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_8_Physics1;              // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_7_Physics1;              // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_6_Physics1;              // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_5_Physics1;              // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_4_Physics1;              // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_3_Physics1;              // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_2_Physics1;              // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_27_Physics1;             // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_26_Physics1;             // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_25_Physics1;             // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_24_Physics1;             // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_23_Physics1;             // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_22_Physics1;             // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_21_Physics1;             // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_20_Physics1;             // 0x0860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_1_Physics1;              // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_19_Physics1;             // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_18_Physics1;             // 0x0878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_17_Physics1;             // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_16_Physics1;             // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_15_Physics1;             // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_14_Physics1;             // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_13_Physics1;             // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_12_Physics1;             // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_11_Physics1;             // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Facility_Barrel_Multi_01A_10_Physics1;             // 0x08B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"P_Facility_Barrel_Multi_01A_a_Physics_C">();
	}
	static class AP_Facility_Barrel_Multi_01A_a_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AP_Facility_Barrel_Multi_01A_a_Physics_C>();
	}
};
static_assert(alignof(AP_Facility_Barrel_Multi_01A_a_Physics_C) == 0x000008, "Wrong alignment on AP_Facility_Barrel_Multi_01A_a_Physics_C");
static_assert(sizeof(AP_Facility_Barrel_Multi_01A_a_Physics_C) == 0x0008C0, "Wrong size on AP_Facility_Barrel_Multi_01A_a_Physics_C");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_9_Physics1) == 0x0007E8, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_9_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_8_Physics1) == 0x0007F0, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_8_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_7_Physics1) == 0x0007F8, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_7_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_6_Physics1) == 0x000800, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_6_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_5_Physics1) == 0x000808, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_5_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_4_Physics1) == 0x000810, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_4_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_3_Physics1) == 0x000818, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_3_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_2_Physics1) == 0x000820, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_2_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_27_Physics1) == 0x000828, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_27_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_26_Physics1) == 0x000830, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_26_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_25_Physics1) == 0x000838, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_25_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_24_Physics1) == 0x000840, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_24_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_23_Physics1) == 0x000848, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_23_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_22_Physics1) == 0x000850, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_22_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_21_Physics1) == 0x000858, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_21_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_20_Physics1) == 0x000860, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_20_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_1_Physics1) == 0x000868, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_1_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_19_Physics1) == 0x000870, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_19_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_18_Physics1) == 0x000878, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_18_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_17_Physics1) == 0x000880, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_17_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_16_Physics1) == 0x000888, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_16_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_15_Physics1) == 0x000890, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_15_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_14_Physics1) == 0x000898, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_14_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_13_Physics1) == 0x0008A0, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_13_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_12_Physics1) == 0x0008A8, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_12_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_11_Physics1) == 0x0008B0, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_11_Physics1' has a wrong offset!");
static_assert(offsetof(AP_Facility_Barrel_Multi_01A_a_Physics_C, Facility_Barrel_Multi_01A_10_Physics1) == 0x0008B8, "Member 'AP_Facility_Barrel_Multi_01A_a_Physics_C::Facility_Barrel_Multi_01A_10_Physics1' has a wrong offset!");

}

