#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_Fence_Barricade_Multi_07A_Physics

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass P_Fence_Barricade_Multi_07A_Physics.P_Fence_Barricade_Multi_07A_Physics_C
// 0x0030 (0x0818 - 0x07E8)
class AP_Fence_Barricade_Multi_07A_Physics_C final : public AEndEnvironmentPhysicsStaticMeshActor
{
public:
	class UEndStaticMeshPhysicsPartsComponent*    Fence_Barricade_Multi_07A_6_Physics;               // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Fence_Barricade_Multi_07A_5_Physics;               // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Fence_Barricade_Multi_07A_4_Physics;               // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Fence_Barricade_Multi_07A_3_Physics;               // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Fence_Barricade_Multi_07A_2_Physics;               // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Fence_Barricade_Multi_07A_1_Physics;               // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"P_Fence_Barricade_Multi_07A_Physics_C">();
	}
	static class AP_Fence_Barricade_Multi_07A_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AP_Fence_Barricade_Multi_07A_Physics_C>();
	}
};
static_assert(alignof(AP_Fence_Barricade_Multi_07A_Physics_C) == 0x000008, "Wrong alignment on AP_Fence_Barricade_Multi_07A_Physics_C");
static_assert(sizeof(AP_Fence_Barricade_Multi_07A_Physics_C) == 0x000818, "Wrong size on AP_Fence_Barricade_Multi_07A_Physics_C");
static_assert(offsetof(AP_Fence_Barricade_Multi_07A_Physics_C, Fence_Barricade_Multi_07A_6_Physics) == 0x0007E8, "Member 'AP_Fence_Barricade_Multi_07A_Physics_C::Fence_Barricade_Multi_07A_6_Physics' has a wrong offset!");
static_assert(offsetof(AP_Fence_Barricade_Multi_07A_Physics_C, Fence_Barricade_Multi_07A_5_Physics) == 0x0007F0, "Member 'AP_Fence_Barricade_Multi_07A_Physics_C::Fence_Barricade_Multi_07A_5_Physics' has a wrong offset!");
static_assert(offsetof(AP_Fence_Barricade_Multi_07A_Physics_C, Fence_Barricade_Multi_07A_4_Physics) == 0x0007F8, "Member 'AP_Fence_Barricade_Multi_07A_Physics_C::Fence_Barricade_Multi_07A_4_Physics' has a wrong offset!");
static_assert(offsetof(AP_Fence_Barricade_Multi_07A_Physics_C, Fence_Barricade_Multi_07A_3_Physics) == 0x000800, "Member 'AP_Fence_Barricade_Multi_07A_Physics_C::Fence_Barricade_Multi_07A_3_Physics' has a wrong offset!");
static_assert(offsetof(AP_Fence_Barricade_Multi_07A_Physics_C, Fence_Barricade_Multi_07A_2_Physics) == 0x000808, "Member 'AP_Fence_Barricade_Multi_07A_Physics_C::Fence_Barricade_Multi_07A_2_Physics' has a wrong offset!");
static_assert(offsetof(AP_Fence_Barricade_Multi_07A_Physics_C, Fence_Barricade_Multi_07A_1_Physics) == 0x000810, "Member 'AP_Fence_Barricade_Multi_07A_Physics_C::Fence_Barricade_Multi_07A_1_Physics' has a wrong offset!");

}

