#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_TBCommon_Shuriken_01A_Physics

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass P_TBCommon_Shuriken_01A_Physics.P_TBCommon_Shuriken_01A_Physics_C
// 0x00C0 (0x0910 - 0x0850)
class alignas(0x10) AP_TBCommon_Shuriken_01A_Physics_C final : public AEndTreasureShinraBox
{
public:
	class UEndFieldActionShootingTargetComponent* EndFieldActionShootingTarget;                      // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_9_Physics;                   // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_8_Physics;                   // 0x0860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_7_Physics;                   // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_6_Physics;                   // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_5_Physics;                   // 0x0878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_4_Physics;                   // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_3_Physics;                   // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_2_Physics;                   // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_22_Physics;                  // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_21_Physics;                  // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_20_Physics;                  // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_1_Physics;                   // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_19_Physics;                  // 0x08B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_18_Physics;                  // 0x08C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_17_Physics;                  // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_16_Physics;                  // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_15_Physics;                  // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_14_Physics;                  // 0x08E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_13_Physics;                  // 0x08E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_12_Physics;                  // 0x08F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_11_Physics;                  // 0x08F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBCommon_WoodDirt_01A_10_Physics;                  // 0x0900(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"P_TBCommon_Shuriken_01A_Physics_C">();
	}
	static class AP_TBCommon_Shuriken_01A_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AP_TBCommon_Shuriken_01A_Physics_C>();
	}
};
static_assert(alignof(AP_TBCommon_Shuriken_01A_Physics_C) == 0x000010, "Wrong alignment on AP_TBCommon_Shuriken_01A_Physics_C");
static_assert(sizeof(AP_TBCommon_Shuriken_01A_Physics_C) == 0x000910, "Wrong size on AP_TBCommon_Shuriken_01A_Physics_C");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, EndFieldActionShootingTarget) == 0x000850, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::EndFieldActionShootingTarget' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_9_Physics) == 0x000858, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_9_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_8_Physics) == 0x000860, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_8_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_7_Physics) == 0x000868, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_7_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_6_Physics) == 0x000870, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_6_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_5_Physics) == 0x000878, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_5_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_4_Physics) == 0x000880, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_4_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_3_Physics) == 0x000888, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_3_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_2_Physics) == 0x000890, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_2_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_22_Physics) == 0x000898, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_22_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_21_Physics) == 0x0008A0, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_21_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_20_Physics) == 0x0008A8, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_20_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_1_Physics) == 0x0008B0, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_1_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_19_Physics) == 0x0008B8, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_19_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_18_Physics) == 0x0008C0, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_18_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_17_Physics) == 0x0008C8, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_17_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_16_Physics) == 0x0008D0, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_16_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_15_Physics) == 0x0008D8, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_15_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_14_Physics) == 0x0008E0, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_14_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_13_Physics) == 0x0008E8, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_13_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_12_Physics) == 0x0008F0, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_12_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_11_Physics) == 0x0008F8, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_11_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBCommon_Shuriken_01A_Physics_C, TBCommon_WoodDirt_01A_10_Physics) == 0x000900, "Member 'AP_TBCommon_Shuriken_01A_Physics_C::TBCommon_WoodDirt_01A_10_Physics' has a wrong offset!");

}

