#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_TBShinra_Sea_02A_Physics

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass P_TBShinra_Sea_02A_Physics.P_TBShinra_Sea_02A_Physics_C
// 0x0160 (0x09B0 - 0x0850)
class alignas(0x10) AP_TBShinra_Sea_02A_Physics_C final : public AEndTreasureShinraBox
{
public:
	class UMaterialParameterLightPlacedComponent* MaterialParameterLightPlaced;                      // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_42_Physics;                       // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_41_Physics;                       // 0x0860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_40_Physics;                       // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_7_Physics;                        // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_4_Physics;                        // 0x0878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_8_Physics;                        // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_9_Physics;                        // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_5_Physics;                        // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_6_Physics;                        // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_3_Physics;                        // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_39_Physics;                       // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_38_Physics1;                      // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_37_Physics;                       // 0x08B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_36_Physics1;                      // 0x08C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_35_Physics;                       // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_34_Physics1;                      // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_33_Physics;                       // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_32_Physics1;                      // 0x08E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_31_Physics;                       // 0x08E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_30_Physics1;                      // 0x08F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_2_Physics;                        // 0x08F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_29_Physics;                       // 0x0900(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_28_Physics1;                      // 0x0908(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_27_Physics;                       // 0x0910(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_26_Physics1;                      // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_25_Physics;                       // 0x0920(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_24_Physics1;                      // 0x0928(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_23_Physics;                       // 0x0930(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_22_Physics1;                      // 0x0938(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_21_Physics;                       // 0x0940(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_20_Physics1;                      // 0x0948(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_1_Physics;                        // 0x0950(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_19_Physics;                       // 0x0958(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_18_Physics1;                      // 0x0960(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_17_Physics;                       // 0x0968(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_16_Physics1;                      // 0x0970(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_15_Physics;                       // 0x0978(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_14_Physics;                       // 0x0980(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_13_Physics;                       // 0x0988(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_12_Physics;                       // 0x0990(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_11_Physics;                       // 0x0998(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    TBShinra_Sea_02A_10_Physics;                       // 0x09A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"P_TBShinra_Sea_02A_Physics_C">();
	}
	static class AP_TBShinra_Sea_02A_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AP_TBShinra_Sea_02A_Physics_C>();
	}
};
static_assert(alignof(AP_TBShinra_Sea_02A_Physics_C) == 0x000010, "Wrong alignment on AP_TBShinra_Sea_02A_Physics_C");
static_assert(sizeof(AP_TBShinra_Sea_02A_Physics_C) == 0x0009B0, "Wrong size on AP_TBShinra_Sea_02A_Physics_C");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, MaterialParameterLightPlaced) == 0x000850, "Member 'AP_TBShinra_Sea_02A_Physics_C::MaterialParameterLightPlaced' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_42_Physics) == 0x000858, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_42_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_41_Physics) == 0x000860, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_41_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_40_Physics) == 0x000868, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_40_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_7_Physics) == 0x000870, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_7_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_4_Physics) == 0x000878, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_4_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_8_Physics) == 0x000880, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_8_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_9_Physics) == 0x000888, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_9_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_5_Physics) == 0x000890, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_5_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_6_Physics) == 0x000898, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_6_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_3_Physics) == 0x0008A0, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_3_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_39_Physics) == 0x0008A8, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_39_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_38_Physics1) == 0x0008B0, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_38_Physics1' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_37_Physics) == 0x0008B8, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_37_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_36_Physics1) == 0x0008C0, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_36_Physics1' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_35_Physics) == 0x0008C8, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_35_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_34_Physics1) == 0x0008D0, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_34_Physics1' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_33_Physics) == 0x0008D8, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_33_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_32_Physics1) == 0x0008E0, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_32_Physics1' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_31_Physics) == 0x0008E8, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_31_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_30_Physics1) == 0x0008F0, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_30_Physics1' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_2_Physics) == 0x0008F8, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_2_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_29_Physics) == 0x000900, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_29_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_28_Physics1) == 0x000908, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_28_Physics1' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_27_Physics) == 0x000910, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_27_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_26_Physics1) == 0x000918, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_26_Physics1' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_25_Physics) == 0x000920, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_25_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_24_Physics1) == 0x000928, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_24_Physics1' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_23_Physics) == 0x000930, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_23_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_22_Physics1) == 0x000938, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_22_Physics1' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_21_Physics) == 0x000940, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_21_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_20_Physics1) == 0x000948, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_20_Physics1' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_1_Physics) == 0x000950, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_1_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_19_Physics) == 0x000958, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_19_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_18_Physics1) == 0x000960, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_18_Physics1' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_17_Physics) == 0x000968, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_17_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_16_Physics1) == 0x000970, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_16_Physics1' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_15_Physics) == 0x000978, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_15_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_14_Physics) == 0x000980, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_14_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_13_Physics) == 0x000988, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_13_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_12_Physics) == 0x000990, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_12_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_11_Physics) == 0x000998, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_11_Physics' has a wrong offset!");
static_assert(offsetof(AP_TBShinra_Sea_02A_Physics_C, TBShinra_Sea_02A_10_Physics) == 0x0009A0, "Member 'AP_TBShinra_Sea_02A_Physics_C::TBShinra_Sea_02A_10_Physics' has a wrong offset!");

}

