#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartySet_Cell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PartySet_Cell.PartySet_Cell_C
// 0x0028 (0x03F8 - 0x03D0)
class UPartySet_Cell_C final : public UEndPartySetCell
{
public:
	class UWidgetAnimation*                       Normal;                                            // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_main;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_main2;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PartySet_Cell_C">();
	}
	static class UPartySet_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartySet_Cell_C>();
	}
};
static_assert(alignof(UPartySet_Cell_C) == 0x000008, "Wrong alignment on UPartySet_Cell_C");
static_assert(sizeof(UPartySet_Cell_C) == 0x0003F8, "Wrong size on UPartySet_Cell_C");
static_assert(offsetof(UPartySet_Cell_C, Normal) == 0x0003D0, "Member 'UPartySet_Cell_C::Normal' has a wrong offset!");
static_assert(offsetof(UPartySet_Cell_C, Selected) == 0x0003D8, "Member 'UPartySet_Cell_C::Selected' has a wrong offset!");
static_assert(offsetof(UPartySet_Cell_C, Base_main) == 0x0003E0, "Member 'UPartySet_Cell_C::Base_main' has a wrong offset!");
static_assert(offsetof(UPartySet_Cell_C, Base_main2) == 0x0003E8, "Member 'UPartySet_Cell_C::Base_main2' has a wrong offset!");
static_assert(offsetof(UPartySet_Cell_C, Frame) == 0x0003F0, "Member 'UPartySet_Cell_C::Frame' has a wrong offset!");

}

