#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC0004_00_RedXIII_Standard_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PC0004_00_RedXIII_Standard_Animation.PC0004_00_RedXIII_Standard_Animation_C.ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation
// 0x00B4 (0x00B4 - 0x0000)
struct PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue;  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_3;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_4;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_12;       // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_5;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_13;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_14;       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_15;       // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_16;       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_17;       // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_18;       // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_19;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_6;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_1; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_2; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_7;            // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_3; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_4; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_8; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_5; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_8;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_5;         // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_6; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_9; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_6;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_9;            // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_20;       // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_21;       // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_22;       // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_10;           // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_10; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_11;           // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_23;       // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_11; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_12;           // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_24;       // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_25;       // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A7[0x1];                                       // 0x00A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_13;           // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_26;       // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_27;       // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_28;       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_29;       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_30;       // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_31;       // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation) == 0x000004, "Wrong alignment on PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation");
static_assert(sizeof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation) == 0x0000B4, "Wrong size on PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, EntryPoint) == 0x000000, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::EntryPoint' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x00000C, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000010, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000011, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2) == 0x000014, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x000018, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue) == 0x00001C, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000020, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000021, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3) == 0x000024, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_3) == 0x000028, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000029, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00002A, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x00002B, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x00002C, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x00002D, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x00002E, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_9) == 0x00002F, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_BooleanOR_ReturnValue_1) == 0x000030, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4) == 0x000034, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_4) == 0x000038, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_10) == 0x000039, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_11) == 0x00003A, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_12) == 0x00003B, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5) == 0x00003C, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_5) == 0x000040, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_13) == 0x000041, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_14) == 0x000042, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_15) == 0x000043, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_16) == 0x000044, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_17) == 0x000045, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_BooleanOR_ReturnValue_2) == 0x000046, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_18) == 0x000047, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_19) == 0x000048, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6) == 0x00004C, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_6) == 0x000050, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_1) == 0x000054, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000058, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_2) == 0x00005C, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7) == 0x000060, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000064, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_7) == 0x000065, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_3) == 0x000068, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_4) == 0x00006C, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x000070, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_4) == 0x000071, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_8) == 0x000074, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_5) == 0x000078, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_8) == 0x00007C, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_5) == 0x00007D, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_6) == 0x000080, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_9) == 0x000084, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_6) == 0x000088, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_9) == 0x000089, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_20) == 0x00008A, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_21) == 0x00008B, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_22) == 0x00008C, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue) == 0x000090, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_10) == 0x000094, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_10) == 0x000098, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_BooleanAND_ReturnValue) == 0x00009C, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_11) == 0x00009D, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_23) == 0x00009E, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_11) == 0x0000A0, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_12) == 0x0000A4, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_24) == 0x0000A5, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_25) == 0x0000A6, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1) == 0x0000A8, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_13) == 0x0000AC, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_BooleanAND_ReturnValue_1) == 0x0000AD, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_26) == 0x0000AE, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_27) == 0x0000AF, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_28) == 0x0000B0, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_29) == 0x0000B1, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_30) == 0x0000B2, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_31) == 0x0000B3, "Member 'PC0004_00_RedXIII_Standard_Animation_C_ExecuteUbergraph_PC0004_00_RedXIII_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_31' has a wrong offset!");

// Function PC0004_00_RedXIII_Standard_Animation.PC0004_00_RedXIII_Standard_Animation_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct PC0004_00_RedXIII_Standard_Animation_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(PC0004_00_RedXIII_Standard_Animation_C_AnimGraph) == 0x000008, "Wrong alignment on PC0004_00_RedXIII_Standard_Animation_C_AnimGraph");
static_assert(sizeof(PC0004_00_RedXIII_Standard_Animation_C_AnimGraph) == 0x000010, "Wrong size on PC0004_00_RedXIII_Standard_Animation_C_AnimGraph");
static_assert(offsetof(PC0004_00_RedXIII_Standard_Animation_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'PC0004_00_RedXIII_Standard_Animation_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

