#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC0007_00_CaitSith_Standard

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PC0007_00_CaitSith_Standard.PC0007_00_CaitSith_Standard_C
// 0x0020 (0x18C0 - 0x18A0)
class APC0007_00_CaitSith_Standard_C final : public AEndPlayerCaitSithCharacter
{
public:
	class UEndBodySubCollisionSettingComponent*   EndBodySubCollisionSetting;                        // 0x18A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             EndBodyCollisionPrimitive;                         // 0x18A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBattleTalk_CaitSith_C*                 BattleTalk_CaitSith;                               // 0x18B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PC0007_00_CaitSith_Standard_C">();
	}
	static class APC0007_00_CaitSith_Standard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APC0007_00_CaitSith_Standard_C>();
	}
};
static_assert(alignof(APC0007_00_CaitSith_Standard_C) == 0x000010, "Wrong alignment on APC0007_00_CaitSith_Standard_C");
static_assert(sizeof(APC0007_00_CaitSith_Standard_C) == 0x0018C0, "Wrong size on APC0007_00_CaitSith_Standard_C");
static_assert(offsetof(APC0007_00_CaitSith_Standard_C, EndBodySubCollisionSetting) == 0x0018A0, "Member 'APC0007_00_CaitSith_Standard_C::EndBodySubCollisionSetting' has a wrong offset!");
static_assert(offsetof(APC0007_00_CaitSith_Standard_C, EndBodyCollisionPrimitive) == 0x0018A8, "Member 'APC0007_00_CaitSith_Standard_C::EndBodyCollisionPrimitive' has a wrong offset!");
static_assert(offsetof(APC0007_00_CaitSith_Standard_C, BattleTalk_CaitSith) == 0x0018B0, "Member 'APC0007_00_CaitSith_Standard_C::BattleTalk_CaitSith' has a wrong offset!");

}

