#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC0099_00_Toad_Standard_Animation

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PC0099_00_Toad_Standard_Animation.PC0099_00_Toad_Standard_Animation_C
// 0x1850 (0x2FC0 - 0x1770)
class UPC0099_00_Toad_Standard_Animation_C final : public UEndCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1770(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1778(0x0030)()
	struct FAnimNode_EndBehaviorAction            AnimGraphNode_EndBehaviorAction;                   // 0x17A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x17D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x17F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x1820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x1848(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x1870(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x1898(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x18C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x18E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x1910(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x1938(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x1960(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x1988(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x19B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x19D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x1A00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x1A28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x1A50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x1A78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x1AA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x1AC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x1AF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x1B18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x1B40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x1B68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x1B90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x1BB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x1BE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x1C08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x1C30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x1C58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x1C80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x1CA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x1CD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x1CF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x1D20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x1D48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x1D70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x1D98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x1DC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x1DE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x1E10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x1E38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x1E60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x1E88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1EB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x1ED8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x1F00(0x0028)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_11;      // 0x1F28(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x1FD0(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_10;      // 0x2000(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x20A8(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_9;       // 0x20D8(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x2180(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x21B0(0x0028)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_8;       // 0x21D8(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x2280(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_7;       // 0x22B0(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x2358(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x2388(0x0028)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_6;       // 0x23B0(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x2458(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_5;       // 0x2488(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x2530(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x2560(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x2588(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x25B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x25D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2600(0x0028)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_4;       // 0x2628(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x26D0(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_3;       // 0x2700(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x27A8(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x27D8(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x27F0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2820(0x0028)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_2;       // 0x2848(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x28F0(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer_1;       // 0x2920(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x29C8(0x0030)()
	struct FAnimNode_EndLocomotionSequencePlayer  AnimGraphNode_EndLocomotionSequencePlayer;         // 0x29F8(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2AA0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2AD0(0x00B0)()
	struct FAnimNode_EndInertialization           AnimGraphNode_EndInertialization;                  // 0x2B80(0x0090)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x2C10(0x0048)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x2C58(0x0368)()

public:
	void ExecuteUbergraph_PC0099_00_Toad_Standard_Animation(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PC0099_00_Toad_Standard_Animation_AnimGraphNode_TransitionResult_16A74BB847FA7F72D08833A72705DE51();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PC0099_00_Toad_Standard_Animation_AnimGraphNode_TransitionResult_7E78ABD641790A0C0B36EAA6B39DD126();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PC0099_00_Toad_Standard_Animation_AnimGraphNode_TransitionResult_7542B3EC4F07AD0FEF16ABB186A34253();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PC0099_00_Toad_Standard_Animation_AnimGraphNode_TransitionResult_711CBB1E4C9C7FBDB4ABFDBC1D1A76DC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PC0099_00_Toad_Standard_Animation_AnimGraphNode_TransitionResult_55A923EB46103F19C7A34280EF027680();
