#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC0004_00_RedXIII_Standard

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PC0004_00_RedXIII_Standard.PC0004_00_RedXIII_Standard_C
// 0x0020 (0x1890 - 0x1870)
class APC0004_00_RedXIII_Standard_C final : public AEndPlayerCharacter
{
public:
	class UBattleTalk_RedXIII_C*                  BattleTalk_RedXIII;                                // 0x1870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodySubCollisionSettingComponent*   EndBodySubCollisionSetting;                        // 0x1878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             EndBodyCollisionPrimitive;                         // 0x1880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             EndBodyCollisionPrimitive1;                        // 0x1888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PC0004_00_RedXIII_Standard_C">();
	}
	static class APC0004_00_RedXIII_Standard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APC0004_00_RedXIII_Standard_C>();
	}
};
static_assert(alignof(APC0004_00_RedXIII_Standard_C) == 0x000010, "Wrong alignment on APC0004_00_RedXIII_Standard_C");
static_assert(sizeof(APC0004_00_RedXIII_Standard_C) == 0x001890, "Wrong size on APC0004_00_RedXIII_Standard_C");
static_assert(offsetof(APC0004_00_RedXIII_Standard_C, BattleTalk_RedXIII) == 0x001870, "Member 'APC0004_00_RedXIII_Standard_C::BattleTalk_RedXIII' has a wrong offset!");
static_assert(offsetof(APC0004_00_RedXIII_Standard_C, EndBodySubCollisionSetting) == 0x001878, "Member 'APC0004_00_RedXIII_Standard_C::EndBodySubCollisionSetting' has a wrong offset!");
static_assert(offsetof(APC0004_00_RedXIII_Standard_C, EndBodyCollisionPrimitive) == 0x001880, "Member 'APC0004_00_RedXIII_Standard_C::EndBodyCollisionPrimitive' has a wrong offset!");
static_assert(offsetof(APC0004_00_RedXIII_Standard_C, EndBodyCollisionPrimitive1) == 0x001888, "Member 'APC0004_00_RedXIII_Standard_C::EndBodyCollisionPrimitive1' has a wrong offset!");

}

