#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC0000_00_Cloud_Standard_AIBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PC0000_00_Cloud_Standard_AIBP.PC0000_00_Cloud_Standard_AIBP_C.OnGetTargetFieldPosition
// 0x0034 (0x0034 - 0x0000)
struct PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition final
{
public:
	struct FVector                                OutPosition;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InBattleAbilityID;                                 // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InDamageSourceID;                                  // 0x0014(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InAnimationName;                                   // 0x001C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetEndTargetPointLocation_ReturnValue;    // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition) == 0x000004, "Wrong alignment on PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition");
static_assert(sizeof(PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition) == 0x000034, "Wrong size on PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition");
static_assert(offsetof(PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition, OutPosition) == 0x000000, "Member 'PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition::OutPosition' has a wrong offset!");
static_assert(offsetof(PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition, InBattleAbilityID) == 0x00000C, "Member 'PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition::InBattleAbilityID' has a wrong offset!");
static_assert(offsetof(PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition, InDamageSourceID) == 0x000014, "Member 'PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition::InDamageSourceID' has a wrong offset!");
static_assert(offsetof(PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition, InAnimationName) == 0x00001C, "Member 'PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition::InAnimationName' has a wrong offset!");
static_assert(offsetof(PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition, ReturnValue) == 0x000024, "Member 'PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition::ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition, K2Node_SwitchName_CmpSuccess) == 0x000025, "Member 'PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition, CallFunc_GetEndTargetPointLocation_ReturnValue) == 0x000028, "Member 'PC0000_00_Cloud_Standard_AIBP_C_OnGetTargetFieldPosition::CallFunc_GetEndTargetPointLocation_ReturnValue' has a wrong offset!");

}

