#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC0007_00_CaitSith_Standard_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function PC0007_00_CaitSith_Standard_Animation.PC0007_00_CaitSith_Standard_Animation_C.ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation
// 0x0114 (0x0114 - 0x0000)
struct PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_3;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_4;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_12;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_5;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_13;       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_14;       // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_15;       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_16;       // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_17;       // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_18;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_19;       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_6;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_1; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_2; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_3; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_7;            // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_6;                             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_7;                             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_8;                             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_2;                              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_4; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_9;                             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_10;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_11;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_3;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_8; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_8;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_5; // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeFraction_ReturnValue_6; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_9; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_9;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_20;       // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_21;       // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_22;       // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_10;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_10; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_11;           // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_23;       // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_11; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_12;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_24;       // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_25;       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_13;           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAnimBehaviorMode                          Temp_byte_Variable_4;                              // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_26;       // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_27;       // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAnimBehaviorMode                          Temp_byte_Variable_5;                              // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F7[0x1];                                       // 0x00F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_28;       // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_29;       // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_30;       // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_31;       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAnimBehaviorMode                          Temp_byte_Variable_6;                              // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAnimBehaviorMode                          Temp_byte_Variable_7;                              // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_5;         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_3;                           // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_6;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation) == 0x000004, "Wrong alignment on PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation");
static_assert(sizeof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation) == 0x000114, "Wrong size on PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, EntryPoint) == 0x000000, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::EntryPoint' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000005, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000006, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000007, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000008, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_BooleanOR_ReturnValue) == 0x00000C, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue) == 0x00000D, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x000010, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000014, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000015, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000016, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2) == 0x000018, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_BooleanOR_ReturnValue_1) == 0x00001C, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x00001D, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue) == 0x000020, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000024, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x000025, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3) == 0x000028, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_3) == 0x00002C, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x00002D, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x00002E, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_9) == 0x00002F, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_10) == 0x000030, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_11) == 0x000031, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4) == 0x000034, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_4) == 0x000038, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5) == 0x00003C, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_12) == 0x000040, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_5) == 0x000041, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_13) == 0x000042, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_14) == 0x000043, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_15) == 0x000044, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_16) == 0x000045, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_17) == 0x000046, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_BooleanOR_ReturnValue_2) == 0x000047, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_18) == 0x000048, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_19) == 0x000049, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6) == 0x00004C, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_6) == 0x000050, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_1) == 0x000054, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_float_Variable) == 0x000058, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_float_Variable_1) == 0x00005C, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_float_Variable_2) == 0x000060, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_byte_Variable) == 0x000064, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_2) == 0x000068, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_float_Variable_3) == 0x00006C, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_float_Variable_4) == 0x000070, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_float_Variable_5) == 0x000074, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_byte_Variable_1) == 0x000078, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7) == 0x00007C, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_3) == 0x000080, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_7) == 0x000084, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_float_Variable_6) == 0x000088, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_float_Variable_7) == 0x00008C, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_float_Variable_7' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_float_Variable_8) == 0x000090, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_float_Variable_8' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_byte_Variable_2) == 0x000094, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_4) == 0x000098, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_float_Variable_9) == 0x00009C, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_float_Variable_9' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_float_Variable_10) == 0x0000A0, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_float_Variable_10' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_float_Variable_11) == 0x0000A4, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_float_Variable_11' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_byte_Variable_3) == 0x0000A8, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_8) == 0x0000AC, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_8) == 0x0000B0, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_5) == 0x0000B4, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0000B8, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeFraction_ReturnValue_6) == 0x0000BC, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeFraction_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x0000C0, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_9) == 0x0000C4, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_9) == 0x0000C8, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_20) == 0x0000C9, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_21) == 0x0000CA, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_22) == 0x0000CB, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue) == 0x0000CC, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_10) == 0x0000D0, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_10) == 0x0000D4, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_BooleanAND_ReturnValue) == 0x0000D8, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_11) == 0x0000D9, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_23) == 0x0000DA, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_11) == 0x0000DC, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_12) == 0x0000E0, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_24) == 0x0000E1, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1) == 0x0000E4, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_25) == 0x0000E8, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Less_FloatFloat_ReturnValue_13) == 0x0000E9, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Less_FloatFloat_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_BooleanAND_ReturnValue_1) == 0x0000EA, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_byte_Variable_4) == 0x0000EB, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_26) == 0x0000EC, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, K2Node_Select_Default) == 0x0000F0, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x0000F4, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_27) == 0x0000F5, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_byte_Variable_5) == 0x0000F6, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, K2Node_Select_Default_1) == 0x0000F8, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_28) == 0x0000FC, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_4) == 0x0000FD, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_29) == 0x0000FE, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_30) == 0x0000FF, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_31) == 0x000100, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_31' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_byte_Variable_6) == 0x000101, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, Temp_byte_Variable_7) == 0x000102, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, K2Node_Select_Default_2) == 0x000104, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_5) == 0x000108, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, K2Node_Select_Default_3) == 0x00010C, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation, CallFunc_Greater_FloatFloat_ReturnValue_6) == 0x000110, "Member 'PC0007_00_CaitSith_Standard_Animation_C_ExecuteUbergraph_PC0007_00_CaitSith_Standard_Animation::CallFunc_Greater_FloatFloat_ReturnValue_6' has a wrong offset!");

// Function PC0007_00_CaitSith_Standard_Animation.PC0007_00_CaitSith_Standard_Animation_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct PC0007_00_CaitSith_Standard_Animation_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(PC0007_00_CaitSith_Standard_Animation_C_AnimGraph) == 0x000008, "Wrong alignment on PC0007_00_CaitSith_Standard_Animation_C_AnimGraph");
static_assert(sizeof(PC0007_00_CaitSith_Standard_Animation_C_AnimGraph) == 0x000010, "Wrong size on PC0007_00_CaitSith_Standard_Animation_C_AnimGraph");
static_assert(offsetof(PC0007_00_CaitSith_Standard_Animation_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'PC0007_00_CaitSith_Standard_Animation_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

