#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Photo_Top

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Photo_Top.Photo_Top_C
// 0x0150 (0x0518 - 0x03C8)
class UPhoto_Top_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Percentage_Txt_Off;                                // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Percentage_Txt_On;                                 // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SuccessMessage;                                    // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus_OnTarget;                                    // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus_NoTarget;                                    // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Press;                                             // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Percentage_Success;                                // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Percentage_On_Sp;                                  // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Percentage_On;                                     // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SavePhoto_Off;                                     // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SavePhoto_On;                                      // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Target_Success;                                    // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Target_Fake;                                       // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Target_Real;                                       // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Target_None;                                       // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Bg_Percentage;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterIcon;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterIcon_TargetOn;                               // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ciecle_Normal_01;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ciecle_Normal_02;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ciecle_Normal_03;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ciecle_Normal_04;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame1_1;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame1_2;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame1_3;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame1_4;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame2_1;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame2_2;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame2_1_Light;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame2_2_Light;                                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         Frame3_1;                                          // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         Frame3_2;                                          // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Hint;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_OnOff;                                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash;                                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              SuccessIcon;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Guide3;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num;                                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Total;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Photo_Top_C">();
	}
	static class UPhoto_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhoto_Top_C>();
	}
};
static_assert(alignof(UPhoto_Top_C) == 0x000008, "Wrong alignment on UPhoto_Top_C");
static_assert(sizeof(UPhoto_Top_C) == 0x000518, "Wrong size on UPhoto_Top_C");
static_assert(offsetof(UPhoto_Top_C, Percentage_Txt_Off) == 0x0003C8, "Member 'UPhoto_Top_C::Percentage_Txt_Off' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Percentage_Txt_On) == 0x0003D0, "Member 'UPhoto_Top_C::Percentage_Txt_On' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, SuccessMessage) == 0x0003D8, "Member 'UPhoto_Top_C::SuccessMessage' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Focus_OnTarget) == 0x0003E0, "Member 'UPhoto_Top_C::Focus_OnTarget' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Focus_NoTarget) == 0x0003E8, "Member 'UPhoto_Top_C::Focus_NoTarget' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Press) == 0x0003F0, "Member 'UPhoto_Top_C::Press' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Percentage_Success) == 0x0003F8, "Member 'UPhoto_Top_C::Percentage_Success' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Percentage_On_Sp) == 0x000400, "Member 'UPhoto_Top_C::Percentage_On_Sp' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Percentage_On) == 0x000408, "Member 'UPhoto_Top_C::Percentage_On' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, SavePhoto_Off) == 0x000410, "Member 'UPhoto_Top_C::SavePhoto_Off' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, SavePhoto_On) == 0x000418, "Member 'UPhoto_Top_C::SavePhoto_On' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Target_Success) == 0x000420, "Member 'UPhoto_Top_C::Target_Success' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Target_Fake) == 0x000428, "Member 'UPhoto_Top_C::Target_Fake' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Target_Real) == 0x000430, "Member 'UPhoto_Top_C::Target_Real' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Target_None) == 0x000438, "Member 'UPhoto_Top_C::Target_None' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Normal) == 0x000440, "Member 'UPhoto_Top_C::Normal' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, In) == 0x000448, "Member 'UPhoto_Top_C::In' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Bg_Percentage) == 0x000450, "Member 'UPhoto_Top_C::Bg_Percentage' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, CenterIcon) == 0x000458, "Member 'UPhoto_Top_C::CenterIcon' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, CenterIcon_TargetOn) == 0x000460, "Member 'UPhoto_Top_C::CenterIcon_TargetOn' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Ciecle_Normal_01) == 0x000468, "Member 'UPhoto_Top_C::Ciecle_Normal_01' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Ciecle_Normal_02) == 0x000470, "Member 'UPhoto_Top_C::Ciecle_Normal_02' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Ciecle_Normal_03) == 0x000478, "Member 'UPhoto_Top_C::Ciecle_Normal_03' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Ciecle_Normal_04) == 0x000480, "Member 'UPhoto_Top_C::Ciecle_Normal_04' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Frame1_1) == 0x000488, "Member 'UPhoto_Top_C::Frame1_1' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Frame1_2) == 0x000490, "Member 'UPhoto_Top_C::Frame1_2' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Frame1_3) == 0x000498, "Member 'UPhoto_Top_C::Frame1_3' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Frame1_4) == 0x0004A0, "Member 'UPhoto_Top_C::Frame1_4' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Frame2_1) == 0x0004A8, "Member 'UPhoto_Top_C::Frame2_1' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Frame2_2) == 0x0004B0, "Member 'UPhoto_Top_C::Frame2_2' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Frame2_1_Light) == 0x0004B8, "Member 'UPhoto_Top_C::Frame2_1_Light' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Frame2_2_Light) == 0x0004C0, "Member 'UPhoto_Top_C::Frame2_2_Light' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Frame3_1) == 0x0004C8, "Member 'UPhoto_Top_C::Frame3_1' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Frame3_2) == 0x0004D0, "Member 'UPhoto_Top_C::Frame3_2' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Icon_Hint) == 0x0004D8, "Member 'UPhoto_Top_C::Icon_Hint' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Icon_OnOff) == 0x0004E0, "Member 'UPhoto_Top_C::Icon_OnOff' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Img_Slash) == 0x0004E8, "Member 'UPhoto_Top_C::Img_Slash' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Light) == 0x0004F0, "Member 'UPhoto_Top_C::Light' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, SuccessIcon) == 0x0004F8, "Member 'UPhoto_Top_C::SuccessIcon' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Txt_Guide3) == 0x000500, "Member 'UPhoto_Top_C::Txt_Guide3' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Txt_Num) == 0x000508, "Member 'UPhoto_Top_C::Txt_Num' has a wrong offset!");
static_assert(offsetof(UPhoto_Top_C, Txt_Total) == 0x000510, "Member 'UPhoto_Top_C::Txt_Total' has a wrong offset!");

}

