#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerLevel_Status

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerLevel_Status.PlayerLevel_Status_C
// 0x0090 (0x04C0 - 0x0430)
class UPlayerLevel_Status_C final : public UEndPlayerLevelStatus
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       In2;                                               // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_1;                                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_2;                                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterBase;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_57;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Frame_1;                                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Frame_2;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Gauge_Frame;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Item_C*                           Icon_Item;                                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_00;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_01;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point1;                                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point2;                                            // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_WeaponLv;                                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerLevel_Status(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerLevel_Status_C">();
	}
	static class UPlayerLevel_Status_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerLevel_Status_C>();
	}
};
static_assert(alignof(UPlayerLevel_Status_C) == 0x000008, "Wrong alignment on UPlayerLevel_Status_C");
static_assert(sizeof(UPlayerLevel_Status_C) == 0x0004C0, "Wrong size on UPlayerLevel_Status_C");
static_assert(offsetof(UPlayerLevel_Status_C, UberGraphFrame) == 0x000430, "Member 'UPlayerLevel_Status_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, In2) == 0x000438, "Member 'UPlayerLevel_Status_C::In2' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, In) == 0x000440, "Member 'UPlayerLevel_Status_C::In' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, Base) == 0x000448, "Member 'UPlayerLevel_Status_C::Base' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, Base_1) == 0x000450, "Member 'UPlayerLevel_Status_C::Base_1' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, Base_2) == 0x000458, "Member 'UPlayerLevel_Status_C::Base_2' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, CenterBase) == 0x000460, "Member 'UPlayerLevel_Status_C::CenterBase' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, EndImage_57) == 0x000468, "Member 'UPlayerLevel_Status_C::EndImage_57' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, Frame_1) == 0x000470, "Member 'UPlayerLevel_Status_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, Frame_2) == 0x000478, "Member 'UPlayerLevel_Status_C::Frame_2' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, Gauge_Frame) == 0x000480, "Member 'UPlayerLevel_Status_C::Gauge_Frame' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, Icon_Item) == 0x000488, "Member 'UPlayerLevel_Status_C::Icon_Item' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, Img_Slash) == 0x000490, "Member 'UPlayerLevel_Status_C::Img_Slash' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, Img_Slash_00) == 0x000498, "Member 'UPlayerLevel_Status_C::Img_Slash_00' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, Img_Slash_01) == 0x0004A0, "Member 'UPlayerLevel_Status_C::Img_Slash_01' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, Point1) == 0x0004A8, "Member 'UPlayerLevel_Status_C::Point1' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, Point2) == 0x0004B0, "Member 'UPlayerLevel_Status_C::Point2' has a wrong offset!");
static_assert(offsetof(UPlayerLevel_Status_C, Txt_WeaponLv) == 0x0004B8, "Member 'UPlayerLevel_Status_C::Txt_WeaponLv' has a wrong offset!");

}

