#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerLevel_Gauge

#include "Basic.hpp"


namespace SDK::Params
{

// Function PlayerLevel_Gauge.PlayerLevel_Gauge_C.ExecuteUbergraph_PlayerLevel_Gauge
// 0x0008 (0x0008 - 0x0000)
struct PlayerLevel_Gauge_C_ExecuteUbergraph_PlayerLevel_Gauge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_2;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerLevel_Gauge_C_ExecuteUbergraph_PlayerLevel_Gauge) == 0x000004, "Wrong alignment on PlayerLevel_Gauge_C_ExecuteUbergraph_PlayerLevel_Gauge");
static_assert(sizeof(PlayerLevel_Gauge_C_ExecuteUbergraph_PlayerLevel_Gauge) == 0x000008, "Wrong size on PlayerLevel_Gauge_C_ExecuteUbergraph_PlayerLevel_Gauge");
static_assert(offsetof(PlayerLevel_Gauge_C_ExecuteUbergraph_PlayerLevel_Gauge, EntryPoint) == 0x000000, "Member 'PlayerLevel_Gauge_C_ExecuteUbergraph_PlayerLevel_Gauge::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerLevel_Gauge_C_ExecuteUbergraph_PlayerLevel_Gauge, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'PlayerLevel_Gauge_C_ExecuteUbergraph_PlayerLevel_Gauge::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLevel_Gauge_C_ExecuteUbergraph_PlayerLevel_Gauge, K2Node_Event_IsDesignTime) == 0x000005, "Member 'PlayerLevel_Gauge_C_ExecuteUbergraph_PlayerLevel_Gauge::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(PlayerLevel_Gauge_C_ExecuteUbergraph_PlayerLevel_Gauge, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000006, "Member 'PlayerLevel_Gauge_C_ExecuteUbergraph_PlayerLevel_Gauge::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerLevel_Gauge_C_ExecuteUbergraph_PlayerLevel_Gauge, CallFunc_PlayAnimationByName_ReturnValue_2) == 0x000007, "Member 'PlayerLevel_Gauge_C_ExecuteUbergraph_PlayerLevel_Gauge::CallFunc_PlayAnimationByName_ReturnValue_2' has a wrong offset!");

// Function PlayerLevel_Gauge.PlayerLevel_Gauge_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PlayerLevel_Gauge_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerLevel_Gauge_C_PreConstruct) == 0x000001, "Wrong alignment on PlayerLevel_Gauge_C_PreConstruct");
static_assert(sizeof(PlayerLevel_Gauge_C_PreConstruct) == 0x000001, "Wrong size on PlayerLevel_Gauge_C_PreConstruct");
static_assert(offsetof(PlayerLevel_Gauge_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PlayerLevel_Gauge_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

