#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PreInput_Icon

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PreInput_Icon.PreInput_Icon_C
// 0x0068 (0x0430 - 0x03C8)
class UPreInput_Icon_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Loop;                                              // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_PreInput_Cell_10;                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_PreInput_Cell_00;                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_PreInput_Cell_01;                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_PreInput_Cell_02;                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_PreInput_Cell_03;                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_PreInput_Cell_04;                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_PreInput_Cell_05;                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_PreInput_Cell_06;                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_PreInput_Cell_07;                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_PreInput_Cell_08;                              // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_PreInput_Cell_09;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_PreInput_Icon_BG;                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PreInput_Icon_C">();
	}
	static class UPreInput_Icon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPreInput_Icon_C>();
	}
};
static_assert(alignof(UPreInput_Icon_C) == 0x000008, "Wrong alignment on UPreInput_Icon_C");
static_assert(sizeof(UPreInput_Icon_C) == 0x000430, "Wrong size on UPreInput_Icon_C");
static_assert(offsetof(UPreInput_Icon_C, Loop) == 0x0003C8, "Member 'UPreInput_Icon_C::Loop' has a wrong offset!");
static_assert(offsetof(UPreInput_Icon_C, Img_PreInput_Cell_10) == 0x0003D0, "Member 'UPreInput_Icon_C::Img_PreInput_Cell_10' has a wrong offset!");
static_assert(offsetof(UPreInput_Icon_C, Img_PreInput_Cell_00) == 0x0003D8, "Member 'UPreInput_Icon_C::Img_PreInput_Cell_00' has a wrong offset!");
static_assert(offsetof(UPreInput_Icon_C, Img_PreInput_Cell_01) == 0x0003E0, "Member 'UPreInput_Icon_C::Img_PreInput_Cell_01' has a wrong offset!");
static_assert(offsetof(UPreInput_Icon_C, Img_PreInput_Cell_02) == 0x0003E8, "Member 'UPreInput_Icon_C::Img_PreInput_Cell_02' has a wrong offset!");
static_assert(offsetof(UPreInput_Icon_C, Img_PreInput_Cell_03) == 0x0003F0, "Member 'UPreInput_Icon_C::Img_PreInput_Cell_03' has a wrong offset!");
static_assert(offsetof(UPreInput_Icon_C, Img_PreInput_Cell_04) == 0x0003F8, "Member 'UPreInput_Icon_C::Img_PreInput_Cell_04' has a wrong offset!");
static_assert(offsetof(UPreInput_Icon_C, Img_PreInput_Cell_05) == 0x000400, "Member 'UPreInput_Icon_C::Img_PreInput_Cell_05' has a wrong offset!");
static_assert(offsetof(UPreInput_Icon_C, Img_PreInput_Cell_06) == 0x000408, "Member 'UPreInput_Icon_C::Img_PreInput_Cell_06' has a wrong offset!");
static_assert(offsetof(UPreInput_Icon_C, Img_PreInput_Cell_07) == 0x000410, "Member 'UPreInput_Icon_C::Img_PreInput_Cell_07' has a wrong offset!");
static_assert(offsetof(UPreInput_Icon_C, Img_PreInput_Cell_08) == 0x000418, "Member 'UPreInput_Icon_C::Img_PreInput_Cell_08' has a wrong offset!");
static_assert(offsetof(UPreInput_Icon_C, Img_PreInput_Cell_09) == 0x000420, "Member 'UPreInput_Icon_C::Img_PreInput_Cell_09' has a wrong offset!");
static_assert(offsetof(UPreInput_Icon_C, Img_PreInput_Icon_BG) == 0x000428, "Member 'UPreInput_Icon_C::Img_PreInput_Icon_BG' has a wrong offset!");

}

