#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Quest_Window

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Quest_Window.Quest_Window_C
// 0x00A8 (0x04D0 - 0x0428)
class UQuest_Window_C final : public UEndStoryDetailWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Menu_Out;                                          // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In_old;                                       // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestWindow_PastClear;                             // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestWindow_Fail;                                  // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestWindow_Clear;                                 // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestWindow_Priority;                              // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestWindow_Now;                                   // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_1;                                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_103;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame1;                                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PriorityIcon;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   Quest_Info_List;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuest_RecommendLevel_C*                RecommendLevel;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_1;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Line;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           TriangleBase;                                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           TriangleBaseShadow;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn;                                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Quest_Window(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Quest_Window_C">();
	}
	static class UQuest_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuest_Window_C>();
	}
};
static_assert(alignof(UQuest_Window_C) == 0x000008, "Wrong alignment on UQuest_Window_C");
static_assert(sizeof(UQuest_Window_C) == 0x0004D0, "Wrong size on UQuest_Window_C");
static_assert(offsetof(UQuest_Window_C, UberGraphFrame) == 0x000428, "Member 'UQuest_Window_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Menu_Out) == 0x000430, "Member 'UQuest_Window_C::Menu_Out' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Menu_In_old) == 0x000438, "Member 'UQuest_Window_C::Menu_In_old' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, QuestWindow_PastClear) == 0x000440, "Member 'UQuest_Window_C::QuestWindow_PastClear' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, QuestWindow_Fail) == 0x000448, "Member 'UQuest_Window_C::QuestWindow_Fail' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, QuestWindow_Clear) == 0x000450, "Member 'UQuest_Window_C::QuestWindow_Clear' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, QuestWindow_Priority) == 0x000458, "Member 'UQuest_Window_C::QuestWindow_Priority' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Menu_In) == 0x000460, "Member 'UQuest_Window_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, QuestWindow_Now) == 0x000468, "Member 'UQuest_Window_C::QuestWindow_Now' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Base) == 0x000470, "Member 'UQuest_Window_C::Base' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Base_1) == 0x000478, "Member 'UQuest_Window_C::Base_1' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, EndImage_103) == 0x000480, "Member 'UQuest_Window_C::EndImage_103' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Frame1) == 0x000488, "Member 'UQuest_Window_C::Frame1' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, PriorityIcon) == 0x000490, "Member 'UQuest_Window_C::PriorityIcon' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Quest_Info_List) == 0x000498, "Member 'UQuest_Window_C::Quest_Info_List' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, RecommendLevel) == 0x0004A0, "Member 'UQuest_Window_C::RecommendLevel' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Shadow_1) == 0x0004A8, "Member 'UQuest_Window_C::Shadow_1' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Title_Line) == 0x0004B0, "Member 'UQuest_Window_C::Title_Line' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, TriangleBase) == 0x0004B8, "Member 'UQuest_Window_C::TriangleBase' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, TriangleBaseShadow) == 0x0004C0, "Member 'UQuest_Window_C::TriangleBaseShadow' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Txt_Btn) == 0x0004C8, "Member 'UQuest_Window_C::Txt_Btn' has a wrong offset!");

}

