#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Quest_Progress_Stone

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Quest_Progress_Stone.Quest_Progress_Stone_C
// 0x0020 (0x03E8 - 0x03C8)
class UQuest_Progress_Stone_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Closed;                                            // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Release;                                           // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Stone;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              NowRing;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Quest_Progress_Stone_C">();
	}
	static class UQuest_Progress_Stone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuest_Progress_Stone_C>();
	}
};
static_assert(alignof(UQuest_Progress_Stone_C) == 0x000008, "Wrong alignment on UQuest_Progress_Stone_C");
static_assert(sizeof(UQuest_Progress_Stone_C) == 0x0003E8, "Wrong size on UQuest_Progress_Stone_C");
static_assert(offsetof(UQuest_Progress_Stone_C, Closed) == 0x0003C8, "Member 'UQuest_Progress_Stone_C::Closed' has a wrong offset!");
static_assert(offsetof(UQuest_Progress_Stone_C, Release) == 0x0003D0, "Member 'UQuest_Progress_Stone_C::Release' has a wrong offset!");
static_assert(offsetof(UQuest_Progress_Stone_C, Icon_Stone) == 0x0003D8, "Member 'UQuest_Progress_Stone_C::Icon_Stone' has a wrong offset!");
static_assert(offsetof(UQuest_Progress_Stone_C, NowRing) == 0x0003E0, "Member 'UQuest_Progress_Stone_C::NowRing' has a wrong offset!");

}

