#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Quest_Info_Cell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Quest_Info_Cell.Quest_Info_Cell_C
// 0x00B0 (0x0478 - 0x03C8)
class UQuest_Info_Cell_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       QuestInfo_PastClear;                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestInfo_TopFail;                                 // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestInfo_TopClear;                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestInfo_TopNow;                                  // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Arrow;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_QuestThumbnail_;                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_125;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_BattleReport_Gauge_C*         Gauge;                                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              GaugeBase;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Clear;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ImgBase;                                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ImgWaku;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LineShadow;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuest_ProgressNow_Light_C*             ProgressNow_Light;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Quest_Icon_Title;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow;                                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Clear;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TitleInfo;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Quest_Info_Cell_C">();
	}
	static class UQuest_Info_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuest_Info_Cell_C>();
	}
};
static_assert(alignof(UQuest_Info_Cell_C) == 0x000008, "Wrong alignment on UQuest_Info_Cell_C");
static_assert(sizeof(UQuest_Info_Cell_C) == 0x000478, "Wrong size on UQuest_Info_Cell_C");
static_assert(offsetof(UQuest_Info_Cell_C, QuestInfo_PastClear) == 0x0003C8, "Member 'UQuest_Info_Cell_C::QuestInfo_PastClear' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, QuestInfo_TopFail) == 0x0003D0, "Member 'UQuest_Info_Cell_C::QuestInfo_TopFail' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, QuestInfo_TopClear) == 0x0003D8, "Member 'UQuest_Info_Cell_C::QuestInfo_TopClear' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, QuestInfo_TopNow) == 0x0003E0, "Member 'UQuest_Info_Cell_C::QuestInfo_TopNow' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, Arrow) == 0x0003E8, "Member 'UQuest_Info_Cell_C::Arrow' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, Base1) == 0x0003F0, "Member 'UQuest_Info_Cell_C::Base1' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, Base2) == 0x0003F8, "Member 'UQuest_Info_Cell_C::Base2' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, Billboard_QuestThumbnail_) == 0x000400, "Member 'UQuest_Info_Cell_C::Billboard_QuestThumbnail_' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, EndImage) == 0x000408, "Member 'UQuest_Info_Cell_C::EndImage' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, EndImage_125) == 0x000410, "Member 'UQuest_Info_Cell_C::EndImage_125' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, Gauge) == 0x000418, "Member 'UQuest_Info_Cell_C::Gauge' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, GaugeBase) == 0x000420, "Member 'UQuest_Info_Cell_C::GaugeBase' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, Icon_Clear) == 0x000428, "Member 'UQuest_Info_Cell_C::Icon_Clear' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, ImgBase) == 0x000430, "Member 'UQuest_Info_Cell_C::ImgBase' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, ImgWaku) == 0x000438, "Member 'UQuest_Info_Cell_C::ImgWaku' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, Line) == 0x000440, "Member 'UQuest_Info_Cell_C::Line' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, LineShadow) == 0x000448, "Member 'UQuest_Info_Cell_C::LineShadow' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, ProgressNow_Light) == 0x000450, "Member 'UQuest_Info_Cell_C::ProgressNow_Light' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, Quest_Icon_Title) == 0x000458, "Member 'UQuest_Info_Cell_C::Quest_Icon_Title' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, Shadow) == 0x000460, "Member 'UQuest_Info_Cell_C::Shadow' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, Txt_Clear) == 0x000468, "Member 'UQuest_Info_Cell_C::Txt_Clear' has a wrong offset!");
static_assert(offsetof(UQuest_Info_Cell_C, Txt_TitleInfo) == 0x000470, "Member 'UQuest_Info_Cell_C::Txt_TitleInfo' has a wrong offset!");

}

