#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Quest_Cell2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Quest_Cell2.Quest_Cell2_C
// 0x0138 (0x0500 - 0x03C8)
class UQuest_Cell2_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       NowNG;                                             // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_PastRelease;                              // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Clear;                                    // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ClosedNotRelease;                                  // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Clear;                                             // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PastRelease;                                       // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Closed;                                   // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Now;                                      // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Closed;                                            // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NowPriority;                                       // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NowRelease;                                        // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NowNotRelease;                                     // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Clear;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Close;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Frame;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Thumbnail;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_QuestThumbnail;                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame0;                                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Clear;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Clear_New;                                    // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Lock;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_NG;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_SkillPointAdd;                                // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Member;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              NumBase;                                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndListBox*                            Progress_List;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Quest_Btn;                                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuest_PriorityMark_C*                  Quest_PriorityMark;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuest_RecommendLevel_C*                RecommendLevel;                                    // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Base;                                        // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Base_Hover;                                  // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Clear;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Quest_Num;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Quest_Title;                                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_SkillPointAdd;                                 // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Quest_Cell2(int32 EntryPoint);
	void BndEvt__Quest_Btn_K2Node_ComponentBoundEvent_174_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Quest_Btn_K2Node_ComponentBoundEvent_161_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Quest_Cell2_C">();
	}
	static class UQuest_Cell2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuest_Cell2_C>();
	}
};
static_assert(alignof(UQuest_Cell2_C) == 0x000008, "Wrong alignment on UQuest_Cell2_C");
static_assert(sizeof(UQuest_Cell2_C) == 0x000500, "Wrong size on UQuest_Cell2_C");
static_assert(offsetof(UQuest_Cell2_C, UberGraphFrame) == 0x0003C8, "Member 'UQuest_Cell2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, NowNG) == 0x0003D0, "Member 'UQuest_Cell2_C::NowNG' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, BtnHover_PastRelease) == 0x0003D8, "Member 'UQuest_Cell2_C::BtnHover_PastRelease' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, BtnHover_Clear) == 0x0003E0, "Member 'UQuest_Cell2_C::BtnHover_Clear' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, ClosedNotRelease) == 0x0003E8, "Member 'UQuest_Cell2_C::ClosedNotRelease' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Clear) == 0x0003F0, "Member 'UQuest_Cell2_C::Clear' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, PastRelease) == 0x0003F8, "Member 'UQuest_Cell2_C::PastRelease' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, BtnHover_Closed) == 0x000400, "Member 'UQuest_Cell2_C::BtnHover_Closed' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, BtnHover_Now) == 0x000408, "Member 'UQuest_Cell2_C::BtnHover_Now' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Closed) == 0x000410, "Member 'UQuest_Cell2_C::Closed' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, NowPriority) == 0x000418, "Member 'UQuest_Cell2_C::NowPriority' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, NowRelease) == 0x000420, "Member 'UQuest_Cell2_C::NowRelease' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, NowNotRelease) == 0x000428, "Member 'UQuest_Cell2_C::NowNotRelease' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Base) == 0x000430, "Member 'UQuest_Cell2_C::Base' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Base2) == 0x000438, "Member 'UQuest_Cell2_C::Base2' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Base_Clear) == 0x000440, "Member 'UQuest_Cell2_C::Base_Clear' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Base_Close) == 0x000448, "Member 'UQuest_Cell2_C::Base_Close' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Base_Frame) == 0x000450, "Member 'UQuest_Cell2_C::Base_Frame' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Base_Thumbnail) == 0x000458, "Member 'UQuest_Cell2_C::Base_Thumbnail' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Billboard_QuestThumbnail) == 0x000460, "Member 'UQuest_Cell2_C::Billboard_QuestThumbnail' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Frame0) == 0x000468, "Member 'UQuest_Cell2_C::Frame0' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Icon_Clear) == 0x000470, "Member 'UQuest_Cell2_C::Icon_Clear' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Icon_Clear_New) == 0x000478, "Member 'UQuest_Cell2_C::Icon_Clear_New' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Icon_Lock) == 0x000480, "Member 'UQuest_Cell2_C::Icon_Lock' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Icon_NG) == 0x000488, "Member 'UQuest_Cell2_C::Icon_NG' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Icon_SkillPointAdd) == 0x000490, "Member 'UQuest_Cell2_C::Icon_SkillPointAdd' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Img_Effect) == 0x000498, "Member 'UQuest_Cell2_C::Img_Effect' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Img_Member) == 0x0004A0, "Member 'UQuest_Cell2_C::Img_Member' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, NumBase) == 0x0004A8, "Member 'UQuest_Cell2_C::NumBase' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Progress_List) == 0x0004B0, "Member 'UQuest_Cell2_C::Progress_List' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Quest_Btn) == 0x0004B8, "Member 'UQuest_Cell2_C::Quest_Btn' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Quest_PriorityMark) == 0x0004C0, "Member 'UQuest_Cell2_C::Quest_PriorityMark' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, RecommendLevel) == 0x0004C8, "Member 'UQuest_Cell2_C::RecommendLevel' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Title_Base) == 0x0004D0, "Member 'UQuest_Cell2_C::Title_Base' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Title_Base_Hover) == 0x0004D8, "Member 'UQuest_Cell2_C::Title_Base_Hover' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Txt_Clear) == 0x0004E0, "Member 'UQuest_Cell2_C::Txt_Clear' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Txt_Quest_Num) == 0x0004E8, "Member 'UQuest_Cell2_C::Txt_Quest_Num' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Txt_Quest_Title) == 0x0004F0, "Member 'UQuest_Cell2_C::Txt_Quest_Title' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_C, Txt_SkillPointAdd) == 0x0004F8, "Member 'UQuest_Cell2_C::Txt_SkillPointAdd' has a wrong offset!");

}

