#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestBoard_Info

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestBoard_Info.QuestBoard_Info_C
// 0x00B0 (0x0478 - 0x03C8)
class UQuestBoard_Info_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Deco1;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco1_1;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco1_2;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco1_3;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_31;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_52;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_1;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_2;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_3;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_4;                                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_5;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_6;                                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_7;                                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuest_RecommendLevel_C*                RecommendLevel;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Info;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Location;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_LocationTitle;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Name;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_NameTitle;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestBoard_Info_C">();
	}
	static class UQuestBoard_Info_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestBoard_Info_C>();
	}
};
static_assert(alignof(UQuestBoard_Info_C) == 0x000008, "Wrong alignment on UQuestBoard_Info_C");
static_assert(sizeof(UQuestBoard_Info_C) == 0x000478, "Wrong size on UQuestBoard_Info_C");
static_assert(offsetof(UQuestBoard_Info_C, Deco1) == 0x0003C8, "Member 'UQuestBoard_Info_C::Deco1' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Deco1_1) == 0x0003D0, "Member 'UQuestBoard_Info_C::Deco1_1' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Deco1_2) == 0x0003D8, "Member 'UQuestBoard_Info_C::Deco1_2' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Deco1_3) == 0x0003E0, "Member 'UQuestBoard_Info_C::Deco1_3' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, EndImage) == 0x0003E8, "Member 'UQuestBoard_Info_C::EndImage' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, EndImage_31) == 0x0003F0, "Member 'UQuestBoard_Info_C::EndImage_31' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, EndImage_52) == 0x0003F8, "Member 'UQuestBoard_Info_C::EndImage_52' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Line) == 0x000400, "Member 'UQuestBoard_Info_C::Line' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Line_1) == 0x000408, "Member 'UQuestBoard_Info_C::Line_1' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Line_2) == 0x000410, "Member 'UQuestBoard_Info_C::Line_2' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Line_3) == 0x000418, "Member 'UQuestBoard_Info_C::Line_3' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Line_4) == 0x000420, "Member 'UQuestBoard_Info_C::Line_4' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Line_5) == 0x000428, "Member 'UQuestBoard_Info_C::Line_5' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Line_6) == 0x000430, "Member 'UQuestBoard_Info_C::Line_6' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Line_7) == 0x000438, "Member 'UQuestBoard_Info_C::Line_7' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, RecommendLevel) == 0x000440, "Member 'UQuestBoard_Info_C::RecommendLevel' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Txt_Btn) == 0x000448, "Member 'UQuestBoard_Info_C::Txt_Btn' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Txt_Info) == 0x000450, "Member 'UQuestBoard_Info_C::Txt_Info' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Txt_Location) == 0x000458, "Member 'UQuestBoard_Info_C::Txt_Location' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Txt_LocationTitle) == 0x000460, "Member 'UQuestBoard_Info_C::Txt_LocationTitle' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Txt_Name) == 0x000468, "Member 'UQuestBoard_Info_C::Txt_Name' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Info_C, Txt_NameTitle) == 0x000470, "Member 'UQuestBoard_Info_C::Txt_NameTitle' has a wrong offset!");

}

