#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestBoard_Cell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestBoard_Cell.QuestBoard_Cell_C
// 0x0050 (0x0418 - 0x03C8)
class UQuestBoard_Cell_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Loop;                                              // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Received;                                          // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unreceived;                                        // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Poster;                                  // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_60;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LightBase;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Quest_Btn;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ReceivedIcon;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestBoard_Cell_C">();
	}
	static class UQuestBoard_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestBoard_Cell_C>();
	}
};
static_assert(alignof(UQuestBoard_Cell_C) == 0x000008, "Wrong alignment on UQuestBoard_Cell_C");
static_assert(sizeof(UQuestBoard_Cell_C) == 0x000418, "Wrong size on UQuestBoard_Cell_C");
static_assert(offsetof(UQuestBoard_Cell_C, Loop) == 0x0003C8, "Member 'UQuestBoard_Cell_C::Loop' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Cell_C, Received) == 0x0003D0, "Member 'UQuestBoard_Cell_C::Received' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Cell_C, Unreceived) == 0x0003D8, "Member 'UQuestBoard_Cell_C::Unreceived' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Cell_C, BtnHover) == 0x0003E0, "Member 'UQuestBoard_Cell_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Cell_C, Billboard_Poster) == 0x0003E8, "Member 'UQuestBoard_Cell_C::Billboard_Poster' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Cell_C, EndImage_60) == 0x0003F0, "Member 'UQuestBoard_Cell_C::EndImage_60' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Cell_C, Img_BtnLight) == 0x0003F8, "Member 'UQuestBoard_Cell_C::Img_BtnLight' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Cell_C, LightBase) == 0x000400, "Member 'UQuestBoard_Cell_C::LightBase' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Cell_C, Quest_Btn) == 0x000408, "Member 'UQuestBoard_Cell_C::Quest_Btn' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Cell_C, ReceivedIcon) == 0x000410, "Member 'UQuestBoard_Cell_C::ReceivedIcon' has a wrong offset!");

}

