#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Quest_Cell2_Cursor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Quest_Cell2_Cursor.Quest_Cell2_Cursor_C
// 0x0028 (0x03F0 - 0x03C8)
class UQuest_Cell2_Cursor_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Cursor_Left;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame0;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Quest_Cell2_Cursor(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Quest_Cell2_Cursor_C">();
	}
	static class UQuest_Cell2_Cursor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuest_Cell2_Cursor_C>();
	}
};
static_assert(alignof(UQuest_Cell2_Cursor_C) == 0x000008, "Wrong alignment on UQuest_Cell2_Cursor_C");
static_assert(sizeof(UQuest_Cell2_Cursor_C) == 0x0003F0, "Wrong size on UQuest_Cell2_Cursor_C");
static_assert(offsetof(UQuest_Cell2_Cursor_C, UberGraphFrame) == 0x0003C8, "Member 'UQuest_Cell2_Cursor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_Cursor_C, Loop) == 0x0003D0, "Member 'UQuest_Cell2_Cursor_C::Loop' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_Cursor_C, Cursor_Left) == 0x0003D8, "Member 'UQuest_Cell2_Cursor_C::Cursor_Left' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_Cursor_C, Frame0) == 0x0003E0, "Member 'UQuest_Cell2_Cursor_C::Frame0' has a wrong offset!");
static_assert(offsetof(UQuest_Cell2_Cursor_C, Img_BtnLight) == 0x0003E8, "Member 'UQuest_Cell2_Cursor_C::Img_BtnLight' has a wrong offset!");

}

