#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestBoard_Top

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestBoard_Top.QuestBoard_Top_C
// 0x00F8 (0x04E8 - 0x03F0)
class UQuestBoard_Top_C final : public UEndQuestBoardMenu
{
public:
	class UWidgetAnimation*                       Empty;                                             // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2_1;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BlackBase;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco_Bottom;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco_L;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco_R;                                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco_Top1;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco_Top2;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_00;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Light_L;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Light_R;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Line_L;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Line_R;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Quest;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Bottom1;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Bottom2;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_In;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_L;                                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Light;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_R;                                            // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestBoard_Cell_C*                     Poster_1;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestBoard_Cell_C*                     Poster_2;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestBoard_Cell_C*                     Poster_3;                                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestBoard_Cell_C*                     Poster_4;                                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestBoard_Cell_C*                     Poster_5;                                          // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestBoard_Cell_C*                     Poster_6;                                          // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestBoard_Info_C*                     Quest_Info;                                        // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Line;                                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestBoard_Top_C">();
	}
	static class UQuestBoard_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestBoard_Top_C>();
	}
};
static_assert(alignof(UQuestBoard_Top_C) == 0x000008, "Wrong alignment on UQuestBoard_Top_C");
static_assert(sizeof(UQuestBoard_Top_C) == 0x0004E8, "Wrong size on UQuestBoard_Top_C");
static_assert(offsetof(UQuestBoard_Top_C, Empty) == 0x0003F0, "Member 'UQuestBoard_Top_C::Empty' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Menu_In) == 0x0003F8, "Member 'UQuestBoard_Top_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Base) == 0x000400, "Member 'UQuestBoard_Top_C::Base' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Base2_1) == 0x000408, "Member 'UQuestBoard_Top_C::Base2_1' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Billboard_Bg) == 0x000410, "Member 'UQuestBoard_Top_C::Billboard_Bg' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, BlackBase) == 0x000418, "Member 'UQuestBoard_Top_C::BlackBase' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Deco_Bottom) == 0x000420, "Member 'UQuestBoard_Top_C::Deco_Bottom' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Deco_L) == 0x000428, "Member 'UQuestBoard_Top_C::Deco_L' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Deco_R) == 0x000430, "Member 'UQuestBoard_Top_C::Deco_R' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Deco_Top1) == 0x000438, "Member 'UQuestBoard_Top_C::Deco_Top1' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Deco_Top2) == 0x000440, "Member 'UQuestBoard_Top_C::Deco_Top2' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Effect_00) == 0x000448, "Member 'UQuestBoard_Top_C::Effect_00' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Effect_Light_L) == 0x000450, "Member 'UQuestBoard_Top_C::Effect_Light_L' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Effect_Light_R) == 0x000458, "Member 'UQuestBoard_Top_C::Effect_Light_R' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Effect_Line_L) == 0x000460, "Member 'UQuestBoard_Top_C::Effect_Line_L' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Effect_Line_R) == 0x000468, "Member 'UQuestBoard_Top_C::Effect_Line_R' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Icon_Quest) == 0x000470, "Member 'UQuestBoard_Top_C::Icon_Quest' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Line_Bottom1) == 0x000478, "Member 'UQuestBoard_Top_C::Line_Bottom1' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Line_Bottom2) == 0x000480, "Member 'UQuestBoard_Top_C::Line_Bottom2' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Line_In) == 0x000488, "Member 'UQuestBoard_Top_C::Line_In' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Line_L) == 0x000490, "Member 'UQuestBoard_Top_C::Line_L' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Line_Light) == 0x000498, "Member 'UQuestBoard_Top_C::Line_Light' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Line_R) == 0x0004A0, "Member 'UQuestBoard_Top_C::Line_R' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Poster_1) == 0x0004A8, "Member 'UQuestBoard_Top_C::Poster_1' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Poster_2) == 0x0004B0, "Member 'UQuestBoard_Top_C::Poster_2' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Poster_3) == 0x0004B8, "Member 'UQuestBoard_Top_C::Poster_3' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Poster_4) == 0x0004C0, "Member 'UQuestBoard_Top_C::Poster_4' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Poster_5) == 0x0004C8, "Member 'UQuestBoard_Top_C::Poster_5' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Poster_6) == 0x0004D0, "Member 'UQuestBoard_Top_C::Poster_6' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Quest_Info) == 0x0004D8, "Member 'UQuestBoard_Top_C::Quest_Info' has a wrong offset!");
static_assert(offsetof(UQuestBoard_Top_C, Title_Line) == 0x0004E0, "Member 'UQuestBoard_Top_C::Title_Line' has a wrong offset!");

}

