#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Quest_Cell2

#include "Basic.hpp"


namespace SDK::Params
{

// Function Quest_Cell2.Quest_Cell2_C.ExecuteUbergraph_Quest_Cell2
// 0x0008 (0x0008 - 0x0000)
struct Quest_Cell2_C_ExecuteUbergraph_Quest_Cell2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Quest_Cell2_C_ExecuteUbergraph_Quest_Cell2) == 0x000004, "Wrong alignment on Quest_Cell2_C_ExecuteUbergraph_Quest_Cell2");
static_assert(sizeof(Quest_Cell2_C_ExecuteUbergraph_Quest_Cell2) == 0x000008, "Wrong size on Quest_Cell2_C_ExecuteUbergraph_Quest_Cell2");
static_assert(offsetof(Quest_Cell2_C_ExecuteUbergraph_Quest_Cell2, EntryPoint) == 0x000000, "Member 'Quest_Cell2_C_ExecuteUbergraph_Quest_Cell2::EntryPoint' has a wrong offset!");
static_assert(offsetof(Quest_Cell2_C_ExecuteUbergraph_Quest_Cell2, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'Quest_Cell2_C_ExecuteUbergraph_Quest_Cell2::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Quest_Cell2_C_ExecuteUbergraph_Quest_Cell2, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000005, "Member 'Quest_Cell2_C_ExecuteUbergraph_Quest_Cell2::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");

}

