#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Recover_Cell_Light

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Recover_Cell_Light.Recover_Cell_Light_C
// 0x0030 (0x03F8 - 0x03C8)
class URecover_Cell_Light_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       In;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Cursor_Left;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverBase;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Recover_Cell_Light(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Recover_Cell_Light_C">();
	}
	static class URecover_Cell_Light_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URecover_Cell_Light_C>();
	}
};
static_assert(alignof(URecover_Cell_Light_C) == 0x000008, "Wrong alignment on URecover_Cell_Light_C");
static_assert(sizeof(URecover_Cell_Light_C) == 0x0003F8, "Wrong size on URecover_Cell_Light_C");
static_assert(offsetof(URecover_Cell_Light_C, UberGraphFrame) == 0x0003C8, "Member 'URecover_Cell_Light_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URecover_Cell_Light_C, In) == 0x0003D0, "Member 'URecover_Cell_Light_C::In' has a wrong offset!");
static_assert(offsetof(URecover_Cell_Light_C, Loop) == 0x0003D8, "Member 'URecover_Cell_Light_C::Loop' has a wrong offset!");
static_assert(offsetof(URecover_Cell_Light_C, Cursor_Left) == 0x0003E0, "Member 'URecover_Cell_Light_C::Cursor_Left' has a wrong offset!");
static_assert(offsetof(URecover_Cell_Light_C, HoverBase) == 0x0003E8, "Member 'URecover_Cell_Light_C::HoverBase' has a wrong offset!");
static_assert(offsetof(URecover_Cell_Light_C, Img_BtnLight) == 0x0003F0, "Member 'URecover_Cell_Light_C::Img_BtnLight' has a wrong offset!");

}

