#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Recover_Cell

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EndDataBase_structs.hpp"
#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Recover_Cell.Recover_Cell_C
// 0x0070 (0x0468 - 0x03F8)
class URecover_Cell_C final : public UEndRecoverCell
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       BtnRecoverAll_Cancel;                              // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Recover_Valid;                                     // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Recover_Invalid;                                   // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnRecoverAll;                                     // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnDeath;                                          // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnDanger;                                         // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Hover;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPlayerType                                   PlayerType;                                        // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoftObjectPath>                BillBoardPaths;                                    // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Recover_Cell(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Recover_Cell_C">();
	}
	static class URecover_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URecover_Cell_C>();
	}
};
static_assert(alignof(URecover_Cell_C) == 0x000008, "Wrong alignment on URecover_Cell_C");
static_assert(sizeof(URecover_Cell_C) == 0x000468, "Wrong size on URecover_Cell_C");
static_assert(offsetof(URecover_Cell_C, UberGraphFrame) == 0x0003F8, "Member 'URecover_Cell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URecover_Cell_C, BtnRecoverAll_Cancel) == 0x000400, "Member 'URecover_Cell_C::BtnRecoverAll_Cancel' has a wrong offset!");
static_assert(offsetof(URecover_Cell_C, Recover_Valid) == 0x000408, "Member 'URecover_Cell_C::Recover_Valid' has a wrong offset!");
static_assert(offsetof(URecover_Cell_C, Recover_Invalid) == 0x000410, "Member 'URecover_Cell_C::Recover_Invalid' has a wrong offset!");
static_assert(offsetof(URecover_Cell_C, BtnRecoverAll) == 0x000418, "Member 'URecover_Cell_C::BtnRecoverAll' has a wrong offset!");
static_assert(offsetof(URecover_Cell_C, BtnDeath) == 0x000420, "Member 'URecover_Cell_C::BtnDeath' has a wrong offset!");
static_assert(offsetof(URecover_Cell_C, BtnDanger) == 0x000428, "Member 'URecover_Cell_C::BtnDanger' has a wrong offset!");
static_assert(offsetof(URecover_Cell_C, BtnHover) == 0x000430, "Member 'URecover_Cell_C::BtnHover' has a wrong offset!");
static_assert(offsetof(URecover_Cell_C, Base) == 0x000438, "Member 'URecover_Cell_C::Base' has a wrong offset!");
static_assert(offsetof(URecover_Cell_C, Base_Hover) == 0x000440, "Member 'URecover_Cell_C::Base_Hover' has a wrong offset!");
static_assert(offsetof(URecover_Cell_C, MainMenu_Btn) == 0x000448, "Member 'URecover_Cell_C::MainMenu_Btn' has a wrong offset!");
static_assert(offsetof(URecover_Cell_C, PlayerType) == 0x000450, "Member 'URecover_Cell_C::PlayerType' has a wrong offset!");
static_assert(offsetof(URecover_Cell_C, BillBoardPaths) == 0x000458, "Member 'URecover_Cell_C::BillBoardPaths' has a wrong offset!");

}

