#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Report_AreaInfo

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Report_AreaInfo.Report_AreaInfo_C
// 0x0038 (0x0438 - 0x0400)
class UReport_AreaInfo_C final : public UEndAreaMapInfoWindow
{
public:
	class UEndProgressBar*                        AreaProgressBar;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_3;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_54;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_ChadleyPoint;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Complete;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Report_AreaInfo_C">();
	}
	static class UReport_AreaInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReport_AreaInfo_C>();
	}
};
static_assert(alignof(UReport_AreaInfo_C) == 0x000008, "Wrong alignment on UReport_AreaInfo_C");
static_assert(sizeof(UReport_AreaInfo_C) == 0x000438, "Wrong size on UReport_AreaInfo_C");
static_assert(offsetof(UReport_AreaInfo_C, AreaProgressBar) == 0x000400, "Member 'UReport_AreaInfo_C::AreaProgressBar' has a wrong offset!");
static_assert(offsetof(UReport_AreaInfo_C, Base1_3) == 0x000408, "Member 'UReport_AreaInfo_C::Base1_3' has a wrong offset!");
static_assert(offsetof(UReport_AreaInfo_C, EndImage) == 0x000410, "Member 'UReport_AreaInfo_C::EndImage' has a wrong offset!");
static_assert(offsetof(UReport_AreaInfo_C, EndImage_1) == 0x000418, "Member 'UReport_AreaInfo_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UReport_AreaInfo_C, EndImage_54) == 0x000420, "Member 'UReport_AreaInfo_C::EndImage_54' has a wrong offset!");
static_assert(offsetof(UReport_AreaInfo_C, Icon_ChadleyPoint) == 0x000428, "Member 'UReport_AreaInfo_C::Icon_ChadleyPoint' has a wrong offset!");
static_assert(offsetof(UReport_AreaInfo_C, Icon_Complete) == 0x000430, "Member 'UReport_AreaInfo_C::Icon_Complete' has a wrong offset!");

}

