#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Report_Top

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Report_Top.Report_Top_C
// 0x0228 (0x0858 - 0x0630)
class UReport_Top_C final : public UEndWorldReportMenu
{
public:
	class UWidgetAnimation*                       Sort_In;                                           // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToRight;                                           // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToLeft;                                            // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_Out;                                          // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Empty;                                             // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_1;                                           // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_2;                                           // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_3;                                           // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_4;                                           // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_1;                                              // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_2;                                              // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2;                                               // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_1;                                             // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_2;                                             // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_3;                                             // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_4;                                             // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_5;                                             // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_6;                                             // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_7;                                             // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_Billboard;                                      // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_3;                                        // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_114;                                      // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_174;                                      // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2_;                                       // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Chadley;                                      // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Fragment1;                                    // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Fragment2;                                    // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Fragment3;                                    // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Summon;                                       // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left1;                                             // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left2;                                             // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left3;                                             // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left4;                                             // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_1;                                            // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2;                                           // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint;                                         // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_1;                                       // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_2;                                       // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_3;                                       // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_4;                                       // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_5;                                       // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_6;                                       // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_7;                                       // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_8;                                       // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_9;                                       // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_10;                                      // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_11;                                      // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_12;                                      // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_13;                                      // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_14;                                      // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_15;                                      // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_16;                                      // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_17;                                      // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReport_AreaChangeBtn_C*                Report_AreaChangeBtn;                              // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReport_AreaInfo_C*                     Report_AreaInfo;                                   // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReport_Window_C*                       Report_Window;                                     // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UResearchTarget_Top_C*                  ResearchTarget;                                    // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USort_C*                                Sort;                                              // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_Bg2_C*                 System_Bg2;                                        // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Report_Top_C">();
	}
	static class UReport_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReport_Top_C>();
	}
};
static_assert(alignof(UReport_Top_C) == 0x000008, "Wrong alignment on UReport_Top_C");
static_assert(sizeof(UReport_Top_C) == 0x000858, "Wrong size on UReport_Top_C");
static_assert(offsetof(UReport_Top_C, Sort_In) == 0x000630, "Member 'UReport_Top_C::Sort_In' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ToRight) == 0x000638, "Member 'UReport_Top_C::ToRight' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ToLeft) == 0x000640, "Member 'UReport_Top_C::ToLeft' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Menu_Out) == 0x000648, "Member 'UReport_Top_C::Menu_Out' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Menu_In) == 0x000650, "Member 'UReport_Top_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Normal) == 0x000658, "Member 'UReport_Top_C::Normal' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Empty) == 0x000660, "Member 'UReport_Top_C::Empty' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Base) == 0x000668, "Member 'UReport_Top_C::Base' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Base1) == 0x000670, "Member 'UReport_Top_C::Base1' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Base1_1) == 0x000678, "Member 'UReport_Top_C::Base1_1' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Base1_2) == 0x000680, "Member 'UReport_Top_C::Base1_2' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Base1_3) == 0x000688, "Member 'UReport_Top_C::Base1_3' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Base1_4) == 0x000690, "Member 'UReport_Top_C::Base1_4' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Bg) == 0x000698, "Member 'UReport_Top_C::Bg' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Bg_1) == 0x0006A0, "Member 'UReport_Top_C::Bg_1' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Bg_2) == 0x0006A8, "Member 'UReport_Top_C::Bg_2' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Bg2) == 0x0006B0, "Member 'UReport_Top_C::Bg2' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Bg2_1) == 0x0006B8, "Member 'UReport_Top_C::Bg2_1' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Bg2_2) == 0x0006C0, "Member 'UReport_Top_C::Bg2_2' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Bg2_3) == 0x0006C8, "Member 'UReport_Top_C::Bg2_3' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Bg2_4) == 0x0006D0, "Member 'UReport_Top_C::Bg2_4' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Bg2_5) == 0x0006D8, "Member 'UReport_Top_C::Bg2_5' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Bg2_6) == 0x0006E0, "Member 'UReport_Top_C::Bg2_6' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Bg2_7) == 0x0006E8, "Member 'UReport_Top_C::Bg2_7' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Bg_Billboard) == 0x0006F0, "Member 'UReport_Top_C::Bg_Billboard' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, EndImage) == 0x0006F8, "Member 'UReport_Top_C::EndImage' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, EndImage_1) == 0x000700, "Member 'UReport_Top_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, EndImage_2) == 0x000708, "Member 'UReport_Top_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, EndImage_3) == 0x000710, "Member 'UReport_Top_C::EndImage_3' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, EndImage_114) == 0x000718, "Member 'UReport_Top_C::EndImage_114' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, EndImage_174) == 0x000720, "Member 'UReport_Top_C::EndImage_174' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, EndImage_2_) == 0x000728, "Member 'UReport_Top_C::EndImage_2_' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Frame) == 0x000730, "Member 'UReport_Top_C::Frame' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Icon_Chadley) == 0x000738, "Member 'UReport_Top_C::Icon_Chadley' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Icon_Fragment1) == 0x000740, "Member 'UReport_Top_C::Icon_Fragment1' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Icon_Fragment2) == 0x000748, "Member 'UReport_Top_C::Icon_Fragment2' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Icon_Fragment3) == 0x000750, "Member 'UReport_Top_C::Icon_Fragment3' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Icon_Summon) == 0x000758, "Member 'UReport_Top_C::Icon_Summon' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Left1) == 0x000760, "Member 'UReport_Top_C::Left1' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Left2) == 0x000768, "Member 'UReport_Top_C::Left2' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Left3) == 0x000770, "Member 'UReport_Top_C::Left3' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Left4) == 0x000778, "Member 'UReport_Top_C::Left4' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Line) == 0x000780, "Member 'UReport_Top_C::Line' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Line_1) == 0x000788, "Member 'UReport_Top_C::Line_1' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListBg2) == 0x000790, "Member 'UReport_Top_C::ListBg2' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint) == 0x000798, "Member 'UReport_Top_C::ListPoint' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_1) == 0x0007A0, "Member 'UReport_Top_C::ListPoint_1' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_2) == 0x0007A8, "Member 'UReport_Top_C::ListPoint_2' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_3) == 0x0007B0, "Member 'UReport_Top_C::ListPoint_3' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_4) == 0x0007B8, "Member 'UReport_Top_C::ListPoint_4' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_5) == 0x0007C0, "Member 'UReport_Top_C::ListPoint_5' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_6) == 0x0007C8, "Member 'UReport_Top_C::ListPoint_6' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_7) == 0x0007D0, "Member 'UReport_Top_C::ListPoint_7' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_8) == 0x0007D8, "Member 'UReport_Top_C::ListPoint_8' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_9) == 0x0007E0, "Member 'UReport_Top_C::ListPoint_9' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_10) == 0x0007E8, "Member 'UReport_Top_C::ListPoint_10' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_11) == 0x0007F0, "Member 'UReport_Top_C::ListPoint_11' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_12) == 0x0007F8, "Member 'UReport_Top_C::ListPoint_12' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_13) == 0x000800, "Member 'UReport_Top_C::ListPoint_13' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_14) == 0x000808, "Member 'UReport_Top_C::ListPoint_14' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_15) == 0x000810, "Member 'UReport_Top_C::ListPoint_15' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_16) == 0x000818, "Member 'UReport_Top_C::ListPoint_16' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ListPoint_17) == 0x000820, "Member 'UReport_Top_C::ListPoint_17' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Report_AreaChangeBtn) == 0x000828, "Member 'UReport_Top_C::Report_AreaChangeBtn' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Report_AreaInfo) == 0x000830, "Member 'UReport_Top_C::Report_AreaInfo' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Report_Window) == 0x000838, "Member 'UReport_Top_C::Report_Window' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, ResearchTarget) == 0x000840, "Member 'UReport_Top_C::ResearchTarget' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, Sort) == 0x000848, "Member 'UReport_Top_C::Sort' has a wrong offset!");
static_assert(offsetof(UReport_Top_C, System_Bg2) == 0x000850, "Member 'UReport_Top_C::System_Bg2' has a wrong offset!");

}

