#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Report_Content_Window

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Report_Content_Window.Report_Content_Window_C
// 0x00B8 (0x0530 - 0x0478)
class UReport_Content_Window_C final : public UEndWorldReportProgressWindow
{
public:
	class UWidgetAnimation*                       Menu_Out;                                          // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToRight;                                           // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToLeft;                                            // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_1;                                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_3;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_4;                                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BlackBg;                                           // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReport_Content_Tag_C*                  Cell_1;                                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReport_Content_Tag_C*                  Cell_2;                                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReport_Content_Tag_C*                  Cell_3;                                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReport_Content_Tag_C*                  Cell_4;                                            // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReport_Content_Tag_C*                  Cell_5;                                            // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReport_AreaChangeBtn_C*                ContentTitle;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left1;                                             // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left2;                                             // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left3;                                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left4;                                             // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PointLeft;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PointRight;                                        // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_Bg2_C*                 System_Bg2;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Report_Content_Window_C">();
	}
	static class UReport_Content_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReport_Content_Window_C>();
	}
};
static_assert(alignof(UReport_Content_Window_C) == 0x000008, "Wrong alignment on UReport_Content_Window_C");
static_assert(sizeof(UReport_Content_Window_C) == 0x000530, "Wrong size on UReport_Content_Window_C");
static_assert(offsetof(UReport_Content_Window_C, Menu_Out) == 0x000478, "Member 'UReport_Content_Window_C::Menu_Out' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, Menu_In) == 0x000480, "Member 'UReport_Content_Window_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, ToRight) == 0x000488, "Member 'UReport_Content_Window_C::ToRight' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, ToLeft) == 0x000490, "Member 'UReport_Content_Window_C::ToLeft' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, Out) == 0x000498, "Member 'UReport_Content_Window_C::Out' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, In) == 0x0004A0, "Member 'UReport_Content_Window_C::In' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, Base_1) == 0x0004A8, "Member 'UReport_Content_Window_C::Base_1' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, Base1_3) == 0x0004B0, "Member 'UReport_Content_Window_C::Base1_3' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, Base1_4) == 0x0004B8, "Member 'UReport_Content_Window_C::Base1_4' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, BlackBg) == 0x0004C0, "Member 'UReport_Content_Window_C::BlackBg' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, Cell_1) == 0x0004C8, "Member 'UReport_Content_Window_C::Cell_1' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, Cell_2) == 0x0004D0, "Member 'UReport_Content_Window_C::Cell_2' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, Cell_3) == 0x0004D8, "Member 'UReport_Content_Window_C::Cell_3' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, Cell_4) == 0x0004E0, "Member 'UReport_Content_Window_C::Cell_4' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, Cell_5) == 0x0004E8, "Member 'UReport_Content_Window_C::Cell_5' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, ContentTitle) == 0x0004F0, "Member 'UReport_Content_Window_C::ContentTitle' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, Left1) == 0x0004F8, "Member 'UReport_Content_Window_C::Left1' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, Left2) == 0x000500, "Member 'UReport_Content_Window_C::Left2' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, Left3) == 0x000508, "Member 'UReport_Content_Window_C::Left3' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, Left4) == 0x000510, "Member 'UReport_Content_Window_C::Left4' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, PointLeft) == 0x000518, "Member 'UReport_Content_Window_C::PointLeft' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, PointRight) == 0x000520, "Member 'UReport_Content_Window_C::PointRight' has a wrong offset!");
static_assert(offsetof(UReport_Content_Window_C, System_Bg2) == 0x000528, "Member 'UReport_Content_Window_C::System_Bg2' has a wrong offset!");

}

