#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Report_Content_ListCell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Report_Content_ListCell.Report_Content_ListCell_C
// 0x0058 (0x0470 - 0x0418)
class UReport_Content_ListCell_C final : public UEndResearchTargetList
{
public:
	class UWidgetAnimation*                       Complete;                                          // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnListOnly;                                       // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Clear;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Title;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point2;                                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point2_1;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point2_2;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Report_Content_ListCell_C">();
	}
	static class UReport_Content_ListCell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReport_Content_ListCell_C>();
	}
};
static_assert(alignof(UReport_Content_ListCell_C) == 0x000008, "Wrong alignment on UReport_Content_ListCell_C");
static_assert(sizeof(UReport_Content_ListCell_C) == 0x000470, "Wrong size on UReport_Content_ListCell_C");
static_assert(offsetof(UReport_Content_ListCell_C, Complete) == 0x000418, "Member 'UReport_Content_ListCell_C::Complete' has a wrong offset!");
static_assert(offsetof(UReport_Content_ListCell_C, BtnListOnly) == 0x000420, "Member 'UReport_Content_ListCell_C::BtnListOnly' has a wrong offset!");
static_assert(offsetof(UReport_Content_ListCell_C, Normal) == 0x000428, "Member 'UReport_Content_ListCell_C::Normal' has a wrong offset!");
static_assert(offsetof(UReport_Content_ListCell_C, Selected) == 0x000430, "Member 'UReport_Content_ListCell_C::Selected' has a wrong offset!");
static_assert(offsetof(UReport_Content_ListCell_C, Base1) == 0x000438, "Member 'UReport_Content_ListCell_C::Base1' has a wrong offset!");
static_assert(offsetof(UReport_Content_ListCell_C, Icon_Clear) == 0x000440, "Member 'UReport_Content_ListCell_C::Icon_Clear' has a wrong offset!");
static_assert(offsetof(UReport_Content_ListCell_C, Icon_Title) == 0x000448, "Member 'UReport_Content_ListCell_C::Icon_Title' has a wrong offset!");
static_assert(offsetof(UReport_Content_ListCell_C, Line) == 0x000450, "Member 'UReport_Content_ListCell_C::Line' has a wrong offset!");
static_assert(offsetof(UReport_Content_ListCell_C, Point2) == 0x000458, "Member 'UReport_Content_ListCell_C::Point2' has a wrong offset!");
static_assert(offsetof(UReport_Content_ListCell_C, Point2_1) == 0x000460, "Member 'UReport_Content_ListCell_C::Point2_1' has a wrong offset!");
static_assert(offsetof(UReport_Content_ListCell_C, Point2_2) == 0x000468, "Member 'UReport_Content_ListCell_C::Point2_2' has a wrong offset!");

}

