#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Report_Detail

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Report_Detail.Report_Detail_C
// 0x0110 (0x04D8 - 0x03C8)
class UReport_Detail_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Normal_Chadley;                                    // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseLine1;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseLine2;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseLine3;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseLine3_1;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseLine3_2;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseLine3_3;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg2;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_ReportImg;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_29;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_58;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Title;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_1;                                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line4;                                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line4_2;                                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line4_3;                                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuest_RecommendLevel_C*                RecommendLevel;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TermBase;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TermBase_1;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TermBase_3;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TermBase_4;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TermBase_5;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TermBase_6;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Info;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ReportTitle;                                   // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Term2;                                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Term3;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TermTitle;                                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TermTitle_2;                                   // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Report_Detail_C">();
	}
	static class UReport_Detail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReport_Detail_C>();
	}
};
static_assert(alignof(UReport_Detail_C) == 0x000008, "Wrong alignment on UReport_Detail_C");
static_assert(sizeof(UReport_Detail_C) == 0x0004D8, "Wrong size on UReport_Detail_C");
static_assert(offsetof(UReport_Detail_C, Normal_Chadley) == 0x0003C8, "Member 'UReport_Detail_C::Normal_Chadley' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Normal) == 0x0003D0, "Member 'UReport_Detail_C::Normal' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Base1) == 0x0003D8, "Member 'UReport_Detail_C::Base1' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, BaseLine1) == 0x0003E0, "Member 'UReport_Detail_C::BaseLine1' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, BaseLine2) == 0x0003E8, "Member 'UReport_Detail_C::BaseLine2' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, BaseLine3) == 0x0003F0, "Member 'UReport_Detail_C::BaseLine3' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, BaseLine3_1) == 0x0003F8, "Member 'UReport_Detail_C::BaseLine3_1' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, BaseLine3_2) == 0x000400, "Member 'UReport_Detail_C::BaseLine3_2' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, BaseLine3_3) == 0x000408, "Member 'UReport_Detail_C::BaseLine3_3' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Billboard_Bg) == 0x000410, "Member 'UReport_Detail_C::Billboard_Bg' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Billboard_Bg2) == 0x000418, "Member 'UReport_Detail_C::Billboard_Bg2' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Billboard_ReportImg) == 0x000420, "Member 'UReport_Detail_C::Billboard_ReportImg' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, EndImage) == 0x000428, "Member 'UReport_Detail_C::EndImage' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, EndImage_1) == 0x000430, "Member 'UReport_Detail_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, EndImage_29) == 0x000438, "Member 'UReport_Detail_C::EndImage_29' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, EndImage_58) == 0x000440, "Member 'UReport_Detail_C::EndImage_58' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Icon_Title) == 0x000448, "Member 'UReport_Detail_C::Icon_Title' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Line_1) == 0x000450, "Member 'UReport_Detail_C::Line_1' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Line4) == 0x000458, "Member 'UReport_Detail_C::Line4' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Line4_2) == 0x000460, "Member 'UReport_Detail_C::Line4_2' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Line4_3) == 0x000468, "Member 'UReport_Detail_C::Line4_3' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, RecommendLevel) == 0x000470, "Member 'UReport_Detail_C::RecommendLevel' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, TermBase) == 0x000478, "Member 'UReport_Detail_C::TermBase' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, TermBase_1) == 0x000480, "Member 'UReport_Detail_C::TermBase_1' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, TermBase_3) == 0x000488, "Member 'UReport_Detail_C::TermBase_3' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, TermBase_4) == 0x000490, "Member 'UReport_Detail_C::TermBase_4' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, TermBase_5) == 0x000498, "Member 'UReport_Detail_C::TermBase_5' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, TermBase_6) == 0x0004A0, "Member 'UReport_Detail_C::TermBase_6' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Txt_Info) == 0x0004A8, "Member 'UReport_Detail_C::Txt_Info' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Txt_ReportTitle) == 0x0004B0, "Member 'UReport_Detail_C::Txt_ReportTitle' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Txt_Term2) == 0x0004B8, "Member 'UReport_Detail_C::Txt_Term2' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Txt_Term3) == 0x0004C0, "Member 'UReport_Detail_C::Txt_Term3' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Txt_TermTitle) == 0x0004C8, "Member 'UReport_Detail_C::Txt_TermTitle' has a wrong offset!");
static_assert(offsetof(UReport_Detail_C, Txt_TermTitle_2) == 0x0004D0, "Member 'UReport_Detail_C::Txt_TermTitle_2' has a wrong offset!");

}

