#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReserveMemberCommand_Effect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ReserveMemberCommand_Effect.ReserveMemberCommand_Effect_C
// 0x0018 (0x03E0 - 0x03C8)
class UReserveMemberCommand_Effect_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              EndImage_71;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ReserveMemberCommand_Effect(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReserveMemberCommand_Effect_C">();
	}
	static class UReserveMemberCommand_Effect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReserveMemberCommand_Effect_C>();
	}
};
static_assert(alignof(UReserveMemberCommand_Effect_C) == 0x000008, "Wrong alignment on UReserveMemberCommand_Effect_C");
static_assert(sizeof(UReserveMemberCommand_Effect_C) == 0x0003E0, "Wrong size on UReserveMemberCommand_Effect_C");
static_assert(offsetof(UReserveMemberCommand_Effect_C, UberGraphFrame) == 0x0003C8, "Member 'UReserveMemberCommand_Effect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UReserveMemberCommand_Effect_C, Loop) == 0x0003D0, "Member 'UReserveMemberCommand_Effect_C::Loop' has a wrong offset!");
static_assert(offsetof(UReserveMemberCommand_Effect_C, EndImage_71) == 0x0003D8, "Member 'UReserveMemberCommand_Effect_C::EndImage_71' has a wrong offset!");

}

