#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ResearchTarget_Info

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ResearchTarget_Info.ResearchTarget_Info_C
// 0x00C8 (0x0490 - 0x03C8)
class UResearchTarget_Info_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Base;                                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_2;                                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_4;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_5;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg2;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_ResearchTarget;                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_58;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon;                                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_ReportList;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_InfoWindowBg_C*               InfoWindowBg;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_3;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_4;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_5;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_6;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_7;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_8;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuest_RecommendLevel_C*                RecommendLevel;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TermBase_1;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TermBase_Line;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_GuideBtn1;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_GuideBtn2;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ListValue;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_MateriaName;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TermTitle;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ResearchTarget_Info_C">();
	}
	static class UResearchTarget_Info_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResearchTarget_Info_C>();
	}
};
static_assert(alignof(UResearchTarget_Info_C) == 0x000008, "Wrong alignment on UResearchTarget_Info_C");
static_assert(sizeof(UResearchTarget_Info_C) == 0x000490, "Wrong size on UResearchTarget_Info_C");
static_assert(offsetof(UResearchTarget_Info_C, Base) == 0x0003C8, "Member 'UResearchTarget_Info_C::Base' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, Bg_2) == 0x0003D0, "Member 'UResearchTarget_Info_C::Bg_2' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, Bg2_4) == 0x0003D8, "Member 'UResearchTarget_Info_C::Bg2_4' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, Bg2_5) == 0x0003E0, "Member 'UResearchTarget_Info_C::Bg2_5' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, Billboard_Bg) == 0x0003E8, "Member 'UResearchTarget_Info_C::Billboard_Bg' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, Billboard_Bg2) == 0x0003F0, "Member 'UResearchTarget_Info_C::Billboard_Bg2' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, Billboard_ResearchTarget) == 0x0003F8, "Member 'UResearchTarget_Info_C::Billboard_ResearchTarget' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, EndImage_58) == 0x000400, "Member 'UResearchTarget_Info_C::EndImage_58' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, Icon) == 0x000408, "Member 'UResearchTarget_Info_C::Icon' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, Icon_ReportList) == 0x000410, "Member 'UResearchTarget_Info_C::Icon_ReportList' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, InfoWindowBg) == 0x000418, "Member 'UResearchTarget_Info_C::InfoWindowBg' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, ListPoint_3) == 0x000420, "Member 'UResearchTarget_Info_C::ListPoint_3' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, ListPoint_4) == 0x000428, "Member 'UResearchTarget_Info_C::ListPoint_4' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, ListPoint_5) == 0x000430, "Member 'UResearchTarget_Info_C::ListPoint_5' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, ListPoint_6) == 0x000438, "Member 'UResearchTarget_Info_C::ListPoint_6' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, ListPoint_7) == 0x000440, "Member 'UResearchTarget_Info_C::ListPoint_7' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, ListPoint_8) == 0x000448, "Member 'UResearchTarget_Info_C::ListPoint_8' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, RecommendLevel) == 0x000450, "Member 'UResearchTarget_Info_C::RecommendLevel' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, TermBase_1) == 0x000458, "Member 'UResearchTarget_Info_C::TermBase_1' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, TermBase_Line) == 0x000460, "Member 'UResearchTarget_Info_C::TermBase_Line' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, Txt_GuideBtn1) == 0x000468, "Member 'UResearchTarget_Info_C::Txt_GuideBtn1' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, Txt_GuideBtn2) == 0x000470, "Member 'UResearchTarget_Info_C::Txt_GuideBtn2' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, Txt_ListValue) == 0x000478, "Member 'UResearchTarget_Info_C::Txt_ListValue' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, Txt_MateriaName) == 0x000480, "Member 'UResearchTarget_Info_C::Txt_MateriaName' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Info_C, Txt_TermTitle) == 0x000488, "Member 'UResearchTarget_Info_C::Txt_TermTitle' has a wrong offset!");

}

