#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ResearchTarget_Btn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ResearchTarget_Btn.ResearchTarget_Btn_C
// 0x00A8 (0x04A0 - 0x03F8)
class UResearchTarget_Btn_C final : public UEndResearchTargetBtn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Clear;                                             // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Locked;                                            // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unreleased;                                        // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Released;                                          // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_1;                                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_3;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_1;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_Arrow1;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_Arrow2;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_Arrow3;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_Arrow4;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_52;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_124;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame_1;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame_2;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Lock;                                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Mission;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Target_Btn;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ResearchTarget_Btn(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ResearchTarget_Btn_C">();
	}
	static class UResearchTarget_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResearchTarget_Btn_C>();
	}
};
static_assert(alignof(UResearchTarget_Btn_C) == 0x000008, "Wrong alignment on UResearchTarget_Btn_C");
static_assert(sizeof(UResearchTarget_Btn_C) == 0x0004A0, "Wrong size on UResearchTarget_Btn_C");
static_assert(offsetof(UResearchTarget_Btn_C, UberGraphFrame) == 0x0003F8, "Member 'UResearchTarget_Btn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Loop) == 0x000400, "Member 'UResearchTarget_Btn_C::Loop' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Clear) == 0x000408, "Member 'UResearchTarget_Btn_C::Clear' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Locked) == 0x000410, "Member 'UResearchTarget_Btn_C::Locked' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Unreleased) == 0x000418, "Member 'UResearchTarget_Btn_C::Unreleased' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Released) == 0x000420, "Member 'UResearchTarget_Btn_C::Released' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, BtnHover) == 0x000428, "Member 'UResearchTarget_Btn_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Base_1) == 0x000430, "Member 'UResearchTarget_Btn_C::Base_1' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Base1_3) == 0x000438, "Member 'UResearchTarget_Btn_C::Base1_3' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Cursor_1) == 0x000440, "Member 'UResearchTarget_Btn_C::Cursor_1' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Cursor_Arrow1) == 0x000448, "Member 'UResearchTarget_Btn_C::Cursor_Arrow1' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Cursor_Arrow2) == 0x000450, "Member 'UResearchTarget_Btn_C::Cursor_Arrow2' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Cursor_Arrow3) == 0x000458, "Member 'UResearchTarget_Btn_C::Cursor_Arrow3' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Cursor_Arrow4) == 0x000460, "Member 'UResearchTarget_Btn_C::Cursor_Arrow4' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, EndImage_52) == 0x000468, "Member 'UResearchTarget_Btn_C::EndImage_52' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, EndImage_124) == 0x000470, "Member 'UResearchTarget_Btn_C::EndImage_124' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Frame_1) == 0x000478, "Member 'UResearchTarget_Btn_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Frame_2) == 0x000480, "Member 'UResearchTarget_Btn_C::Frame_2' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Icon_Lock) == 0x000488, "Member 'UResearchTarget_Btn_C::Icon_Lock' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Icon_Mission) == 0x000490, "Member 'UResearchTarget_Btn_C::Icon_Mission' has a wrong offset!");
static_assert(offsetof(UResearchTarget_Btn_C, Target_Btn) == 0x000498, "Member 'UResearchTarget_Btn_C::Target_Btn' has a wrong offset!");

}

