#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveData

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SaveData.SaveData_C
// 0x00C8 (0x0490 - 0x03C8)
class USaveData_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Menu_In;                                           // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_SaveData;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2;                                               // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_1;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_2;                                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg2_3;                                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Img;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CategoryIcon;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCategoryTitle_C*                       CategoryTitle;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_1;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_2;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_3;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_4;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_5;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_6;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_7;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_8;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Window_00_C*                  MainMenu_Window_00;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgLeft_C*              System_BgLeft;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgLeft_C*              System_BgLeft2;                                    // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgRight_C*             System_BgRight;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SaveData(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SaveData_C">();
	}
	static class USaveData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USaveData_C>();
	}
};
static_assert(alignof(USaveData_C) == 0x000008, "Wrong alignment on USaveData_C");
static_assert(sizeof(USaveData_C) == 0x000490, "Wrong size on USaveData_C");
static_assert(offsetof(USaveData_C, UberGraphFrame) == 0x0003C8, "Member 'USaveData_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USaveData_C, Menu_In) == 0x0003D0, "Member 'USaveData_C::Menu_In' has a wrong offset!");
static_assert(offsetof(USaveData_C, All_SaveData) == 0x0003D8, "Member 'USaveData_C::All_SaveData' has a wrong offset!");
static_assert(offsetof(USaveData_C, Bg) == 0x0003E0, "Member 'USaveData_C::Bg' has a wrong offset!");
static_assert(offsetof(USaveData_C, Bg2) == 0x0003E8, "Member 'USaveData_C::Bg2' has a wrong offset!");
static_assert(offsetof(USaveData_C, Bg2_1) == 0x0003F0, "Member 'USaveData_C::Bg2_1' has a wrong offset!");
static_assert(offsetof(USaveData_C, Bg2_2) == 0x0003F8, "Member 'USaveData_C::Bg2_2' has a wrong offset!");
static_assert(offsetof(USaveData_C, Bg2_3) == 0x000400, "Member 'USaveData_C::Bg2_3' has a wrong offset!");
static_assert(offsetof(USaveData_C, Billboard_Img) == 0x000408, "Member 'USaveData_C::Billboard_Img' has a wrong offset!");
static_assert(offsetof(USaveData_C, CategoryIcon) == 0x000410, "Member 'USaveData_C::CategoryIcon' has a wrong offset!");
static_assert(offsetof(USaveData_C, CategoryTitle) == 0x000418, "Member 'USaveData_C::CategoryTitle' has a wrong offset!");
static_assert(offsetof(USaveData_C, ListBg2) == 0x000420, "Member 'USaveData_C::ListBg2' has a wrong offset!");
static_assert(offsetof(USaveData_C, ListPoint) == 0x000428, "Member 'USaveData_C::ListPoint' has a wrong offset!");
static_assert(offsetof(USaveData_C, ListPoint_1) == 0x000430, "Member 'USaveData_C::ListPoint_1' has a wrong offset!");
static_assert(offsetof(USaveData_C, ListPoint_2) == 0x000438, "Member 'USaveData_C::ListPoint_2' has a wrong offset!");
static_assert(offsetof(USaveData_C, ListPoint_3) == 0x000440, "Member 'USaveData_C::ListPoint_3' has a wrong offset!");
static_assert(offsetof(USaveData_C, ListPoint_4) == 0x000448, "Member 'USaveData_C::ListPoint_4' has a wrong offset!");
static_assert(offsetof(USaveData_C, ListPoint_5) == 0x000450, "Member 'USaveData_C::ListPoint_5' has a wrong offset!");
static_assert(offsetof(USaveData_C, ListPoint_6) == 0x000458, "Member 'USaveData_C::ListPoint_6' has a wrong offset!");
static_assert(offsetof(USaveData_C, ListPoint_7) == 0x000460, "Member 'USaveData_C::ListPoint_7' has a wrong offset!");
static_assert(offsetof(USaveData_C, ListPoint_8) == 0x000468, "Member 'USaveData_C::ListPoint_8' has a wrong offset!");
static_assert(offsetof(USaveData_C, MainMenu_Window_00) == 0x000470, "Member 'USaveData_C::MainMenu_Window_00' has a wrong offset!");
static_assert(offsetof(USaveData_C, System_BgLeft) == 0x000478, "Member 'USaveData_C::System_BgLeft' has a wrong offset!");
static_assert(offsetof(USaveData_C, System_BgLeft2) == 0x000480, "Member 'USaveData_C::System_BgLeft2' has a wrong offset!");
static_assert(offsetof(USaveData_C, System_BgRight) == 0x000488, "Member 'USaveData_C::System_BgRight' has a wrong offset!");

}

