#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveData_CellLight

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SaveData_CellLight.SaveData_CellLight_C.ExecuteUbergraph_SaveData_CellLight
// 0x0008 (0x0008 - 0x0000)
struct SaveData_CellLight_C_ExecuteUbergraph_SaveData_CellLight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SaveData_CellLight_C_ExecuteUbergraph_SaveData_CellLight) == 0x000004, "Wrong alignment on SaveData_CellLight_C_ExecuteUbergraph_SaveData_CellLight");
static_assert(sizeof(SaveData_CellLight_C_ExecuteUbergraph_SaveData_CellLight) == 0x000008, "Wrong size on SaveData_CellLight_C_ExecuteUbergraph_SaveData_CellLight");
static_assert(offsetof(SaveData_CellLight_C_ExecuteUbergraph_SaveData_CellLight, EntryPoint) == 0x000000, "Member 'SaveData_CellLight_C_ExecuteUbergraph_SaveData_CellLight::EntryPoint' has a wrong offset!");
static_assert(offsetof(SaveData_CellLight_C_ExecuteUbergraph_SaveData_CellLight, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'SaveData_CellLight_C_ExecuteUbergraph_SaveData_CellLight::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");

// Function SaveData_CellLight.SaveData_CellLight_C.OnKeyDown
// 0x0128 (0x0128 - 0x0000)
struct SaveData_CellLight_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(SaveData_CellLight_C_OnKeyDown) == 0x000008, "Wrong alignment on SaveData_CellLight_C_OnKeyDown");
static_assert(sizeof(SaveData_CellLight_C_OnKeyDown) == 0x000128, "Wrong size on SaveData_CellLight_C_OnKeyDown");
static_assert(offsetof(SaveData_CellLight_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'SaveData_CellLight_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(SaveData_CellLight_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'SaveData_CellLight_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(SaveData_CellLight_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'SaveData_CellLight_C_OnKeyDown::ReturnValue' has a wrong offset!");

}

