#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveData_Cell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SaveData_Cell.SaveData_Cell_C
// 0x0180 (0x0590 - 0x0410)
class USaveData_Cell_C final : public UEndSaveDataCell
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       NiblheimHover;                                     // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ZackHover;                                         // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AutoSave;                                          // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnIn;                                             // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnNormal;                                         // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_SaveDate_List;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2_1;                                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2_Clear;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseAll;                                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseAll_Hover;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Button_00;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_170;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BG;                                            // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Billboard_Claer;                               // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Billboard_Layer;                               // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_ClearBase1;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Icon_Loca;                                     // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_SaveScreen;                                    // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListNum_Base;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListNum_Base_1;                                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_3;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_4;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_5;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_6;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_7;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_8;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              marubase;                                          // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Contents;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Date;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Finished;                                      // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ListNum;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_PlayTime;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_SaveMode;                                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Time;                                          // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title_Loca;                                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title_Mission;                                 // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title_PlayTime;                                // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class USaveData_Cell_C* Sender)> OnClicked;                                         // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnCancelled;                                       // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_SaveData_Cell(int32 EntryPoint);
	void BndEvt__Button_00_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_00_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SaveData_Cell_C">();
	}
	static class USaveData_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USaveData_Cell_C>();
	}
};
static_assert(alignof(USaveData_Cell_C) == 0x000008, "Wrong alignment on USaveData_Cell_C");
static_assert(sizeof(USaveData_Cell_C) == 0x000590, "Wrong size on USaveData_Cell_C");
static_assert(offsetof(USaveData_Cell_C, UberGraphFrame) == 0x000410, "Member 'USaveData_Cell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, NiblheimHover) == 0x000418, "Member 'USaveData_Cell_C::NiblheimHover' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, ZackHover) == 0x000420, "Member 'USaveData_Cell_C::ZackHover' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Normal) == 0x000428, "Member 'USaveData_Cell_C::Normal' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, AutoSave) == 0x000430, "Member 'USaveData_Cell_C::AutoSave' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, BtnIn) == 0x000438, "Member 'USaveData_Cell_C::BtnIn' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, BtnNormal) == 0x000440, "Member 'USaveData_Cell_C::BtnNormal' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, BtnHover) == 0x000448, "Member 'USaveData_Cell_C::BtnHover' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, All_SaveDate_List) == 0x000450, "Member 'USaveData_Cell_C::All_SaveDate_List' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Base2) == 0x000458, "Member 'USaveData_Cell_C::Base2' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Base2_1) == 0x000460, "Member 'USaveData_Cell_C::Base2_1' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Base2_Clear) == 0x000468, "Member 'USaveData_Cell_C::Base2_Clear' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, BaseAll) == 0x000470, "Member 'USaveData_Cell_C::BaseAll' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, BaseAll_Hover) == 0x000478, "Member 'USaveData_Cell_C::BaseAll_Hover' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Button_00) == 0x000480, "Member 'USaveData_Cell_C::Button_00' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, EndImage) == 0x000488, "Member 'USaveData_Cell_C::EndImage' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, EndImage_170) == 0x000490, "Member 'USaveData_Cell_C::EndImage_170' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Frame) == 0x000498, "Member 'USaveData_Cell_C::Frame' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Img_BG) == 0x0004A0, "Member 'USaveData_Cell_C::Img_BG' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Img_Billboard_Claer) == 0x0004A8, "Member 'USaveData_Cell_C::Img_Billboard_Claer' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Img_Billboard_Layer) == 0x0004B0, "Member 'USaveData_Cell_C::Img_Billboard_Layer' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Img_ClearBase1) == 0x0004B8, "Member 'USaveData_Cell_C::Img_ClearBase1' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Img_Icon_Loca) == 0x0004C0, "Member 'USaveData_Cell_C::Img_Icon_Loca' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Img_SaveScreen) == 0x0004C8, "Member 'USaveData_Cell_C::Img_SaveScreen' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Line) == 0x0004D0, "Member 'USaveData_Cell_C::Line' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, ListNum_Base) == 0x0004D8, "Member 'USaveData_Cell_C::ListNum_Base' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, ListNum_Base_1) == 0x0004E0, "Member 'USaveData_Cell_C::ListNum_Base_1' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, ListPoint_3) == 0x0004E8, "Member 'USaveData_Cell_C::ListPoint_3' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, ListPoint_4) == 0x0004F0, "Member 'USaveData_Cell_C::ListPoint_4' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, ListPoint_5) == 0x0004F8, "Member 'USaveData_Cell_C::ListPoint_5' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, ListPoint_6) == 0x000500, "Member 'USaveData_Cell_C::ListPoint_6' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, ListPoint_7) == 0x000508, "Member 'USaveData_Cell_C::ListPoint_7' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, ListPoint_8) == 0x000510, "Member 'USaveData_Cell_C::ListPoint_8' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, marubase) == 0x000518, "Member 'USaveData_Cell_C::marubase' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Nut_Contents) == 0x000520, "Member 'USaveData_Cell_C::Nut_Contents' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_Date) == 0x000528, "Member 'USaveData_Cell_C::Txt_Date' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_Finished) == 0x000530, "Member 'USaveData_Cell_C::Txt_Finished' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_ListNum) == 0x000538, "Member 'USaveData_Cell_C::Txt_ListNum' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_PlayTime) == 0x000540, "Member 'USaveData_Cell_C::Txt_PlayTime' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_SaveMode) == 0x000548, "Member 'USaveData_Cell_C::Txt_SaveMode' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_Time) == 0x000550, "Member 'USaveData_Cell_C::Txt_Time' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_Title_Loca) == 0x000558, "Member 'USaveData_Cell_C::Txt_Title_Loca' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_Title_Mission) == 0x000560, "Member 'USaveData_Cell_C::Txt_Title_Mission' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_Title_PlayTime) == 0x000568, "Member 'USaveData_Cell_C::Txt_Title_PlayTime' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, OnClicked) == 0x000570, "Member 'USaveData_Cell_C::OnClicked' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, OnCancelled) == 0x000580, "Member 'USaveData_Cell_C::OnCancelled' has a wrong offset!");

}

