#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Screenshot

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Screenshot.Screenshot_C
// 0x0018 (0x05B8 - 0x05A0)
class UScreenshot_C final : public UEndCameraModeMenu
{
public:
	class UWidgetAnimation*                       In;                                                // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Flame;                                   // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScreenshot_Item_C*                     Screenshot_Item;                                   // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Screenshot_C">();
	}
	static class UScreenshot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScreenshot_C>();
	}
};
static_assert(alignof(UScreenshot_C) == 0x000008, "Wrong alignment on UScreenshot_C");
static_assert(sizeof(UScreenshot_C) == 0x0005B8, "Wrong size on UScreenshot_C");
static_assert(offsetof(UScreenshot_C, In) == 0x0005A0, "Member 'UScreenshot_C::In' has a wrong offset!");
static_assert(offsetof(UScreenshot_C, Billboard_Flame) == 0x0005A8, "Member 'UScreenshot_C::Billboard_Flame' has a wrong offset!");
static_assert(offsetof(UScreenshot_C, Screenshot_Item) == 0x0005B0, "Member 'UScreenshot_C::Screenshot_Item' has a wrong offset!");

}

