#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_List_Item_BtnTxt

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_List_Item_BtnTxt.Shop_List_Item_BtnTxt_C
// 0x0050 (0x0418 - 0x03C8)
class UShop_List_Item_BtnTxt_C final : public UEndUserWidget
{
public:
	class UMainMenu_Icon_Item_C*                  Icon_Item;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Now_C*                   Icon_Now;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Sale;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_00;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateria_List_C*                        Materia_List;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_MateriaLv;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Name;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Value_1;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Value_2;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Value_3;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_List_Item_BtnTxt_C">();
	}
	static class UShop_List_Item_BtnTxt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_List_Item_BtnTxt_C>();
	}
};
static_assert(alignof(UShop_List_Item_BtnTxt_C) == 0x000008, "Wrong alignment on UShop_List_Item_BtnTxt_C");
static_assert(sizeof(UShop_List_Item_BtnTxt_C) == 0x000418, "Wrong size on UShop_List_Item_BtnTxt_C");
static_assert(offsetof(UShop_List_Item_BtnTxt_C, Icon_Item) == 0x0003C8, "Member 'UShop_List_Item_BtnTxt_C::Icon_Item' has a wrong offset!");
static_assert(offsetof(UShop_List_Item_BtnTxt_C, Icon_Now) == 0x0003D0, "Member 'UShop_List_Item_BtnTxt_C::Icon_Now' has a wrong offset!");
static_assert(offsetof(UShop_List_Item_BtnTxt_C, Icon_Sale) == 0x0003D8, "Member 'UShop_List_Item_BtnTxt_C::Icon_Sale' has a wrong offset!");
static_assert(offsetof(UShop_List_Item_BtnTxt_C, Img_Base_00) == 0x0003E0, "Member 'UShop_List_Item_BtnTxt_C::Img_Base_00' has a wrong offset!");
static_assert(offsetof(UShop_List_Item_BtnTxt_C, Materia_List) == 0x0003E8, "Member 'UShop_List_Item_BtnTxt_C::Materia_List' has a wrong offset!");
static_assert(offsetof(UShop_List_Item_BtnTxt_C, Txt_MateriaLv) == 0x0003F0, "Member 'UShop_List_Item_BtnTxt_C::Txt_MateriaLv' has a wrong offset!");
static_assert(offsetof(UShop_List_Item_BtnTxt_C, Txt_Name) == 0x0003F8, "Member 'UShop_List_Item_BtnTxt_C::Txt_Name' has a wrong offset!");
static_assert(offsetof(UShop_List_Item_BtnTxt_C, Txt_Value_1) == 0x000400, "Member 'UShop_List_Item_BtnTxt_C::Txt_Value_1' has a wrong offset!");
static_assert(offsetof(UShop_List_Item_BtnTxt_C, Txt_Value_2) == 0x000408, "Member 'UShop_List_Item_BtnTxt_C::Txt_Value_2' has a wrong offset!");
static_assert(offsetof(UShop_List_Item_BtnTxt_C, Txt_Value_3) == 0x000410, "Member 'UShop_List_Item_BtnTxt_C::Txt_Value_3' has a wrong offset!");

}

