#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_Menu

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_Menu.Shop_Menu_C
// 0x0180 (0x0548 - 0x03C8)
class UShop_Menu_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       GoldSaucer;                                        // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Moogle;                                            // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Chocobo;                                           // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Chadley;                                           // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       List_In;                                           // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChadleyTopAreaReport_Shift;                        // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChadleyTopChadleyItem_Shift;                       // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChadleyTopVRBattle_Shift;                          // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CategoryWeaponReset_Shift;                         // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CategoryVRBattle_Shift;                            // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChadleyTopItem_Shift;                              // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChadleyTopCategory_Shift;                          // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CategoryItem_Shift;                                // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TopItem_Shift;                                     // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TopCategory_Shift;                                 // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_3;                                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_DistributionLevel;                              // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_Line1;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_Line2;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_Line3;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_Line4;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_InfoBG;                                  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Category_Bg;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Icon_ShopCategory;                                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_2;                                        // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2_Img;                                         // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg_C*                             Shop_Bg;                                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg2_C*                            Shop_Bg2;                                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Shop_Bg3;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shop_Bg_Top;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_List_00_C*                        Shop_List_00;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAreaReport_List_C*                     Shop_List_AreaReport;                              // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_List_Category_C*                  Shop_List_Category;                                // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_List_ChadleyItem_C*               Shop_List_ChadleyItem;                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_List_ChadleyTop_C*                Shop_List_ChadleyTop;                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_List_Item_C*                      Shop_List_Item;                                    // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_List_Top_C*                       Shop_List_Top;                                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_List_VRBattle_C*                  Shop_List_VRBattle;                                // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_List_WeaponReset_C*               Shop_List_WeaponReset;                             // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_Bg_C*                  System_Bg;                                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Tab_1;                                             // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_Menu_C">();
	}
	static class UShop_Menu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_Menu_C>();
	}
};
static_assert(alignof(UShop_Menu_C) == 0x000008, "Wrong alignment on UShop_Menu_C");
static_assert(sizeof(UShop_Menu_C) == 0x000548, "Wrong size on UShop_Menu_C");
static_assert(offsetof(UShop_Menu_C, GoldSaucer) == 0x0003C8, "Member 'UShop_Menu_C::GoldSaucer' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Moogle) == 0x0003D0, "Member 'UShop_Menu_C::Moogle' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Chocobo) == 0x0003D8, "Member 'UShop_Menu_C::Chocobo' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Chadley) == 0x0003E0, "Member 'UShop_Menu_C::Chadley' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Normal) == 0x0003E8, "Member 'UShop_Menu_C::Normal' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, List_In) == 0x0003F0, "Member 'UShop_Menu_C::List_In' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Menu_In) == 0x0003F8, "Member 'UShop_Menu_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, ChadleyTopAreaReport_Shift) == 0x000400, "Member 'UShop_Menu_C::ChadleyTopAreaReport_Shift' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, ChadleyTopChadleyItem_Shift) == 0x000408, "Member 'UShop_Menu_C::ChadleyTopChadleyItem_Shift' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, ChadleyTopVRBattle_Shift) == 0x000410, "Member 'UShop_Menu_C::ChadleyTopVRBattle_Shift' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, CategoryWeaponReset_Shift) == 0x000418, "Member 'UShop_Menu_C::CategoryWeaponReset_Shift' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, CategoryVRBattle_Shift) == 0x000420, "Member 'UShop_Menu_C::CategoryVRBattle_Shift' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, ChadleyTopItem_Shift) == 0x000428, "Member 'UShop_Menu_C::ChadleyTopItem_Shift' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, ChadleyTopCategory_Shift) == 0x000430, "Member 'UShop_Menu_C::ChadleyTopCategory_Shift' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, CategoryItem_Shift) == 0x000438, "Member 'UShop_Menu_C::CategoryItem_Shift' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, TopItem_Shift) == 0x000440, "Member 'UShop_Menu_C::TopItem_Shift' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, TopCategory_Shift) == 0x000448, "Member 'UShop_Menu_C::TopCategory_Shift' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Base) == 0x000450, "Member 'UShop_Menu_C::Base' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Base1) == 0x000458, "Member 'UShop_Menu_C::Base1' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Base2) == 0x000460, "Member 'UShop_Menu_C::Base2' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Bg) == 0x000468, "Member 'UShop_Menu_C::Bg' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Bg_3) == 0x000470, "Member 'UShop_Menu_C::Bg_3' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Bg_DistributionLevel) == 0x000478, "Member 'UShop_Menu_C::Bg_DistributionLevel' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Bg_Line1) == 0x000480, "Member 'UShop_Menu_C::Bg_Line1' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Bg_Line2) == 0x000488, "Member 'UShop_Menu_C::Bg_Line2' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Bg_Line3) == 0x000490, "Member 'UShop_Menu_C::Bg_Line3' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Bg_Line4) == 0x000498, "Member 'UShop_Menu_C::Bg_Line4' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Billboard_InfoBG) == 0x0004A0, "Member 'UShop_Menu_C::Billboard_InfoBG' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Category_Bg) == 0x0004A8, "Member 'UShop_Menu_C::Category_Bg' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, EndImage_2) == 0x0004B0, "Member 'UShop_Menu_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Icon_ShopCategory) == 0x0004B8, "Member 'UShop_Menu_C::Icon_ShopCategory' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Img_Base_2) == 0x0004C0, "Member 'UShop_Menu_C::Img_Base_2' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Line2_Img) == 0x0004C8, "Member 'UShop_Menu_C::Line2_Img' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Shop_Bg) == 0x0004D0, "Member 'UShop_Menu_C::Shop_Bg' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Shop_Bg2) == 0x0004D8, "Member 'UShop_Menu_C::Shop_Bg2' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Shop_Bg3) == 0x0004E0, "Member 'UShop_Menu_C::Shop_Bg3' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Shop_Bg_Top) == 0x0004E8, "Member 'UShop_Menu_C::Shop_Bg_Top' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Shop_List_00) == 0x0004F0, "Member 'UShop_Menu_C::Shop_List_00' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Shop_List_AreaReport) == 0x0004F8, "Member 'UShop_Menu_C::Shop_List_AreaReport' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Shop_List_Category) == 0x000500, "Member 'UShop_Menu_C::Shop_List_Category' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Shop_List_ChadleyItem) == 0x000508, "Member 'UShop_Menu_C::Shop_List_ChadleyItem' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Shop_List_ChadleyTop) == 0x000510, "Member 'UShop_Menu_C::Shop_List_ChadleyTop' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Shop_List_Item) == 0x000518, "Member 'UShop_Menu_C::Shop_List_Item' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Shop_List_Top) == 0x000520, "Member 'UShop_Menu_C::Shop_List_Top' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Shop_List_VRBattle) == 0x000528, "Member 'UShop_Menu_C::Shop_List_VRBattle' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Shop_List_WeaponReset) == 0x000530, "Member 'UShop_Menu_C::Shop_List_WeaponReset' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, System_Bg) == 0x000538, "Member 'UShop_Menu_C::System_Bg' has a wrong offset!");
static_assert(offsetof(UShop_Menu_C, Tab_1) == 0x000540, "Member 'UShop_Menu_C::Tab_1' has a wrong offset!");

}

