#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_WishList

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_WishList.Shop_WishList_C
// 0x0018 (0x03E0 - 0x03C8)
class UShop_WishList_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       In;                                                // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_00;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_WishList;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_WishList_C">();
	}
	static class UShop_WishList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_WishList_C>();
	}
};
static_assert(alignof(UShop_WishList_C) == 0x000008, "Wrong alignment on UShop_WishList_C");
static_assert(sizeof(UShop_WishList_C) == 0x0003E0, "Wrong size on UShop_WishList_C");
static_assert(offsetof(UShop_WishList_C, In) == 0x0003C8, "Member 'UShop_WishList_C::In' has a wrong offset!");
static_assert(offsetof(UShop_WishList_C, Base_00) == 0x0003D0, "Member 'UShop_WishList_C::Base_00' has a wrong offset!");
static_assert(offsetof(UShop_WishList_C, Icon_WishList) == 0x0003D8, "Member 'UShop_WishList_C::Icon_WishList' has a wrong offset!");

}

