#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_ItemInfo

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_ItemInfo.Shop_ItemInfo_C
// 0x0138 (0x0878 - 0x0740)
class UShop_ItemInfo_C final : public UEndShopItemInfoWindow
{
public:
	class UWidgetAnimation*                       ItemInfo_In;                                       // 0x0740(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WeaponResetLayout;                                 // 0x0748(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RecordLayout;                                      // 0x0750(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       KeyItemLayout;                                     // 0x0758(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ItemLayout;                                        // 0x0760(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MateriaLayout;                                     // 0x0768(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AccessoryLayout;                                   // 0x0770(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ArmorLayout;                                       // 0x0778(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WeaponLayout;                                      // 0x0780(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WeaponReset;                                       // 0x0788(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base1_4;                                           // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_InfoBG;                                  // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Item;                                    // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Materia;                                 // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Tips;                                    // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_WeaponUpgrade_CircleGauge3_C* CircleGauge;                                       // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_List_Compare_C*                   Compare_List;                                      // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_CraftAreaInfo_C*                  CraftAreaInfo;                                     // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipInfoDetail_Ability_C*             Detail_Ability;                                    // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipInfoDetail_Accessory_C*           Detail_Accessory;                                  // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipInfoDetail_Materia_C*             Detail_Materia;                                    // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_79;                                       // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_05_C*              EquipCell_Top;                                     // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipInfo_C*                           EquipInfo;                                         // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_InfoWindowBg_C*               InfoWindowBg;                                      // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LightBg00;                                         // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point2_1;                                          // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Tips;                                              // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TipsBase;                                          // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Attribute;                                     // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_AttributeTitle;                                // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Info;                                          // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Status;                                        // 0x0858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_StatusTitle;                                   // 0x0860(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0868(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title3;                                        // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_ItemInfo_C">();
	}
	static class UShop_ItemInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_ItemInfo_C>();
	}
};
static_assert(alignof(UShop_ItemInfo_C) == 0x000008, "Wrong alignment on UShop_ItemInfo_C");
static_assert(sizeof(UShop_ItemInfo_C) == 0x000878, "Wrong size on UShop_ItemInfo_C");
static_assert(offsetof(UShop_ItemInfo_C, ItemInfo_In) == 0x000740, "Member 'UShop_ItemInfo_C::ItemInfo_In' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, WeaponResetLayout) == 0x000748, "Member 'UShop_ItemInfo_C::WeaponResetLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, RecordLayout) == 0x000750, "Member 'UShop_ItemInfo_C::RecordLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, KeyItemLayout) == 0x000758, "Member 'UShop_ItemInfo_C::KeyItemLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, ItemLayout) == 0x000760, "Member 'UShop_ItemInfo_C::ItemLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, MateriaLayout) == 0x000768, "Member 'UShop_ItemInfo_C::MateriaLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, AccessoryLayout) == 0x000770, "Member 'UShop_ItemInfo_C::AccessoryLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, ArmorLayout) == 0x000778, "Member 'UShop_ItemInfo_C::ArmorLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, WeaponLayout) == 0x000780, "Member 'UShop_ItemInfo_C::WeaponLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, WeaponReset) == 0x000788, "Member 'UShop_ItemInfo_C::WeaponReset' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Base1_4) == 0x000790, "Member 'UShop_ItemInfo_C::Base1_4' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Billboard_InfoBG) == 0x000798, "Member 'UShop_ItemInfo_C::Billboard_InfoBG' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Billboard_Item) == 0x0007A0, "Member 'UShop_ItemInfo_C::Billboard_Item' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Billboard_Materia) == 0x0007A8, "Member 'UShop_ItemInfo_C::Billboard_Materia' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Billboard_Tips) == 0x0007B0, "Member 'UShop_ItemInfo_C::Billboard_Tips' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, CircleGauge) == 0x0007B8, "Member 'UShop_ItemInfo_C::CircleGauge' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Compare_List) == 0x0007C0, "Member 'UShop_ItemInfo_C::Compare_List' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, CraftAreaInfo) == 0x0007C8, "Member 'UShop_ItemInfo_C::CraftAreaInfo' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Detail_Ability) == 0x0007D0, "Member 'UShop_ItemInfo_C::Detail_Ability' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Detail_Accessory) == 0x0007D8, "Member 'UShop_ItemInfo_C::Detail_Accessory' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Detail_Materia) == 0x0007E0, "Member 'UShop_ItemInfo_C::Detail_Materia' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, EndImage_2) == 0x0007E8, "Member 'UShop_ItemInfo_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, EndImage_79) == 0x0007F0, "Member 'UShop_ItemInfo_C::EndImage_79' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, EquipCell_Top) == 0x0007F8, "Member 'UShop_ItemInfo_C::EquipCell_Top' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, EquipInfo) == 0x000800, "Member 'UShop_ItemInfo_C::EquipInfo' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, InfoWindowBg) == 0x000808, "Member 'UShop_ItemInfo_C::InfoWindowBg' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Light) == 0x000810, "Member 'UShop_ItemInfo_C::Light' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, LightBg00) == 0x000818, "Member 'UShop_ItemInfo_C::LightBg00' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Line) == 0x000820, "Member 'UShop_ItemInfo_C::Line' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Point2_1) == 0x000828, "Member 'UShop_ItemInfo_C::Point2_1' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Tips) == 0x000830, "Member 'UShop_ItemInfo_C::Tips' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, TipsBase) == 0x000838, "Member 'UShop_ItemInfo_C::TipsBase' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Txt_Attribute) == 0x000840, "Member 'UShop_ItemInfo_C::Txt_Attribute' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Txt_AttributeTitle) == 0x000848, "Member 'UShop_ItemInfo_C::Txt_AttributeTitle' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Txt_Info) == 0x000850, "Member 'UShop_ItemInfo_C::Txt_Info' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Txt_Status) == 0x000858, "Member 'UShop_ItemInfo_C::Txt_Status' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Txt_StatusTitle) == 0x000860, "Member 'UShop_ItemInfo_C::Txt_StatusTitle' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Txt_Title) == 0x000868, "Member 'UShop_ItemInfo_C::Txt_Title' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Txt_Title3) == 0x000870, "Member 'UShop_ItemInfo_C::Txt_Title3' has a wrong offset!");

}

