#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_List_Compare_Cell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_List_Compare_Cell.Shop_List_Compare_Cell_C
// 0x0060 (0x0428 - 0x03C8)
class UShop_List_Compare_Cell_C final : public UEndUserWidget
{
public:
	class UEndImage*                              AwayIcon;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BLACK;                                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Arrow_Compare_C*                  Icon_Arrow_1;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Arrow_Compare_C*                  Icon_Arrow_2;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Arrow_Compare_C*                  Icon_Arrow_3;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Arrow_Compare_C*                  Icon_Arrow_4;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_1;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_2;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_3;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_4;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Player;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateria_ListNew_C*                     Materia_ListNew;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_List_Compare_Cell_C">();
	}
	static class UShop_List_Compare_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_List_Compare_Cell_C>();
	}
};
static_assert(alignof(UShop_List_Compare_Cell_C) == 0x000008, "Wrong alignment on UShop_List_Compare_Cell_C");
static_assert(sizeof(UShop_List_Compare_Cell_C) == 0x000428, "Wrong size on UShop_List_Compare_Cell_C");
static_assert(offsetof(UShop_List_Compare_Cell_C, AwayIcon) == 0x0003C8, "Member 'UShop_List_Compare_Cell_C::AwayIcon' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_Cell_C, BLACK) == 0x0003D0, "Member 'UShop_List_Compare_Cell_C::BLACK' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_Cell_C, Icon_Arrow_1) == 0x0003D8, "Member 'UShop_List_Compare_Cell_C::Icon_Arrow_1' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_Cell_C, Icon_Arrow_2) == 0x0003E0, "Member 'UShop_List_Compare_Cell_C::Icon_Arrow_2' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_Cell_C, Icon_Arrow_3) == 0x0003E8, "Member 'UShop_List_Compare_Cell_C::Icon_Arrow_3' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_Cell_C, Icon_Arrow_4) == 0x0003F0, "Member 'UShop_List_Compare_Cell_C::Icon_Arrow_4' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_Cell_C, Icon_Status_1) == 0x0003F8, "Member 'UShop_List_Compare_Cell_C::Icon_Status_1' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_Cell_C, Icon_Status_2) == 0x000400, "Member 'UShop_List_Compare_Cell_C::Icon_Status_2' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_Cell_C, Icon_Status_3) == 0x000408, "Member 'UShop_List_Compare_Cell_C::Icon_Status_3' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_Cell_C, Icon_Status_4) == 0x000410, "Member 'UShop_List_Compare_Cell_C::Icon_Status_4' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_Cell_C, Ims_Player) == 0x000418, "Member 'UShop_List_Compare_Cell_C::Ims_Player' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_Cell_C, Materia_ListNew) == 0x000420, "Member 'UShop_List_Compare_Cell_C::Materia_ListNew' has a wrong offset!");

}

