#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_List_00

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_List_00.Shop_List_00_C
// 0x0100 (0x05B0 - 0x04B0)
class UShop_List_00_C final : public UEndShopListItemPane
{
public:
	class UWidgetAnimation*                       List_Switching;                                    // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Arrow_L;                                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_L_1;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_R;                                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_R_1;                                         // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Accessory;                                     // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_All;                                           // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Card;                                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Craft;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Item;                                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Materia;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Protector;                                     // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Weapon;                                        // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_70;                                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Accessory;                                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Card;                                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Check;                                        // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Craft;                                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Item;                                         // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Materia;                                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Protector;                                    // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Sale;                                         // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Weapon;                                       // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_00;                                       // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Category_Cursor_C*                Shop_Category_Cursor;                              // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Select_Number_C*                  Shop_Select_Number;                                // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_WishList_C*                       Shop_WishList;                                     // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         TiledListBG;                                       // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_InfoWindowBg1_C*                  WindowBg;                                          // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_List_00_C">();
	}
	static class UShop_List_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_List_00_C>();
	}
};
static_assert(alignof(UShop_List_00_C) == 0x000008, "Wrong alignment on UShop_List_00_C");
static_assert(sizeof(UShop_List_00_C) == 0x0005B0, "Wrong size on UShop_List_00_C");
static_assert(offsetof(UShop_List_00_C, List_Switching) == 0x0004B0, "Member 'UShop_List_00_C::List_Switching' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Arrow_L) == 0x0004B8, "Member 'UShop_List_00_C::Arrow_L' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Arrow_L_1) == 0x0004C0, "Member 'UShop_List_00_C::Arrow_L_1' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Arrow_R) == 0x0004C8, "Member 'UShop_List_00_C::Arrow_R' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Arrow_R_1) == 0x0004D0, "Member 'UShop_List_00_C::Arrow_R_1' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Btn_Accessory) == 0x0004D8, "Member 'UShop_List_00_C::Btn_Accessory' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Btn_All) == 0x0004E0, "Member 'UShop_List_00_C::Btn_All' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Btn_Card) == 0x0004E8, "Member 'UShop_List_00_C::Btn_Card' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Btn_Craft) == 0x0004F0, "Member 'UShop_List_00_C::Btn_Craft' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Btn_Item) == 0x0004F8, "Member 'UShop_List_00_C::Btn_Item' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Btn_Materia) == 0x000500, "Member 'UShop_List_00_C::Btn_Materia' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Btn_Protector) == 0x000508, "Member 'UShop_List_00_C::Btn_Protector' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Btn_Weapon) == 0x000510, "Member 'UShop_List_00_C::Btn_Weapon' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, EndImage) == 0x000518, "Member 'UShop_List_00_C::EndImage' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, EndImage_1) == 0x000520, "Member 'UShop_List_00_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, EndImage_2) == 0x000528, "Member 'UShop_List_00_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, EndImage_70) == 0x000530, "Member 'UShop_List_00_C::EndImage_70' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Icon_Accessory) == 0x000538, "Member 'UShop_List_00_C::Icon_Accessory' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Icon_Card) == 0x000540, "Member 'UShop_List_00_C::Icon_Card' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Icon_Check) == 0x000548, "Member 'UShop_List_00_C::Icon_Check' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Icon_Craft) == 0x000550, "Member 'UShop_List_00_C::Icon_Craft' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Icon_Item) == 0x000558, "Member 'UShop_List_00_C::Icon_Item' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Icon_Materia) == 0x000560, "Member 'UShop_List_00_C::Icon_Materia' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Icon_Protector) == 0x000568, "Member 'UShop_List_00_C::Icon_Protector' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Icon_Sale) == 0x000570, "Member 'UShop_List_00_C::Icon_Sale' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Icon_Weapon) == 0x000578, "Member 'UShop_List_00_C::Icon_Weapon' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Img_Base_00) == 0x000580, "Member 'UShop_List_00_C::Img_Base_00' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Shop_Category_Cursor) == 0x000588, "Member 'UShop_List_00_C::Shop_Category_Cursor' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Shop_Select_Number) == 0x000590, "Member 'UShop_List_00_C::Shop_Select_Number' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, Shop_WishList) == 0x000598, "Member 'UShop_List_00_C::Shop_WishList' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, TiledListBG) == 0x0005A0, "Member 'UShop_List_00_C::TiledListBG' has a wrong offset!");
static_assert(offsetof(UShop_List_00_C, WindowBg) == 0x0005A8, "Member 'UShop_List_00_C::WindowBg' has a wrong offset!");

}

