#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_List_ChadleyItem

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_List_ChadleyItem.Shop_List_ChadleyItem_C
// 0x00B0 (0x0560 - 0x04B0)
class UShop_List_ChadleyItem_C final : public UEndShopListItemPane
{
public:
	class UWidgetAnimation*                       List_Switching;                                    // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Arrow_L;                                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_L_1;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_R;                                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_R_1;                                         // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Accessory;                                     // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_All;                                           // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Item;                                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Materia;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Protector;                                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Accessory;                                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_CP;                                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Currency_C*                       Icon_Currency_new;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Item;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Materia;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Protector;                                    // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_00;                                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_TotalBase_1;                                   // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Select_Number_C*                  Shop_Select_Number;                                // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Tab_Base_1;                                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         TiledListBG;                                       // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_List_ChadleyItem_C">();
	}
	static class UShop_List_ChadleyItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_List_ChadleyItem_C>();
	}
};
static_assert(alignof(UShop_List_ChadleyItem_C) == 0x000008, "Wrong alignment on UShop_List_ChadleyItem_C");
static_assert(sizeof(UShop_List_ChadleyItem_C) == 0x000560, "Wrong size on UShop_List_ChadleyItem_C");
static_assert(offsetof(UShop_List_ChadleyItem_C, List_Switching) == 0x0004B0, "Member 'UShop_List_ChadleyItem_C::List_Switching' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Arrow_L) == 0x0004B8, "Member 'UShop_List_ChadleyItem_C::Arrow_L' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Arrow_L_1) == 0x0004C0, "Member 'UShop_List_ChadleyItem_C::Arrow_L_1' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Arrow_R) == 0x0004C8, "Member 'UShop_List_ChadleyItem_C::Arrow_R' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Arrow_R_1) == 0x0004D0, "Member 'UShop_List_ChadleyItem_C::Arrow_R_1' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Btn_Accessory) == 0x0004D8, "Member 'UShop_List_ChadleyItem_C::Btn_Accessory' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Btn_All) == 0x0004E0, "Member 'UShop_List_ChadleyItem_C::Btn_All' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Btn_Item) == 0x0004E8, "Member 'UShop_List_ChadleyItem_C::Btn_Item' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Btn_Materia) == 0x0004F0, "Member 'UShop_List_ChadleyItem_C::Btn_Materia' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Btn_Protector) == 0x0004F8, "Member 'UShop_List_ChadleyItem_C::Btn_Protector' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Icon_Accessory) == 0x000500, "Member 'UShop_List_ChadleyItem_C::Icon_Accessory' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Icon_CP) == 0x000508, "Member 'UShop_List_ChadleyItem_C::Icon_CP' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Icon_Currency_new) == 0x000510, "Member 'UShop_List_ChadleyItem_C::Icon_Currency_new' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Icon_Item) == 0x000518, "Member 'UShop_List_ChadleyItem_C::Icon_Item' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Icon_Materia) == 0x000520, "Member 'UShop_List_ChadleyItem_C::Icon_Materia' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Icon_Protector) == 0x000528, "Member 'UShop_List_ChadleyItem_C::Icon_Protector' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Img_Base_00) == 0x000530, "Member 'UShop_List_ChadleyItem_C::Img_Base_00' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Img_TotalBase_1) == 0x000538, "Member 'UShop_List_ChadleyItem_C::Img_TotalBase_1' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Line) == 0x000540, "Member 'UShop_List_ChadleyItem_C::Line' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Shop_Select_Number) == 0x000548, "Member 'UShop_List_ChadleyItem_C::Shop_Select_Number' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, Tab_Base_1) == 0x000550, "Member 'UShop_List_ChadleyItem_C::Tab_Base_1' has a wrong offset!");
static_assert(offsetof(UShop_List_ChadleyItem_C, TiledListBG) == 0x000558, "Member 'UShop_List_ChadleyItem_C::TiledListBG' has a wrong offset!");

}

