#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_List_Compare

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_List_Compare.Shop_List_Compare_C
// 0x0050 (0x0418 - 0x03C8)
class UShop_List_Compare_C final : public UEndUserWidget
{
public:
	class UEndImageSet*                           Icon_Status;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_1;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_2;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_3;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_4;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Status_5;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Status_6;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Status_7;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_InfoWindowBg_C*               InfoWindowBg;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TitleBase;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_List_Compare_C">();
	}
	static class UShop_List_Compare_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_List_Compare_C>();
	}
};
static_assert(alignof(UShop_List_Compare_C) == 0x000008, "Wrong alignment on UShop_List_Compare_C");
static_assert(sizeof(UShop_List_Compare_C) == 0x000418, "Wrong size on UShop_List_Compare_C");
static_assert(offsetof(UShop_List_Compare_C, Icon_Status) == 0x0003C8, "Member 'UShop_List_Compare_C::Icon_Status' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_C, Icon_Status_1) == 0x0003D0, "Member 'UShop_List_Compare_C::Icon_Status_1' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_C, Icon_Status_2) == 0x0003D8, "Member 'UShop_List_Compare_C::Icon_Status_2' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_C, Icon_Status_3) == 0x0003E0, "Member 'UShop_List_Compare_C::Icon_Status_3' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_C, Icon_Status_4) == 0x0003E8, "Member 'UShop_List_Compare_C::Icon_Status_4' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_C, Icon_Status_5) == 0x0003F0, "Member 'UShop_List_Compare_C::Icon_Status_5' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_C, Icon_Status_6) == 0x0003F8, "Member 'UShop_List_Compare_C::Icon_Status_6' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_C, Icon_Status_7) == 0x000400, "Member 'UShop_List_Compare_C::Icon_Status_7' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_C, InfoWindowBg) == 0x000408, "Member 'UShop_List_Compare_C::InfoWindowBg' has a wrong offset!");
static_assert(offsetof(UShop_List_Compare_C, TitleBase) == 0x000410, "Member 'UShop_List_Compare_C::TitleBase' has a wrong offset!");

}

