#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_List_Top_Cell_Light1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_List_Top_Cell_Light1.Shop_List_Top_Cell_Light1_C
// 0x0030 (0x03F8 - 0x03C8)
class UShop_List_Top_Cell_Light1_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Light;                                             // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light1;                                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light2;                                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Shop_List_Top_Cell_Light1(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_List_Top_Cell_Light1_C">();
	}
	static class UShop_List_Top_Cell_Light1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_List_Top_Cell_Light1_C>();
	}
};
static_assert(alignof(UShop_List_Top_Cell_Light1_C) == 0x000008, "Wrong alignment on UShop_List_Top_Cell_Light1_C");
static_assert(sizeof(UShop_List_Top_Cell_Light1_C) == 0x0003F8, "Wrong size on UShop_List_Top_Cell_Light1_C");
static_assert(offsetof(UShop_List_Top_Cell_Light1_C, UberGraphFrame) == 0x0003C8, "Member 'UShop_List_Top_Cell_Light1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_Light1_C, Light) == 0x0003D0, "Member 'UShop_List_Top_Cell_Light1_C::Light' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_Light1_C, EndImage) == 0x0003D8, "Member 'UShop_List_Top_Cell_Light1_C::EndImage' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_Light1_C, Img_BtnLight) == 0x0003E0, "Member 'UShop_List_Top_Cell_Light1_C::Img_BtnLight' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_Light1_C, Light1) == 0x0003E8, "Member 'UShop_List_Top_Cell_Light1_C::Light1' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_Light1_C, Light2) == 0x0003F0, "Member 'UShop_List_Top_Cell_Light1_C::Light2' has a wrong offset!");

}

