#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_List_Top_Cell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_List_Top_Cell.Shop_List_Top_Cell_C
// 0x0080 (0x0448 - 0x03C8)
class UShop_List_Top_Cell_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       BtnNormalHover;                                    // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_Currency;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Frame_Currency;                               // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_ItemCategory;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_Select1;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_Select2;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_Select2_1;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_UnSelect;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_List;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Flame_UnSelect;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Currency_C*                       Icon_Currency;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Now_C*                   Icon_Now;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LightDotL;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_BtnLight_C*                       Shop_BtnLight;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_List_Top_Cell_C">();
	}
	static class UShop_List_Top_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_List_Top_Cell_C>();
	}
};
static_assert(alignof(UShop_List_Top_Cell_C) == 0x000008, "Wrong alignment on UShop_List_Top_Cell_C");
static_assert(sizeof(UShop_List_Top_Cell_C) == 0x000448, "Wrong size on UShop_List_Top_Cell_C");
static_assert(offsetof(UShop_List_Top_Cell_C, BtnNormalHover) == 0x0003C8, "Member 'UShop_List_Top_Cell_C::BtnNormalHover' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_C, Base_Currency) == 0x0003D0, "Member 'UShop_List_Top_Cell_C::Base_Currency' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_C, Base_Frame_Currency) == 0x0003D8, "Member 'UShop_List_Top_Cell_C::Base_Frame_Currency' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_C, Base_ItemCategory) == 0x0003E0, "Member 'UShop_List_Top_Cell_C::Base_ItemCategory' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_C, Bg_Select1) == 0x0003E8, "Member 'UShop_List_Top_Cell_C::Bg_Select1' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_C, Bg_Select2) == 0x0003F0, "Member 'UShop_List_Top_Cell_C::Bg_Select2' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_C, Bg_Select2_1) == 0x0003F8, "Member 'UShop_List_Top_Cell_C::Bg_Select2_1' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_C, Bg_UnSelect) == 0x000400, "Member 'UShop_List_Top_Cell_C::Bg_UnSelect' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_C, Btn_List) == 0x000408, "Member 'UShop_List_Top_Cell_C::Btn_List' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_C, EndImage_1) == 0x000410, "Member 'UShop_List_Top_Cell_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_C, Flame_UnSelect) == 0x000418, "Member 'UShop_List_Top_Cell_C::Flame_UnSelect' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_C, Icon_Currency) == 0x000420, "Member 'UShop_List_Top_Cell_C::Icon_Currency' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_C, Icon_Now) == 0x000428, "Member 'UShop_List_Top_Cell_C::Icon_Now' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_C, LightDotL) == 0x000430, "Member 'UShop_List_Top_Cell_C::LightDotL' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_C, ListPoint) == 0x000438, "Member 'UShop_List_Top_Cell_C::ListPoint' has a wrong offset!");
static_assert(offsetof(UShop_List_Top_Cell_C, Shop_BtnLight) == 0x000440, "Member 'UShop_List_Top_Cell_C::Shop_BtnLight' has a wrong offset!");

}

