#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_Bg

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_Bg.Shop_Bg_C
// 0x0060 (0x0428 - 0x03C8)
class UShop_Bg_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       In;                                                // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Left1;                                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left2;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left3;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left4;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Right1;                                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Right2;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Right3;                                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Bg1;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Bg1_1;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Bg2;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Bg2_1;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_Bg_C">();
	}
	static class UShop_Bg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_Bg_C>();
	}
};
static_assert(alignof(UShop_Bg_C) == 0x000008, "Wrong alignment on UShop_Bg_C");
static_assert(sizeof(UShop_Bg_C) == 0x000428, "Wrong size on UShop_Bg_C");
static_assert(offsetof(UShop_Bg_C, In) == 0x0003C8, "Member 'UShop_Bg_C::In' has a wrong offset!");
static_assert(offsetof(UShop_Bg_C, Left1) == 0x0003D0, "Member 'UShop_Bg_C::Left1' has a wrong offset!");
static_assert(offsetof(UShop_Bg_C, Left2) == 0x0003D8, "Member 'UShop_Bg_C::Left2' has a wrong offset!");
static_assert(offsetof(UShop_Bg_C, Left3) == 0x0003E0, "Member 'UShop_Bg_C::Left3' has a wrong offset!");
static_assert(offsetof(UShop_Bg_C, Left4) == 0x0003E8, "Member 'UShop_Bg_C::Left4' has a wrong offset!");
static_assert(offsetof(UShop_Bg_C, Right1) == 0x0003F0, "Member 'UShop_Bg_C::Right1' has a wrong offset!");
static_assert(offsetof(UShop_Bg_C, Right2) == 0x0003F8, "Member 'UShop_Bg_C::Right2' has a wrong offset!");
static_assert(offsetof(UShop_Bg_C, Right3) == 0x000400, "Member 'UShop_Bg_C::Right3' has a wrong offset!");
static_assert(offsetof(UShop_Bg_C, Title_Bg1) == 0x000408, "Member 'UShop_Bg_C::Title_Bg1' has a wrong offset!");
static_assert(offsetof(UShop_Bg_C, Title_Bg1_1) == 0x000410, "Member 'UShop_Bg_C::Title_Bg1_1' has a wrong offset!");
static_assert(offsetof(UShop_Bg_C, Title_Bg2) == 0x000418, "Member 'UShop_Bg_C::Title_Bg2' has a wrong offset!");
static_assert(offsetof(UShop_Bg_C, Title_Bg2_1) == 0x000420, "Member 'UShop_Bg_C::Title_Bg2_1' has a wrong offset!");

}

