#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_CraftAreaInfo

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_CraftAreaInfo.Shop_CraftAreaInfo_C
// 0x0020 (0x0408 - 0x03E8)
class UShop_CraftAreaInfo_C final : public UEndCraftAreaInfoWindow
{
public:
	class UEndImage*                              EndImage_58;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_79;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_InfoWindowBg_C*               InfoWindowBg;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_1;                                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_CraftAreaInfo_C">();
	}
	static class UShop_CraftAreaInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_CraftAreaInfo_C>();
	}
};
static_assert(alignof(UShop_CraftAreaInfo_C) == 0x000008, "Wrong alignment on UShop_CraftAreaInfo_C");
static_assert(sizeof(UShop_CraftAreaInfo_C) == 0x000408, "Wrong size on UShop_CraftAreaInfo_C");
static_assert(offsetof(UShop_CraftAreaInfo_C, EndImage_58) == 0x0003E8, "Member 'UShop_CraftAreaInfo_C::EndImage_58' has a wrong offset!");
static_assert(offsetof(UShop_CraftAreaInfo_C, EndImage_79) == 0x0003F0, "Member 'UShop_CraftAreaInfo_C::EndImage_79' has a wrong offset!");
static_assert(offsetof(UShop_CraftAreaInfo_C, InfoWindowBg) == 0x0003F8, "Member 'UShop_CraftAreaInfo_C::InfoWindowBg' has a wrong offset!");
static_assert(offsetof(UShop_CraftAreaInfo_C, Line_1) == 0x000400, "Member 'UShop_CraftAreaInfo_C::Line_1' has a wrong offset!");

}

