#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_BtnLight2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_BtnLight2.Shop_BtnLight2_C
// 0x0030 (0x03F8 - 0x03C8)
class UShop_BtnLight2_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Bg_Select2_2;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursol_Eff;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_Left_1;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_Left_eff_1;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Shop_BtnLight2(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_BtnLight2_C">();
	}
	static class UShop_BtnLight2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_BtnLight2_C>();
	}
};
static_assert(alignof(UShop_BtnLight2_C) == 0x000008, "Wrong alignment on UShop_BtnLight2_C");
static_assert(sizeof(UShop_BtnLight2_C) == 0x0003F8, "Wrong size on UShop_BtnLight2_C");
static_assert(offsetof(UShop_BtnLight2_C, UberGraphFrame) == 0x0003C8, "Member 'UShop_BtnLight2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShop_BtnLight2_C, Loop) == 0x0003D0, "Member 'UShop_BtnLight2_C::Loop' has a wrong offset!");
static_assert(offsetof(UShop_BtnLight2_C, Bg_Select2_2) == 0x0003D8, "Member 'UShop_BtnLight2_C::Bg_Select2_2' has a wrong offset!");
static_assert(offsetof(UShop_BtnLight2_C, Cursol_Eff) == 0x0003E0, "Member 'UShop_BtnLight2_C::Cursol_Eff' has a wrong offset!");
static_assert(offsetof(UShop_BtnLight2_C, Cursor_Left_1) == 0x0003E8, "Member 'UShop_BtnLight2_C::Cursor_Left_1' has a wrong offset!");
static_assert(offsetof(UShop_BtnLight2_C, Cursor_Left_eff_1) == 0x0003F0, "Member 'UShop_BtnLight2_C::Cursor_Left_eff_1' has a wrong offset!");

}

