#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_Category_Cursor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_Category_Cursor.Shop_Category_Cursor_C
// 0x0058 (0x0420 - 0x03C8)
class UShop_Category_Cursor_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop_1;                                            // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop_0;                                            // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_Blue;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_00;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_01;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_36;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_429;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Light_Horizontal_00;                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Shop_Category_Cursor(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_Category_Cursor_C">();
	}
	static class UShop_Category_Cursor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_Category_Cursor_C>();
	}
};
static_assert(alignof(UShop_Category_Cursor_C) == 0x000008, "Wrong alignment on UShop_Category_Cursor_C");
static_assert(sizeof(UShop_Category_Cursor_C) == 0x000420, "Wrong size on UShop_Category_Cursor_C");
static_assert(offsetof(UShop_Category_Cursor_C, UberGraphFrame) == 0x0003C8, "Member 'UShop_Category_Cursor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShop_Category_Cursor_C, Loop_1) == 0x0003D0, "Member 'UShop_Category_Cursor_C::Loop_1' has a wrong offset!");
static_assert(offsetof(UShop_Category_Cursor_C, Loop_0) == 0x0003D8, "Member 'UShop_Category_Cursor_C::Loop_0' has a wrong offset!");
static_assert(offsetof(UShop_Category_Cursor_C, Loop) == 0x0003E0, "Member 'UShop_Category_Cursor_C::Loop' has a wrong offset!");
static_assert(offsetof(UShop_Category_Cursor_C, Base_Blue) == 0x0003E8, "Member 'UShop_Category_Cursor_C::Base_Blue' has a wrong offset!");
static_assert(offsetof(UShop_Category_Cursor_C, Effect_00) == 0x0003F0, "Member 'UShop_Category_Cursor_C::Effect_00' has a wrong offset!");
static_assert(offsetof(UShop_Category_Cursor_C, Effect_01) == 0x0003F8, "Member 'UShop_Category_Cursor_C::Effect_01' has a wrong offset!");
static_assert(offsetof(UShop_Category_Cursor_C, EndImage) == 0x000400, "Member 'UShop_Category_Cursor_C::EndImage' has a wrong offset!");
static_assert(offsetof(UShop_Category_Cursor_C, EndImage_36) == 0x000408, "Member 'UShop_Category_Cursor_C::EndImage_36' has a wrong offset!");
static_assert(offsetof(UShop_Category_Cursor_C, EndImage_429) == 0x000410, "Member 'UShop_Category_Cursor_C::EndImage_429' has a wrong offset!");
static_assert(offsetof(UShop_Category_Cursor_C, Ims_Light_Horizontal_00) == 0x000418, "Member 'UShop_Category_Cursor_C::Ims_Light_Horizontal_00' has a wrong offset!");

}

