#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SituationTitle_Effect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SituationTitle_Effect.SituationTitle_Effect_C
// 0x0068 (0x0430 - 0x03C8)
class USituationTitle_Effect_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              LifeStream_Move;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LifeStream_Move_Add;                               // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LifeStream_Scale1;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LifeStream_Scale1_Add;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LifeStream_Scale2;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LifeStream_Scale2_Add;                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Particle_00;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Particle_01;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Particle_02;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Particle_03;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Particle_04;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SituationTitle_Effect(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SituationTitle_Effect_C">();
	}
	static class USituationTitle_Effect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USituationTitle_Effect_C>();
	}
};
static_assert(alignof(USituationTitle_Effect_C) == 0x000008, "Wrong alignment on USituationTitle_Effect_C");
static_assert(sizeof(USituationTitle_Effect_C) == 0x000430, "Wrong size on USituationTitle_Effect_C");
static_assert(offsetof(USituationTitle_Effect_C, UberGraphFrame) == 0x0003C8, "Member 'USituationTitle_Effect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USituationTitle_Effect_C, Loop) == 0x0003D0, "Member 'USituationTitle_Effect_C::Loop' has a wrong offset!");
static_assert(offsetof(USituationTitle_Effect_C, LifeStream_Move) == 0x0003D8, "Member 'USituationTitle_Effect_C::LifeStream_Move' has a wrong offset!");
static_assert(offsetof(USituationTitle_Effect_C, LifeStream_Move_Add) == 0x0003E0, "Member 'USituationTitle_Effect_C::LifeStream_Move_Add' has a wrong offset!");
static_assert(offsetof(USituationTitle_Effect_C, LifeStream_Scale1) == 0x0003E8, "Member 'USituationTitle_Effect_C::LifeStream_Scale1' has a wrong offset!");
static_assert(offsetof(USituationTitle_Effect_C, LifeStream_Scale1_Add) == 0x0003F0, "Member 'USituationTitle_Effect_C::LifeStream_Scale1_Add' has a wrong offset!");
static_assert(offsetof(USituationTitle_Effect_C, LifeStream_Scale2) == 0x0003F8, "Member 'USituationTitle_Effect_C::LifeStream_Scale2' has a wrong offset!");
static_assert(offsetof(USituationTitle_Effect_C, LifeStream_Scale2_Add) == 0x000400, "Member 'USituationTitle_Effect_C::LifeStream_Scale2_Add' has a wrong offset!");
static_assert(offsetof(USituationTitle_Effect_C, Particle_00) == 0x000408, "Member 'USituationTitle_Effect_C::Particle_00' has a wrong offset!");
static_assert(offsetof(USituationTitle_Effect_C, Particle_01) == 0x000410, "Member 'USituationTitle_Effect_C::Particle_01' has a wrong offset!");
static_assert(offsetof(USituationTitle_Effect_C, Particle_02) == 0x000418, "Member 'USituationTitle_Effect_C::Particle_02' has a wrong offset!");
static_assert(offsetof(USituationTitle_Effect_C, Particle_03) == 0x000420, "Member 'USituationTitle_Effect_C::Particle_03' has a wrong offset!");
static_assert(offsetof(USituationTitle_Effect_C, Particle_04) == 0x000428, "Member 'USituationTitle_Effect_C::Particle_04' has a wrong offset!");

}

