#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillTree_CoreAnm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SkillTree_CoreAnm.SkillTree_CoreAnm_C
// 0x0030 (0x03F8 - 0x03C8)
class USkillTree_CoreAnm_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Effect_00;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Cover;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ring2;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ring3;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SkillTree_CoreAnm(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SkillTree_CoreAnm_C">();
	}
	static class USkillTree_CoreAnm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkillTree_CoreAnm_C>();
	}
};
static_assert(alignof(USkillTree_CoreAnm_C) == 0x000008, "Wrong alignment on USkillTree_CoreAnm_C");
static_assert(sizeof(USkillTree_CoreAnm_C) == 0x0003F8, "Wrong size on USkillTree_CoreAnm_C");
static_assert(offsetof(USkillTree_CoreAnm_C, UberGraphFrame) == 0x0003C8, "Member 'USkillTree_CoreAnm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USkillTree_CoreAnm_C, Loop) == 0x0003D0, "Member 'USkillTree_CoreAnm_C::Loop' has a wrong offset!");
static_assert(offsetof(USkillTree_CoreAnm_C, Effect_00) == 0x0003D8, "Member 'USkillTree_CoreAnm_C::Effect_00' has a wrong offset!");
static_assert(offsetof(USkillTree_CoreAnm_C, Icon_Cover) == 0x0003E0, "Member 'USkillTree_CoreAnm_C::Icon_Cover' has a wrong offset!");
static_assert(offsetof(USkillTree_CoreAnm_C, Ring2) == 0x0003E8, "Member 'USkillTree_CoreAnm_C::Ring2' has a wrong offset!");
static_assert(offsetof(USkillTree_CoreAnm_C, Ring3) == 0x0003F0, "Member 'USkillTree_CoreAnm_C::Ring3' has a wrong offset!");

}

