#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SP_DyneBattleDebris_Static_04A_Physics

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SP_DyneBattleDebris_Static_04A_Physics.SP_DyneBattleDebris_Static_04A_Physics_C
// 0x01B8 (0x09A0 - 0x07E8)
class ASP_DyneBattleDebris_Static_04A_Physics_C final : public AEndEnvironmentPhysicsStaticMeshActor
{
public:
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_9_Physics;             // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_8_Physics;             // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_7_Physics;             // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_6_Physics;             // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_5_Physics;             // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_55_Physics;            // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_54_Physics;            // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_53_Physics;            // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_52_Physics;            // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_51_Physics;            // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_50_Physics;            // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_4_Physics;             // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_49_Physics;            // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_48_Physics;            // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_47_Physics;            // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_46_Physics;            // 0x0860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_45_Physics;            // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_44_Physics;            // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_43_Physics;            // 0x0878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_42_Physics;            // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_41_Physics;            // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_40_Physics;            // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_3_Physics;             // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_39_Physics;            // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_38_Physics;            // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_37_Physics;            // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_36_Physics;            // 0x08B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_35_Physics;            // 0x08C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_34_Physics;            // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_33_Physics;            // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_32_Physics;            // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_31_Physics;            // 0x08E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_30_Physics;            // 0x08E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_2_Physics;             // 0x08F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_29_Physics;            // 0x08F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_28_Physics;            // 0x0900(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_27_Physics;            // 0x0908(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_26_Physics;            // 0x0910(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_25_Physics;            // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_24_Physics;            // 0x0920(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_23_Physics;            // 0x0928(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_22_Physics;            // 0x0930(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_21_Physics;            // 0x0938(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_20_Physics;            // 0x0940(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_1_Physics;             // 0x0948(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_19_Physics;            // 0x0950(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_18_Physics;            // 0x0958(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_17_Physics;            // 0x0960(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_16_Physics;            // 0x0968(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_15_Physics;            // 0x0970(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_14_Physics;            // 0x0978(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_13_Physics;            // 0x0980(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_12_Physics;            // 0x0988(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_11_Physics;            // 0x0990(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    DyneBattleDebris_Static_04A_10_Physics;            // 0x0998(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SP_DyneBattleDebris_Static_04A_Physics_C">();
	}
	static class ASP_DyneBattleDebris_Static_04A_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASP_DyneBattleDebris_Static_04A_Physics_C>();
	}
};
static_assert(alignof(ASP_DyneBattleDebris_Static_04A_Physics_C) == 0x000008, "Wrong alignment on ASP_DyneBattleDebris_Static_04A_Physics_C");
static_assert(sizeof(ASP_DyneBattleDebris_Static_04A_Physics_C) == 0x0009A0, "Wrong size on ASP_DyneBattleDebris_Static_04A_Physics_C");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_9_Physics) == 0x0007E8, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_9_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_8_Physics) == 0x0007F0, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_8_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_7_Physics) == 0x0007F8, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_7_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_6_Physics) == 0x000800, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_6_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_5_Physics) == 0x000808, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_5_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_55_Physics) == 0x000810, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_55_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_54_Physics) == 0x000818, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_54_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_53_Physics) == 0x000820, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_53_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_52_Physics) == 0x000828, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_52_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_51_Physics) == 0x000830, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_51_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_50_Physics) == 0x000838, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_50_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_4_Physics) == 0x000840, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_4_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_49_Physics) == 0x000848, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_49_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_48_Physics) == 0x000850, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_48_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_47_Physics) == 0x000858, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_47_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_46_Physics) == 0x000860, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_46_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_45_Physics) == 0x000868, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_45_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_44_Physics) == 0x000870, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_44_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_43_Physics) == 0x000878, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_43_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_42_Physics) == 0x000880, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_42_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_41_Physics) == 0x000888, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_41_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_40_Physics) == 0x000890, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_40_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_3_Physics) == 0x000898, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_3_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_39_Physics) == 0x0008A0, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_39_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_38_Physics) == 0x0008A8, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_38_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_37_Physics) == 0x0008B0, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_37_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_36_Physics) == 0x0008B8, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_36_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_35_Physics) == 0x0008C0, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_35_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_34_Physics) == 0x0008C8, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_34_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_33_Physics) == 0x0008D0, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_33_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_32_Physics) == 0x0008D8, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_32_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_31_Physics) == 0x0008E0, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_31_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_30_Physics) == 0x0008E8, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_30_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_2_Physics) == 0x0008F0, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_2_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_29_Physics) == 0x0008F8, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_29_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_28_Physics) == 0x000900, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_28_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_27_Physics) == 0x000908, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_27_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_26_Physics) == 0x000910, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_26_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_25_Physics) == 0x000918, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_25_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_24_Physics) == 0x000920, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_24_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_23_Physics) == 0x000928, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_23_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_22_Physics) == 0x000930, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_22_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_21_Physics) == 0x000938, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_21_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_20_Physics) == 0x000940, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_20_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_1_Physics) == 0x000948, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_1_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_19_Physics) == 0x000950, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_19_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_18_Physics) == 0x000958, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_18_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_17_Physics) == 0x000960, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_17_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_16_Physics) == 0x000968, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_16_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_15_Physics) == 0x000970, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_15_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_14_Physics) == 0x000978, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_14_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_13_Physics) == 0x000980, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_13_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_12_Physics) == 0x000988, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_12_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_11_Physics) == 0x000990, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_11_Physics' has a wrong offset!");
static_assert(offsetof(ASP_DyneBattleDebris_Static_04A_Physics_C, DyneBattleDebris_Static_04A_10_Physics) == 0x000998, "Member 'ASP_DyneBattleDebris_Static_04A_Physics_C::DyneBattleDebris_Static_04A_10_Physics' has a wrong offset!");

}

