#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SP_MStone_NIBLM_01A_Physics

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SP_MStone_NIBLM_01A_Physics.SP_MStone_NIBLM_01A_Physics_C
// 0x0070 (0x0860 - 0x07F0)
class ASP_MStone_NIBLM_01A_Physics_C final : public AEndTreasureCrystal
{
public:
	class UEndStaticMeshPhysicsPartsComponent*    MStone_NIBLM_01A_9_Physics1;                       // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    MStone_NIBLM_01A_8_Physics1;                       // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    MStone_NIBLM_01A_7_Physics1;                       // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    MStone_NIBLM_01A_6_Physics;                        // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    MStone_NIBLM_01A_5_Physics;                        // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    MStone_NIBLM_01A_4_Physics;                        // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    MStone_NIBLM_01A_3_Physics;                        // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    MStone_NIBLM_01A_2_Physics;                        // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    MStone_NIBLM_01A_1_Physics;                        // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    MStone_NIBLM_01A_14_Physics1;                      // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    MStone_NIBLM_01A_13_Physics1;                      // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    MStone_NIBLM_01A_12_Physics1;                      // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    MStone_NIBLM_01A_11_Physics1;                      // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    MStone_NIBLM_01A_10_Physics1;                      // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SP_MStone_NIBLM_01A_Physics_C">();
	}
	static class ASP_MStone_NIBLM_01A_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASP_MStone_NIBLM_01A_Physics_C>();
	}
};
static_assert(alignof(ASP_MStone_NIBLM_01A_Physics_C) == 0x000008, "Wrong alignment on ASP_MStone_NIBLM_01A_Physics_C");
static_assert(sizeof(ASP_MStone_NIBLM_01A_Physics_C) == 0x000860, "Wrong size on ASP_MStone_NIBLM_01A_Physics_C");
static_assert(offsetof(ASP_MStone_NIBLM_01A_Physics_C, MStone_NIBLM_01A_9_Physics1) == 0x0007F0, "Member 'ASP_MStone_NIBLM_01A_Physics_C::MStone_NIBLM_01A_9_Physics1' has a wrong offset!");
static_assert(offsetof(ASP_MStone_NIBLM_01A_Physics_C, MStone_NIBLM_01A_8_Physics1) == 0x0007F8, "Member 'ASP_MStone_NIBLM_01A_Physics_C::MStone_NIBLM_01A_8_Physics1' has a wrong offset!");
static_assert(offsetof(ASP_MStone_NIBLM_01A_Physics_C, MStone_NIBLM_01A_7_Physics1) == 0x000800, "Member 'ASP_MStone_NIBLM_01A_Physics_C::MStone_NIBLM_01A_7_Physics1' has a wrong offset!");
static_assert(offsetof(ASP_MStone_NIBLM_01A_Physics_C, MStone_NIBLM_01A_6_Physics) == 0x000808, "Member 'ASP_MStone_NIBLM_01A_Physics_C::MStone_NIBLM_01A_6_Physics' has a wrong offset!");
static_assert(offsetof(ASP_MStone_NIBLM_01A_Physics_C, MStone_NIBLM_01A_5_Physics) == 0x000810, "Member 'ASP_MStone_NIBLM_01A_Physics_C::MStone_NIBLM_01A_5_Physics' has a wrong offset!");
static_assert(offsetof(ASP_MStone_NIBLM_01A_Physics_C, MStone_NIBLM_01A_4_Physics) == 0x000818, "Member 'ASP_MStone_NIBLM_01A_Physics_C::MStone_NIBLM_01A_4_Physics' has a wrong offset!");
static_assert(offsetof(ASP_MStone_NIBLM_01A_Physics_C, MStone_NIBLM_01A_3_Physics) == 0x000820, "Member 'ASP_MStone_NIBLM_01A_Physics_C::MStone_NIBLM_01A_3_Physics' has a wrong offset!");
static_assert(offsetof(ASP_MStone_NIBLM_01A_Physics_C, MStone_NIBLM_01A_2_Physics) == 0x000828, "Member 'ASP_MStone_NIBLM_01A_Physics_C::MStone_NIBLM_01A_2_Physics' has a wrong offset!");
static_assert(offsetof(ASP_MStone_NIBLM_01A_Physics_C, MStone_NIBLM_01A_1_Physics) == 0x000830, "Member 'ASP_MStone_NIBLM_01A_Physics_C::MStone_NIBLM_01A_1_Physics' has a wrong offset!");
static_assert(offsetof(ASP_MStone_NIBLM_01A_Physics_C, MStone_NIBLM_01A_14_Physics1) == 0x000838, "Member 'ASP_MStone_NIBLM_01A_Physics_C::MStone_NIBLM_01A_14_Physics1' has a wrong offset!");
static_assert(offsetof(ASP_MStone_NIBLM_01A_Physics_C, MStone_NIBLM_01A_13_Physics1) == 0x000840, "Member 'ASP_MStone_NIBLM_01A_Physics_C::MStone_NIBLM_01A_13_Physics1' has a wrong offset!");
static_assert(offsetof(ASP_MStone_NIBLM_01A_Physics_C, MStone_NIBLM_01A_12_Physics1) == 0x000848, "Member 'ASP_MStone_NIBLM_01A_Physics_C::MStone_NIBLM_01A_12_Physics1' has a wrong offset!");
static_assert(offsetof(ASP_MStone_NIBLM_01A_Physics_C, MStone_NIBLM_01A_11_Physics1) == 0x000850, "Member 'ASP_MStone_NIBLM_01A_Physics_C::MStone_NIBLM_01A_11_Physics1' has a wrong offset!");
static_assert(offsetof(ASP_MStone_NIBLM_01A_Physics_C, MStone_NIBLM_01A_10_Physics1) == 0x000858, "Member 'ASP_MStone_NIBLM_01A_Physics_C::MStone_NIBLM_01A_10_Physics1' has a wrong offset!");

}

