#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SP_Table_Static_01A_Physics

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SP_Table_Static_01A_Physics.SP_Table_Static_01A_Physics_C
// 0x0038 (0x0820 - 0x07E8)
class ASP_Table_Static_01A_Physics_C final : public AEndEnvironmentPhysicsStaticMeshActor
{
public:
	class UEndStaticMeshPhysicsPartsComponent*    Table_Static_01A_7_Physics;                        // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Table_Static_01A_6_Physics;                        // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Table_Static_01A_5_Physics;                        // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Table_Static_01A_4_Physics;                        // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Table_Static_01A_3_Physics;                        // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Table_Static_01A_2_Physics;                        // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndStaticMeshPhysicsPartsComponent*    Table_Static_01A_1_Physics;                        // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SP_Table_Static_01A_Physics_C">();
	}
	static class ASP_Table_Static_01A_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASP_Table_Static_01A_Physics_C>();
	}
};
static_assert(alignof(ASP_Table_Static_01A_Physics_C) == 0x000008, "Wrong alignment on ASP_Table_Static_01A_Physics_C");
static_assert(sizeof(ASP_Table_Static_01A_Physics_C) == 0x000820, "Wrong size on ASP_Table_Static_01A_Physics_C");
static_assert(offsetof(ASP_Table_Static_01A_Physics_C, Table_Static_01A_7_Physics) == 0x0007E8, "Member 'ASP_Table_Static_01A_Physics_C::Table_Static_01A_7_Physics' has a wrong offset!");
static_assert(offsetof(ASP_Table_Static_01A_Physics_C, Table_Static_01A_6_Physics) == 0x0007F0, "Member 'ASP_Table_Static_01A_Physics_C::Table_Static_01A_6_Physics' has a wrong offset!");
static_assert(offsetof(ASP_Table_Static_01A_Physics_C, Table_Static_01A_5_Physics) == 0x0007F8, "Member 'ASP_Table_Static_01A_Physics_C::Table_Static_01A_5_Physics' has a wrong offset!");
static_assert(offsetof(ASP_Table_Static_01A_Physics_C, Table_Static_01A_4_Physics) == 0x000800, "Member 'ASP_Table_Static_01A_Physics_C::Table_Static_01A_4_Physics' has a wrong offset!");
static_assert(offsetof(ASP_Table_Static_01A_Physics_C, Table_Static_01A_3_Physics) == 0x000808, "Member 'ASP_Table_Static_01A_Physics_C::Table_Static_01A_3_Physics' has a wrong offset!");
static_assert(offsetof(ASP_Table_Static_01A_Physics_C, Table_Static_01A_2_Physics) == 0x000810, "Member 'ASP_Table_Static_01A_Physics_C::Table_Static_01A_2_Physics' has a wrong offset!");
static_assert(offsetof(ASP_Table_Static_01A_Physics_C, Table_Static_01A_1_Physics) == 0x000818, "Member 'ASP_Table_Static_01A_Physics_C::Table_Static_01A_1_Physics' has a wrong offset!");

}

