#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplineAssetRail1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SplineAssetRail1.SplineAssetRail1_C
// 0x0020 (0x0248 - 0x0228)
class ASplineAssetRail1_C final : public AActor
{
public:
	class USplineComponent*                       Spline;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMesh*                            StaticMesh;                                        // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               ForwardAxis;                                       // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 NewVar_0;                                          // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SplineAssetRail1_C">();
	}
	static class ASplineAssetRail1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASplineAssetRail1_C>();
	}
};
static_assert(alignof(ASplineAssetRail1_C) == 0x000008, "Wrong alignment on ASplineAssetRail1_C");
static_assert(sizeof(ASplineAssetRail1_C) == 0x000248, "Wrong size on ASplineAssetRail1_C");
static_assert(offsetof(ASplineAssetRail1_C, Spline) == 0x000228, "Member 'ASplineAssetRail1_C::Spline' has a wrong offset!");
static_assert(offsetof(ASplineAssetRail1_C, StaticMesh) == 0x000230, "Member 'ASplineAssetRail1_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ASplineAssetRail1_C, ForwardAxis) == 0x000238, "Member 'ASplineAssetRail1_C::ForwardAxis' has a wrong offset!");
static_assert(offsetof(ASplineAssetRail1_C, NewVar_0) == 0x000240, "Member 'ASplineAssetRail1_C::NewVar_0' has a wrong offset!");

}

