#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SQEXSEAD

#include "Basic.hpp"

#include "SQEXSEAD_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SQEXSEAD.SQEXSEADAudioComponent.GetPlaybackTimePercent
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADAudioComponent_GetPlaybackTimePercent final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADAudioComponent_GetPlaybackTimePercent) == 0x000004, "Wrong alignment on SQEXSEADAudioComponent_GetPlaybackTimePercent");
static_assert(sizeof(SQEXSEADAudioComponent_GetPlaybackTimePercent) == 0x000004, "Wrong size on SQEXSEADAudioComponent_GetPlaybackTimePercent");
static_assert(offsetof(SQEXSEADAudioComponent_GetPlaybackTimePercent, ReturnValue) == 0x000000, "Member 'SQEXSEADAudioComponent_GetPlaybackTimePercent::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.GetJustTiming
// 0x000C (0x000C - 0x0000)
struct SQEXSEADBGMSlotController_GetJustTiming final
{
public:
	struct FSQEXSEAD_Timing                       ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_GetJustTiming) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_GetJustTiming");
static_assert(sizeof(SQEXSEADBGMSlotController_GetJustTiming) == 0x00000C, "Wrong size on SQEXSEADBGMSlotController_GetJustTiming");
static_assert(offsetof(SQEXSEADBGMSlotController_GetJustTiming, ReturnValue) == 0x000000, "Member 'SQEXSEADBGMSlotController_GetJustTiming::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.GetLowpassValue
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADBGMSlotController_GetLowpassValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_GetLowpassValue) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_GetLowpassValue");
static_assert(sizeof(SQEXSEADBGMSlotController_GetLowpassValue) == 0x000004, "Wrong size on SQEXSEADBGMSlotController_GetLowpassValue");
static_assert(offsetof(SQEXSEADBGMSlotController_GetLowpassValue, ReturnValue) == 0x000000, "Member 'SQEXSEADBGMSlotController_GetLowpassValue::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.GetModeIndex
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADBGMSlotController_GetModeIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_GetModeIndex) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_GetModeIndex");
static_assert(sizeof(SQEXSEADBGMSlotController_GetModeIndex) == 0x000004, "Wrong size on SQEXSEADBGMSlotController_GetModeIndex");
static_assert(offsetof(SQEXSEADBGMSlotController_GetModeIndex, ReturnValue) == 0x000000, "Member 'SQEXSEADBGMSlotController_GetModeIndex::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.GetMusicalTime
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADBGMSlotController_GetMusicalTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_GetMusicalTime) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_GetMusicalTime");
static_assert(sizeof(SQEXSEADBGMSlotController_GetMusicalTime) == 0x000004, "Wrong size on SQEXSEADBGMSlotController_GetMusicalTime");
static_assert(offsetof(SQEXSEADBGMSlotController_GetMusicalTime, ReturnValue) == 0x000000, "Member 'SQEXSEADBGMSlotController_GetMusicalTime::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.GetNearTiming
// 0x000C (0x000C - 0x0000)
struct SQEXSEADBGMSlotController_GetNearTiming final
{
public:
	struct FSQEXSEAD_Timing                       ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_GetNearTiming) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_GetNearTiming");
static_assert(sizeof(SQEXSEADBGMSlotController_GetNearTiming) == 0x00000C, "Wrong size on SQEXSEADBGMSlotController_GetNearTiming");
static_assert(offsetof(SQEXSEADBGMSlotController_GetNearTiming, ReturnValue) == 0x000000, "Member 'SQEXSEADBGMSlotController_GetNearTiming::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.GetNextSectionIndex
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADBGMSlotController_GetNextSectionIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_GetNextSectionIndex) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_GetNextSectionIndex");
static_assert(sizeof(SQEXSEADBGMSlotController_GetNextSectionIndex) == 0x000004, "Wrong size on SQEXSEADBGMSlotController_GetNextSectionIndex");
static_assert(offsetof(SQEXSEADBGMSlotController_GetNextSectionIndex, ReturnValue) == 0x000000, "Member 'SQEXSEADBGMSlotController_GetNextSectionIndex::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.GetPlayTime
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADBGMSlotController_GetPlayTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_GetPlayTime) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_GetPlayTime");
static_assert(sizeof(SQEXSEADBGMSlotController_GetPlayTime) == 0x000004, "Wrong size on SQEXSEADBGMSlotController_GetPlayTime");
static_assert(offsetof(SQEXSEADBGMSlotController_GetPlayTime, ReturnValue) == 0x000000, "Member 'SQEXSEADBGMSlotController_GetPlayTime::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.GetSectionIndex
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADBGMSlotController_GetSectionIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_GetSectionIndex) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_GetSectionIndex");
static_assert(sizeof(SQEXSEADBGMSlotController_GetSectionIndex) == 0x000004, "Wrong size on SQEXSEADBGMSlotController_GetSectionIndex");
static_assert(offsetof(SQEXSEADBGMSlotController_GetSectionIndex, ReturnValue) == 0x000000, "Member 'SQEXSEADBGMSlotController_GetSectionIndex::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.GetTempo
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADBGMSlotController_GetTempo final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_GetTempo) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_GetTempo");
static_assert(sizeof(SQEXSEADBGMSlotController_GetTempo) == 0x000004, "Wrong size on SQEXSEADBGMSlotController_GetTempo");
static_assert(offsetof(SQEXSEADBGMSlotController_GetTempo, ReturnValue) == 0x000000, "Member 'SQEXSEADBGMSlotController_GetTempo::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.GetVirtual3DPosition
// 0x000C (0x000C - 0x0000)
struct SQEXSEADBGMSlotController_GetVirtual3DPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_GetVirtual3DPosition) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_GetVirtual3DPosition");
static_assert(sizeof(SQEXSEADBGMSlotController_GetVirtual3DPosition) == 0x00000C, "Wrong size on SQEXSEADBGMSlotController_GetVirtual3DPosition");
static_assert(offsetof(SQEXSEADBGMSlotController_GetVirtual3DPosition, ReturnValue) == 0x000000, "Member 'SQEXSEADBGMSlotController_GetVirtual3DPosition::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.IsFadeOuting
// 0x000C (0x000C - 0x0000)
struct SQEXSEADBGMSlotController_IsFadeOuting final
{
public:
	class FName                                   SoundAssetName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEXSEADBGMSlotController_IsFadeOuting) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_IsFadeOuting");
static_assert(sizeof(SQEXSEADBGMSlotController_IsFadeOuting) == 0x00000C, "Wrong size on SQEXSEADBGMSlotController_IsFadeOuting");
static_assert(offsetof(SQEXSEADBGMSlotController_IsFadeOuting, SoundAssetName) == 0x000000, "Member 'SQEXSEADBGMSlotController_IsFadeOuting::SoundAssetName' has a wrong offset!");
static_assert(offsetof(SQEXSEADBGMSlotController_IsFadeOuting, ReturnValue) == 0x000008, "Member 'SQEXSEADBGMSlotController_IsFadeOuting::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct SQEXSEADBGMSlotController_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_IsPlaying) == 0x000001, "Wrong alignment on SQEXSEADBGMSlotController_IsPlaying");
static_assert(sizeof(SQEXSEADBGMSlotController_IsPlaying) == 0x000001, "Wrong size on SQEXSEADBGMSlotController_IsPlaying");
static_assert(offsetof(SQEXSEADBGMSlotController_IsPlaying, ReturnValue) == 0x000000, "Member 'SQEXSEADBGMSlotController_IsPlaying::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.Set
// 0x0008 (0x0008 - 0x0000)
struct SQEXSEADBGMSlotController_Set final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_Set) == 0x000008, "Wrong alignment on SQEXSEADBGMSlotController_Set");
static_assert(sizeof(SQEXSEADBGMSlotController_Set) == 0x000008, "Wrong size on SQEXSEADBGMSlotController_Set");
static_assert(offsetof(SQEXSEADBGMSlotController_Set, Sound) == 0x000000, "Member 'SQEXSEADBGMSlotController_Set::Sound' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetEnableVirtual3D
// 0x0008 (0x0008 - 0x0000)
struct SQEXSEADBGMSlotController_SetEnableVirtual3D final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeTime;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetEnableVirtual3D) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_SetEnableVirtual3D");
static_assert(sizeof(SQEXSEADBGMSlotController_SetEnableVirtual3D) == 0x000008, "Wrong size on SQEXSEADBGMSlotController_SetEnableVirtual3D");
static_assert(offsetof(SQEXSEADBGMSlotController_SetEnableVirtual3D, bEnable) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetEnableVirtual3D::bEnable' has a wrong offset!");
static_assert(offsetof(SQEXSEADBGMSlotController_SetEnableVirtual3D, FadeTime) == 0x000004, "Member 'SQEXSEADBGMSlotController_SetEnableVirtual3D::FadeTime' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetMode
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADBGMSlotController_SetMode final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetMode) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_SetMode");
static_assert(sizeof(SQEXSEADBGMSlotController_SetMode) == 0x000004, "Wrong size on SQEXSEADBGMSlotController_SetMode");
static_assert(offsetof(SQEXSEADBGMSlotController_SetMode, Index_0) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetMode::Index_0' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetModeByName
// 0x0008 (0x0008 - 0x0000)
struct SQEXSEADBGMSlotController_SetModeByName final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetModeByName) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_SetModeByName");
static_assert(sizeof(SQEXSEADBGMSlotController_SetModeByName) == 0x000008, "Wrong size on SQEXSEADBGMSlotController_SetModeByName");
static_assert(offsetof(SQEXSEADBGMSlotController_SetModeByName, Name_0) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetModeByName::Name_0' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetOptions
// 0x001C (0x001C - 0x0000)
struct SQEXSEADBGMSlotController_SetOptions final
{
public:
	struct FSQEXSEAD_BGMOptions                   NewOptions;                                        // 0x0000(0x001C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetOptions) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_SetOptions");
static_assert(sizeof(SQEXSEADBGMSlotController_SetOptions) == 0x00001C, "Wrong size on SQEXSEADBGMSlotController_SetOptions");
static_assert(offsetof(SQEXSEADBGMSlotController_SetOptions, NewOptions) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetOptions::NewOptions' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetPath
// 0x0010 (0x0010 - 0x0000)
struct SQEXSEADBGMSlotController_SetPath final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetPath) == 0x000008, "Wrong alignment on SQEXSEADBGMSlotController_SetPath");
static_assert(sizeof(SQEXSEADBGMSlotController_SetPath) == 0x000010, "Wrong size on SQEXSEADBGMSlotController_SetPath");
static_assert(offsetof(SQEXSEADBGMSlotController_SetPath, Path) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetPath::Path' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetPlayFadeInTime
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADBGMSlotController_SetPlayFadeInTime final
{
public:
	float                                         FadeTime;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetPlayFadeInTime) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_SetPlayFadeInTime");
static_assert(sizeof(SQEXSEADBGMSlotController_SetPlayFadeInTime) == 0x000004, "Wrong size on SQEXSEADBGMSlotController_SetPlayFadeInTime");
static_assert(offsetof(SQEXSEADBGMSlotController_SetPlayFadeInTime, FadeTime) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetPlayFadeInTime::FadeTime' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetPriority
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADBGMSlotController_SetPriority final
{
public:
	int32                                         Priority;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetPriority) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_SetPriority");
static_assert(sizeof(SQEXSEADBGMSlotController_SetPriority) == 0x000004, "Wrong size on SQEXSEADBGMSlotController_SetPriority");
static_assert(offsetof(SQEXSEADBGMSlotController_SetPriority, Priority) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetPriority::Priority' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetRestartSameBGM
// 0x0001 (0x0001 - 0x0000)
struct SQEXSEADBGMSlotController_SetRestartSameBGM final
{
public:
	bool                                          bRestart;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetRestartSameBGM) == 0x000001, "Wrong alignment on SQEXSEADBGMSlotController_SetRestartSameBGM");
static_assert(sizeof(SQEXSEADBGMSlotController_SetRestartSameBGM) == 0x000001, "Wrong size on SQEXSEADBGMSlotController_SetRestartSameBGM");
static_assert(offsetof(SQEXSEADBGMSlotController_SetRestartSameBGM, bRestart) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetRestartSameBGM::bRestart' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetResumeFadeInTime
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADBGMSlotController_SetResumeFadeInTime final
{
public:
	float                                         FadeTime;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetResumeFadeInTime) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_SetResumeFadeInTime");
static_assert(sizeof(SQEXSEADBGMSlotController_SetResumeFadeInTime) == 0x000004, "Wrong size on SQEXSEADBGMSlotController_SetResumeFadeInTime");
static_assert(offsetof(SQEXSEADBGMSlotController_SetResumeFadeInTime, FadeTime) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetResumeFadeInTime::FadeTime' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetSection
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADBGMSlotController_SetSection final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetSection) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_SetSection");
static_assert(sizeof(SQEXSEADBGMSlotController_SetSection) == 0x000004, "Wrong size on SQEXSEADBGMSlotController_SetSection");
static_assert(offsetof(SQEXSEADBGMSlotController_SetSection, Index_0) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetSection::Index_0' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetSectionByName
// 0x0008 (0x0008 - 0x0000)
struct SQEXSEADBGMSlotController_SetSectionByName final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetSectionByName) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_SetSectionByName");
static_assert(sizeof(SQEXSEADBGMSlotController_SetSectionByName) == 0x000008, "Wrong size on SQEXSEADBGMSlotController_SetSectionByName");
static_assert(offsetof(SQEXSEADBGMSlotController_SetSectionByName, Name_0) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetSectionByName::Name_0' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetSeekTime
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADBGMSlotController_SetSeekTime final
{
public:
	float                                         SeekTime;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetSeekTime) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_SetSeekTime");
static_assert(sizeof(SQEXSEADBGMSlotController_SetSeekTime) == 0x000004, "Wrong size on SQEXSEADBGMSlotController_SetSeekTime");
static_assert(offsetof(SQEXSEADBGMSlotController_SetSeekTime, SeekTime) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetSeekTime::SeekTime' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetStopFadeOutTime
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADBGMSlotController_SetStopFadeOutTime final
{
public:
	float                                         FadeTime;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetStopFadeOutTime) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_SetStopFadeOutTime");
static_assert(sizeof(SQEXSEADBGMSlotController_SetStopFadeOutTime) == 0x000004, "Wrong size on SQEXSEADBGMSlotController_SetStopFadeOutTime");
static_assert(offsetof(SQEXSEADBGMSlotController_SetStopFadeOutTime, FadeTime) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetStopFadeOutTime::FadeTime' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetStoreBehaviour
// 0x0001 (0x0001 - 0x0000)
struct SQEXSEADBGMSlotController_SetStoreBehaviour final
{
public:
	ESQEXSEAD_BGMStoreBehaviour                   StoreBehaviour;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetStoreBehaviour) == 0x000001, "Wrong alignment on SQEXSEADBGMSlotController_SetStoreBehaviour");
static_assert(sizeof(SQEXSEADBGMSlotController_SetStoreBehaviour) == 0x000001, "Wrong size on SQEXSEADBGMSlotController_SetStoreBehaviour");
static_assert(offsetof(SQEXSEADBGMSlotController_SetStoreBehaviour, StoreBehaviour) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetStoreBehaviour::StoreBehaviour' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetSuspendFadeOutTime
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADBGMSlotController_SetSuspendFadeOutTime final
{
public:
	float                                         FadeTime;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetSuspendFadeOutTime) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_SetSuspendFadeOutTime");
static_assert(sizeof(SQEXSEADBGMSlotController_SetSuspendFadeOutTime) == 0x000004, "Wrong size on SQEXSEADBGMSlotController_SetSuspendFadeOutTime");
static_assert(offsetof(SQEXSEADBGMSlotController_SetSuspendFadeOutTime, FadeTime) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetSuspendFadeOutTime::FadeTime' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetVirtual3DParam
// 0x002C (0x002C - 0x0000)
struct SQEXSEADBGMSlotController_SetVirtual3DParam final
{
public:
	struct FSQEXSEAD_BGMVirtual3DParam            Param;                                             // 0x0000(0x002C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetVirtual3DParam) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_SetVirtual3DParam");
static_assert(sizeof(SQEXSEADBGMSlotController_SetVirtual3DParam) == 0x00002C, "Wrong size on SQEXSEADBGMSlotController_SetVirtual3DParam");
static_assert(offsetof(SQEXSEADBGMSlotController_SetVirtual3DParam, Param) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetVirtual3DParam::Param' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetVirtual3DPosition
// 0x0010 (0x0010 - 0x0000)
struct SQEXSEADBGMSlotController_SetVirtual3DPosition final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeTime;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetVirtual3DPosition) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_SetVirtual3DPosition");
static_assert(sizeof(SQEXSEADBGMSlotController_SetVirtual3DPosition) == 0x000010, "Wrong size on SQEXSEADBGMSlotController_SetVirtual3DPosition");
static_assert(offsetof(SQEXSEADBGMSlotController_SetVirtual3DPosition, Position) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetVirtual3DPosition::Position' has a wrong offset!");
static_assert(offsetof(SQEXSEADBGMSlotController_SetVirtual3DPosition, FadeTime) == 0x00000C, "Member 'SQEXSEADBGMSlotController_SetVirtual3DPosition::FadeTime' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADBGMSlotController.SetVolume
// 0x0008 (0x0008 - 0x0000)
struct SQEXSEADBGMSlotController_SetVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeTime;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADBGMSlotController_SetVolume) == 0x000004, "Wrong alignment on SQEXSEADBGMSlotController_SetVolume");
static_assert(sizeof(SQEXSEADBGMSlotController_SetVolume) == 0x000008, "Wrong size on SQEXSEADBGMSlotController_SetVolume");
static_assert(offsetof(SQEXSEADBGMSlotController_SetVolume, Volume) == 0x000000, "Member 'SQEXSEADBGMSlotController_SetVolume::Volume' has a wrong offset!");
static_assert(offsetof(SQEXSEADBGMSlotController_SetVolume, FadeTime) == 0x000004, "Member 'SQEXSEADBGMSlotController_SetVolume::FadeTime' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.AutoSeCtrl_SetEnable
// 0x0001 (0x0001 - 0x0000)
struct SQEXSEADStatics_AutoSeCtrl_SetEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_AutoSeCtrl_SetEnable) == 0x000001, "Wrong alignment on SQEXSEADStatics_AutoSeCtrl_SetEnable");
static_assert(sizeof(SQEXSEADStatics_AutoSeCtrl_SetEnable) == 0x000001, "Wrong size on SQEXSEADStatics_AutoSeCtrl_SetEnable");
static_assert(offsetof(SQEXSEADStatics_AutoSeCtrl_SetEnable, Enable) == 0x000000, "Member 'SQEXSEADStatics_AutoSeCtrl_SetEnable::Enable' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.CallEvent
// 0x0008 (0x0008 - 0x0000)
struct SQEXSEADStatics_CallEvent final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_CallEvent) == 0x000004, "Wrong alignment on SQEXSEADStatics_CallEvent");
static_assert(sizeof(SQEXSEADStatics_CallEvent) == 0x000008, "Wrong size on SQEXSEADStatics_CallEvent");
static_assert(offsetof(SQEXSEADStatics_CallEvent, EventName) == 0x000000, "Member 'SQEXSEADStatics_CallEvent::EventName' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.CategoryCtrl_DebugMute
// 0x0010 (0x0010 - 0x0000)
struct SQEXSEADStatics_CategoryCtrl_DebugMute final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bToBeMuted;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeTime;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_CategoryCtrl_DebugMute) == 0x000004, "Wrong alignment on SQEXSEADStatics_CategoryCtrl_DebugMute");
static_assert(sizeof(SQEXSEADStatics_CategoryCtrl_DebugMute) == 0x000010, "Wrong size on SQEXSEADStatics_CategoryCtrl_DebugMute");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_DebugMute, CategoryName) == 0x000000, "Member 'SQEXSEADStatics_CategoryCtrl_DebugMute::CategoryName' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_DebugMute, bToBeMuted) == 0x000008, "Member 'SQEXSEADStatics_CategoryCtrl_DebugMute::bToBeMuted' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_DebugMute, FadeTime) == 0x00000C, "Member 'SQEXSEADStatics_CategoryCtrl_DebugMute::FadeTime' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.CategoryCtrl_GetVolume
// 0x0010 (0x0010 - 0x0000)
struct SQEXSEADStatics_CategoryCtrl_GetVolume final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEXSEADCategoryVolumeLayers                 targerlayer;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_CategoryCtrl_GetVolume) == 0x000004, "Wrong alignment on SQEXSEADStatics_CategoryCtrl_GetVolume");
static_assert(sizeof(SQEXSEADStatics_CategoryCtrl_GetVolume) == 0x000010, "Wrong size on SQEXSEADStatics_CategoryCtrl_GetVolume");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_GetVolume, CategoryName) == 0x000000, "Member 'SQEXSEADStatics_CategoryCtrl_GetVolume::CategoryName' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_GetVolume, targerlayer) == 0x000008, "Member 'SQEXSEADStatics_CategoryCtrl_GetVolume::targerlayer' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_GetVolume, ReturnValue) == 0x00000C, "Member 'SQEXSEADStatics_CategoryCtrl_GetVolume::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.CategoryCtrl_Resume
// 0x000C (0x000C - 0x0000)
struct SQEXSEADStatics_CategoryCtrl_Resume final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeInTime;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_CategoryCtrl_Resume) == 0x000004, "Wrong alignment on SQEXSEADStatics_CategoryCtrl_Resume");
static_assert(sizeof(SQEXSEADStatics_CategoryCtrl_Resume) == 0x00000C, "Wrong size on SQEXSEADStatics_CategoryCtrl_Resume");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_Resume, CategoryName) == 0x000000, "Member 'SQEXSEADStatics_CategoryCtrl_Resume::CategoryName' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_Resume, FadeInTime) == 0x000008, "Member 'SQEXSEADStatics_CategoryCtrl_Resume::FadeInTime' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.CategoryCtrl_SetPitch
// 0x0010 (0x0010 - 0x0000)
struct SQEXSEADStatics_CategoryCtrl_SetPitch final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Pitch;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeTime;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_CategoryCtrl_SetPitch) == 0x000004, "Wrong alignment on SQEXSEADStatics_CategoryCtrl_SetPitch");
static_assert(sizeof(SQEXSEADStatics_CategoryCtrl_SetPitch) == 0x000010, "Wrong size on SQEXSEADStatics_CategoryCtrl_SetPitch");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_SetPitch, CategoryName) == 0x000000, "Member 'SQEXSEADStatics_CategoryCtrl_SetPitch::CategoryName' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_SetPitch, Pitch) == 0x000008, "Member 'SQEXSEADStatics_CategoryCtrl_SetPitch::Pitch' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_SetPitch, FadeTime) == 0x00000C, "Member 'SQEXSEADStatics_CategoryCtrl_SetPitch::FadeTime' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.CategoryCtrl_SetVolume
// 0x0014 (0x0014 - 0x0000)
struct SQEXSEADStatics_CategoryCtrl_SetVolume final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeTime;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEXSEADCategoryVolumeLayers                 targerlayer;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEXSEADStatics_CategoryCtrl_SetVolume) == 0x000004, "Wrong alignment on SQEXSEADStatics_CategoryCtrl_SetVolume");
static_assert(sizeof(SQEXSEADStatics_CategoryCtrl_SetVolume) == 0x000014, "Wrong size on SQEXSEADStatics_CategoryCtrl_SetVolume");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_SetVolume, CategoryName) == 0x000000, "Member 'SQEXSEADStatics_CategoryCtrl_SetVolume::CategoryName' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_SetVolume, Volume) == 0x000008, "Member 'SQEXSEADStatics_CategoryCtrl_SetVolume::Volume' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_SetVolume, FadeTime) == 0x00000C, "Member 'SQEXSEADStatics_CategoryCtrl_SetVolume::FadeTime' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_SetVolume, targerlayer) == 0x000010, "Member 'SQEXSEADStatics_CategoryCtrl_SetVolume::targerlayer' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.CategoryCtrl_Stop
// 0x000C (0x000C - 0x0000)
struct SQEXSEADStatics_CategoryCtrl_Stop final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_CategoryCtrl_Stop) == 0x000004, "Wrong alignment on SQEXSEADStatics_CategoryCtrl_Stop");
static_assert(sizeof(SQEXSEADStatics_CategoryCtrl_Stop) == 0x00000C, "Wrong size on SQEXSEADStatics_CategoryCtrl_Stop");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_Stop, CategoryName) == 0x000000, "Member 'SQEXSEADStatics_CategoryCtrl_Stop::CategoryName' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_Stop, FadeOutTime) == 0x000008, "Member 'SQEXSEADStatics_CategoryCtrl_Stop::FadeOutTime' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.CategoryCtrl_Suspend
// 0x000C (0x000C - 0x0000)
struct SQEXSEADStatics_CategoryCtrl_Suspend final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_CategoryCtrl_Suspend) == 0x000004, "Wrong alignment on SQEXSEADStatics_CategoryCtrl_Suspend");
static_assert(sizeof(SQEXSEADStatics_CategoryCtrl_Suspend) == 0x00000C, "Wrong size on SQEXSEADStatics_CategoryCtrl_Suspend");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_Suspend, CategoryName) == 0x000000, "Member 'SQEXSEADStatics_CategoryCtrl_Suspend::CategoryName' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_Suspend, FadeOutTime) == 0x000008, "Member 'SQEXSEADStatics_CategoryCtrl_Suspend::FadeOutTime' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.CategoryCtrl_ToggleDebugMute
// 0x000C (0x000C - 0x0000)
struct SQEXSEADStatics_CategoryCtrl_ToggleDebugMute final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeTime;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_CategoryCtrl_ToggleDebugMute) == 0x000004, "Wrong alignment on SQEXSEADStatics_CategoryCtrl_ToggleDebugMute");
static_assert(sizeof(SQEXSEADStatics_CategoryCtrl_ToggleDebugMute) == 0x00000C, "Wrong size on SQEXSEADStatics_CategoryCtrl_ToggleDebugMute");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_ToggleDebugMute, CategoryName) == 0x000000, "Member 'SQEXSEADStatics_CategoryCtrl_ToggleDebugMute::CategoryName' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_CategoryCtrl_ToggleDebugMute, FadeTime) == 0x000008, "Member 'SQEXSEADStatics_CategoryCtrl_ToggleDebugMute::FadeTime' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.CreateBGMSlot
// 0x0030 (0x0030 - 0x0000)
struct SQEXSEADStatics_CreateBGMSlot final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSQEXSEAD_BGMOptions                   Options;                                           // 0x0008(0x001C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USQEXSEADBGMSlotController*             ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_CreateBGMSlot) == 0x000008, "Wrong alignment on SQEXSEADStatics_CreateBGMSlot");
static_assert(sizeof(SQEXSEADStatics_CreateBGMSlot) == 0x000030, "Wrong size on SQEXSEADStatics_CreateBGMSlot");
static_assert(offsetof(SQEXSEADStatics_CreateBGMSlot, Name_0) == 0x000000, "Member 'SQEXSEADStatics_CreateBGMSlot::Name_0' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_CreateBGMSlot, Options) == 0x000008, "Member 'SQEXSEADStatics_CreateBGMSlot::Options' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_CreateBGMSlot, ReturnValue) == 0x000028, "Member 'SQEXSEADStatics_CreateBGMSlot::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.ExecAudioVolumeEvent
// 0x0010 (0x0010 - 0x0000)
struct SQEXSEADStatics_ExecAudioVolumeEvent final
{
public:
	class FName                                   ActorName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AudioVolumeEventName;                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_ExecAudioVolumeEvent) == 0x000004, "Wrong alignment on SQEXSEADStatics_ExecAudioVolumeEvent");
static_assert(sizeof(SQEXSEADStatics_ExecAudioVolumeEvent) == 0x000010, "Wrong size on SQEXSEADStatics_ExecAudioVolumeEvent");
static_assert(offsetof(SQEXSEADStatics_ExecAudioVolumeEvent, ActorName) == 0x000000, "Member 'SQEXSEADStatics_ExecAudioVolumeEvent::ActorName' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_ExecAudioVolumeEvent, AudioVolumeEventName) == 0x000008, "Member 'SQEXSEADStatics_ExecAudioVolumeEvent::AudioVolumeEventName' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.GetBGMSlotController
// 0x0010 (0x0010 - 0x0000)
struct SQEXSEADStatics_GetBGMSlotController final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USQEXSEADBGMSlotController*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_GetBGMSlotController) == 0x000008, "Wrong alignment on SQEXSEADStatics_GetBGMSlotController");
static_assert(sizeof(SQEXSEADStatics_GetBGMSlotController) == 0x000010, "Wrong size on SQEXSEADStatics_GetBGMSlotController");
static_assert(offsetof(SQEXSEADStatics_GetBGMSlotController, Name_0) == 0x000000, "Member 'SQEXSEADStatics_GetBGMSlotController::Name_0' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_GetBGMSlotController, ReturnValue) == 0x000008, "Member 'SQEXSEADStatics_GetBGMSlotController::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.GetPadSpeakerEnable
// 0x0001 (0x0001 - 0x0000)
struct SQEXSEADStatics_GetPadSpeakerEnable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_GetPadSpeakerEnable) == 0x000001, "Wrong alignment on SQEXSEADStatics_GetPadSpeakerEnable");
static_assert(sizeof(SQEXSEADStatics_GetPadSpeakerEnable) == 0x000001, "Wrong size on SQEXSEADStatics_GetPadSpeakerEnable");
static_assert(offsetof(SQEXSEADStatics_GetPadSpeakerEnable, ReturnValue) == 0x000000, "Member 'SQEXSEADStatics_GetPadSpeakerEnable::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.GetPadVibrationEnable
// 0x0001 (0x0001 - 0x0000)
struct SQEXSEADStatics_GetPadVibrationEnable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_GetPadVibrationEnable) == 0x000001, "Wrong alignment on SQEXSEADStatics_GetPadVibrationEnable");
static_assert(sizeof(SQEXSEADStatics_GetPadVibrationEnable) == 0x000001, "Wrong size on SQEXSEADStatics_GetPadVibrationEnable");
static_assert(offsetof(SQEXSEADStatics_GetPadVibrationEnable, ReturnValue) == 0x000000, "Member 'SQEXSEADStatics_GetPadVibrationEnable::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.GetRenderGrainSize
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADStatics_GetRenderGrainSize final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_GetRenderGrainSize) == 0x000004, "Wrong alignment on SQEXSEADStatics_GetRenderGrainSize");
static_assert(sizeof(SQEXSEADStatics_GetRenderGrainSize) == 0x000004, "Wrong size on SQEXSEADStatics_GetRenderGrainSize");
static_assert(offsetof(SQEXSEADStatics_GetRenderGrainSize, ReturnValue) == 0x000000, "Member 'SQEXSEADStatics_GetRenderGrainSize::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.GetRenderGrainSlope
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADStatics_GetRenderGrainSlope final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_GetRenderGrainSlope) == 0x000004, "Wrong alignment on SQEXSEADStatics_GetRenderGrainSlope");
static_assert(sizeof(SQEXSEADStatics_GetRenderGrainSlope) == 0x000004, "Wrong size on SQEXSEADStatics_GetRenderGrainSlope");
static_assert(offsetof(SQEXSEADStatics_GetRenderGrainSlope, ReturnValue) == 0x000000, "Member 'SQEXSEADStatics_GetRenderGrainSlope::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.GetRenderSpeedRate
// 0x0004 (0x0004 - 0x0000)
struct SQEXSEADStatics_GetRenderSpeedRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_GetRenderSpeedRate) == 0x000004, "Wrong alignment on SQEXSEADStatics_GetRenderSpeedRate");
static_assert(sizeof(SQEXSEADStatics_GetRenderSpeedRate) == 0x000004, "Wrong size on SQEXSEADStatics_GetRenderSpeedRate");
static_assert(offsetof(SQEXSEADStatics_GetRenderSpeedRate, ReturnValue) == 0x000000, "Member 'SQEXSEADStatics_GetRenderSpeedRate::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.GetSoundDuration
// 0x0018 (0x0018 - 0x0000)
struct SQEXSEADStatics_GetSoundDuration final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SoundName;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEXSEADStatics_GetSoundDuration) == 0x000008, "Wrong alignment on SQEXSEADStatics_GetSoundDuration");
static_assert(sizeof(SQEXSEADStatics_GetSoundDuration) == 0x000018, "Wrong size on SQEXSEADStatics_GetSoundDuration");
static_assert(offsetof(SQEXSEADStatics_GetSoundDuration, Sound) == 0x000000, "Member 'SQEXSEADStatics_GetSoundDuration::Sound' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_GetSoundDuration, SoundName) == 0x000008, "Member 'SQEXSEADStatics_GetSoundDuration::SoundName' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_GetSoundDuration, ReturnValue) == 0x000010, "Member 'SQEXSEADStatics_GetSoundDuration::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.IsEnableAudioVolumeUpdate
// 0x0001 (0x0001 - 0x0000)
struct SQEXSEADStatics_IsEnableAudioVolumeUpdate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SQEXSEADStatics_IsEnableAudioVolumeUpdate) == 0x000001, "Wrong alignment on SQEXSEADStatics_IsEnableAudioVolumeUpdate");
static_assert(sizeof(SQEXSEADStatics_IsEnableAudioVolumeUpdate) == 0x000001, "Wrong size on SQEXSEADStatics_IsEnableAudioVolumeUpdate");
static_assert(offsetof(SQEXSEADStatics_IsEnableAudioVolumeUpdate, ReturnValue) == 0x000000, "Member 'SQEXSEADStatics_IsEnableAudioVolumeUpdate::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.IsExistModeBGM
// 0x0018 (0x0018 - 0x0000)
struct SQEXSEADStatics_IsExistModeBGM final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ModeName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEXSEADStatics_IsExistModeBGM) == 0x000008, "Wrong alignment on SQEXSEADStatics_IsExistModeBGM");
static_assert(sizeof(SQEXSEADStatics_IsExistModeBGM) == 0x000018, "Wrong size on SQEXSEADStatics_IsExistModeBGM");
static_assert(offsetof(SQEXSEADStatics_IsExistModeBGM, Sound) == 0x000000, "Member 'SQEXSEADStatics_IsExistModeBGM::Sound' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_IsExistModeBGM, ModeName) == 0x000008, "Member 'SQEXSEADStatics_IsExistModeBGM::ModeName' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_IsExistModeBGM, ReturnValue) == 0x000010, "Member 'SQEXSEADStatics_IsExistModeBGM::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.IsExistSectionBGM
// 0x0018 (0x0018 - 0x0000)
struct SQEXSEADStatics_IsExistSectionBGM final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SectionName;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEXSEADStatics_IsExistSectionBGM) == 0x000008, "Wrong alignment on SQEXSEADStatics_IsExistSectionBGM");
static_assert(sizeof(SQEXSEADStatics_IsExistSectionBGM) == 0x000018, "Wrong size on SQEXSEADStatics_IsExistSectionBGM");
static_assert(offsetof(SQEXSEADStatics_IsExistSectionBGM, Sound) == 0x000000, "Member 'SQEXSEADStatics_IsExistSectionBGM::Sound' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_IsExistSectionBGM, SectionName) == 0x000008, "Member 'SQEXSEADStatics_IsExistSectionBGM::SectionName' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_IsExistSectionBGM, ReturnValue) == 0x000010, "Member 'SQEXSEADStatics_IsExistSectionBGM::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.IsExistSoundInBank
// 0x0018 (0x0018 - 0x0000)
struct SQEXSEADStatics_IsExistSoundInBank final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SoundName;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEXSEADStatics_IsExistSoundInBank) == 0x000008, "Wrong alignment on SQEXSEADStatics_IsExistSoundInBank");
static_assert(sizeof(SQEXSEADStatics_IsExistSoundInBank) == 0x000018, "Wrong size on SQEXSEADStatics_IsExistSoundInBank");
static_assert(offsetof(SQEXSEADStatics_IsExistSoundInBank, Sound) == 0x000000, "Member 'SQEXSEADStatics_IsExistSoundInBank::Sound' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_IsExistSoundInBank, SoundName) == 0x000008, "Member 'SQEXSEADStatics_IsExistSoundInBank::SoundName' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_IsExistSoundInBank, ReturnValue) == 0x000010, "Member 'SQEXSEADStatics_IsExistSoundInBank::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.IsPlayingBGM
// 0x0010 (0x0010 - 0x0000)
struct SQEXSEADStatics_IsPlayingBGM final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SQEXSEADStatics_IsPlayingBGM) == 0x000008, "Wrong alignment on SQEXSEADStatics_IsPlayingBGM");
static_assert(sizeof(SQEXSEADStatics_IsPlayingBGM) == 0x000010, "Wrong size on SQEXSEADStatics_IsPlayingBGM");
static_assert(offsetof(SQEXSEADStatics_IsPlayingBGM, Sound) == 0x000000, "Member 'SQEXSEADStatics_IsPlayingBGM::Sound' has a wrong offset!");
static_assert(offsetof(SQEXSEADStatics_IsPlayingBGM, ReturnValue) == 0x000008, "Member 'SQEXSEADStatics_IsPlayingBGM::ReturnValue' has a wrong offset!");

// Function SQEXSEAD.SQEXSEADStatics.PlaySound2D
// 0x0038 (0x0038 - 0x0000)
struct SQEXSEADStatics_PlaySound2D final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             Sound;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
