#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SQEXSEAD

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SQEXSEAD.ESQEXSEADChangeAutoSeEnableNotifyEndBehavior
// NumValues: 0x0004
enum class ESQEXSEADChangeAutoSeEnableNotifyEndBehavior : uint8
{
	RevertState                              = 0,
	SetInvertedState                         = 1,
	NoAction                                 = 2,
	ESQEXSEADChangeAutoSeEnableNotifyEndBehavior_MAX = 3,
};

// Enum SQEXSEAD.ESQEXSEADANPlayAutoSeSourceType
// NumValues: 0x0004
enum class ESQEXSEADANPlayAutoSeSourceType : uint8
{
	MotionSoundType                          = 0,
	AuxSurfaceTable                          = 1,
	SurfaceTableAsset                        = 2,
	ESQEXSEADANPlayAutoSeSourceType_MAX      = 3,
};

// Enum SQEXSEAD.ESQEXSEADAudioVolumeCommand
// NumValues: 0x0004
enum class ESQEXSEADAudioVolumeCommand : uint8
{
	None                                     = 0,
	Set                                      = 1,
	Reset                                    = 2,
	ESQEXSEADAudioVolumeCommand_MAX          = 3,
};

// Enum SQEXSEAD.ESQEXSEADAutoSeComponentAssetTableNonSurface
// NumValues: 0x000F
enum class ESQEXSEADAutoSeComponentAssetTableNonSurface : uint8
{
	RustleArm                                = 0,
	RustleFoot                               = 1,
	RustleFootCrotch                         = 2,
	RustleFootBend                           = 3,
	WingFlapUp                               = 4,
	WingFlapDown                             = 5,
	SwingKnock                               = 6,
	SwingRub                                 = 7,
	Turn                                     = 8,
	RustleHandWave                           = 9,
	HeadRot                                  = 10,
	Bow                                      = 11,
	RagdollBounce                            = 12,
	RagdollFricative                         = 13,
	MAX                                      = 14,
};

// Enum SQEXSEAD.ESQEXSEADAutoSeComponentAssetTablePerSurface
// NumValues: 0x0009
enum class ESQEXSEADAutoSeComponentAssetTablePerSurface : uint8
{
	Walk                                     = 0,
	Run                                      = 1,
	Jump                                     = 2,
	LandNormal                               = 3,
	LandHard                                 = 4,
	FootShuffle                              = 5,
	Stairs                                   = 6,
	WallTouch                                = 7,
	MAX                                      = 8,
};

// Enum SQEXSEAD.ESQEXSEADAutoSeResult
// NumValues: 0x0007
enum class ESQEXSEADAutoSeResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	Error_InvalidArgs                        = 100,
	Error_InvalidBoneName                    = 101,
	Error_NotAllSocketsValid                 = 102,
	Error_FailedToCreateProc                 = 103,
	ESQEXSEADAutoSeResult_MAX                = 104,
};

// Enum SQEXSEAD.ESQEXSEADAutoSePartsType
// NumValues: 0x0007
enum class ESQEXSEADAutoSePartsType : uint8
{
	Invalid                                  = 0,
	Foot                                     = 1,
	Arm                                      = 2,
	Wing                                     = 3,
	Swing                                    = 4,
	Body                                     = 5,
	ESQEXSEADAutoSePartsType_MAX             = 6,
};

// Enum SQEXSEAD.ESQEXSEADAutoSeMotionSoundType
// NumValues: 0x0018
enum class ESQEXSEADAutoSeMotionSoundType : uint8
{
	None                                     = 0,
	Walk                                     = 1,
	Run                                      = 2,
	Jump                                     = 3,
	LandNormal                               = 4,
	LandHard                                 = 5,
	FootShuffle                              = 6,
	Stairs                                   = 7,
	WallTouch                                = 8,
	RustleArm                                = 9,
	RustleFoot                               = 10,
	RustleFootCrotch                         = 11,
	RustleFootBend                           = 12,
	WingFlapUp                               = 13,
	WingFlapDown                             = 14,
	SwingKnock                               = 15,
	SwingRub                                 = 16,
	Turn                                     = 17,
	RustleHandWave                           = 18,
	HeadRot                                  = 19,
	Bow                                      = 20,
	RagdollBounce                            = 21,
	RagdollFricative                         = 22,
	ESQEXSEADAutoSeMotionSoundType_MAX       = 23,
};

// Enum SQEXSEAD.ESQEXSEAD_BGMStopBehaviour
// NumValues: 0x0005
enum class ESQEXSEAD_BGMStopBehaviour : uint8
{
	Stop                                     = 0,
	Unreference                              = 1,
	Reset                                    = 2,
	Ready                                    = 3,
	ESQEXSEAD_MAX                            = 4,
};

// Enum SQEXSEAD.ESQEXSEAD_BGMStoreBehaviour
// NumValues: 0x0005
enum class ESQEXSEAD_BGMStoreBehaviour : uint8
{
	Stop                                     = 0,
	AutoPlay                                 = 1,
	Suspend                                  = 2,
	AutoResume                               = 3,
	ESQEXSEAD_MAX                            = 4,
};

// Enum SQEXSEAD.ESQEXSEAD_BGMState
// NumValues: 0x0009
enum class ESQEXSEAD_BGMState : uint8
{
	Invalid                                  = 0,
	NotReady                                 = 1,
	Ready                                    = 2,
	AutoPlay                                 = 3,
	Playing                                  = 4,
	Stop                                     = 5,
	Suspended                                = 6,
	AutoResume                               = 7,
	ESQEXSEAD_MAX                            = 8,
};

// Enum SQEXSEAD.ESQEXSEADCategoryVolumeLayers
// NumValues: 0x0009
enum class ESQEXSEADCategoryVolumeLayers : uint8
{
	Debug                                    = 0,
	Game                                     = 1,
	Config                                   = 2,
	Movie                                    = 3,
	Level                                    = 4,
	Cut                                      = 5,
	Battle                                   = 6,
	_MAX                                     = 7,
	ESQEXSEADCategoryVolumeLayers_MAX        = 8,
};

// Enum SQEXSEAD.ESQEXSEADLayoutType
// NumValues: 0x000A
enum class ESQEXSEADLayoutType : uint8
{
	Point                                    = 0,
	Line                                     = 1,
	Box                                      = 2,
	Polyline                                 = 3,
	Quadrilateral                            = 4,
	TriangleStrip                            = 5,
	TriangleFan                              = 6,
	SphericalWedge                           = 7,
	CylindricalSector                        = 8,
	ESQEXSEADLayoutType_MAX                  = 9,
};

// Enum SQEXSEAD.ESQEXSEADENDCustomSoundTypes
// NumValues: 0x0003
enum class ESQEXSEADENDCustomSoundTypes : uint8
{
	Default                                  = 0,
	COM                                      = 1,
	ESQEXSEADENDCustomSoundTypes_MAX         = 2,
};

// Enum SQEXSEAD.ESQEXSEADRealTimeVoiceEffectTypes
// NumValues: 0x0004
enum class ESQEXSEADRealTimeVoiceEffectTypes : uint8
{
	None                                     = 0,
	COM                                      = 1,
	Mask                                     = 2,
	ESQEXSEADRealTimeVoiceEffectTypes_MAX    = 3,
};

// Enum SQEXSEAD.ESQEXSEADSoundOutputPorts
// NumValues: 0x0004
enum class ESQEXSEADSoundOutputPorts : uint8
{
	Auto                                     = 0,
	Main                                     = 1,
	Pad                                      = 2,
	ESQEXSEADSoundOutputPorts_MAX            = 3,
};

// Enum SQEXSEAD.ESQEXSEADSoundObjectObstructionState
// NumValues: 0x0005
enum class ESQEXSEADSoundObjectObstructionState : uint8
{
	None                                     = 0,
	Detour                                   = 1,
	Obstruction                              = 2,
	Skip                                     = 3,
	ESQEXSEADSoundObjectObstructionState_MAX = 4,
};

// Enum SQEXSEAD.ESQEXSEADSoundObjectType
// NumValues: 0x000A
enum class ESQEXSEADSoundObjectType : uint8
{
	Unknown                                  = 0,
	Dynamic                                  = 1,
	Ambient                                  = 2,
	Direction                                = 3,
	Point                                    = 4,
	Polygon                                  = 5,
	CylindricalSector                        = 6,
	ShphericalEdge                           = 7,
	ObstPolygon                              = 8,
	ESQEXSEADSoundObjectType_MAX             = 9,
};

// Enum SQEXSEAD.ESQEXSEADSoundState
// NumValues: 0x0006
enum class ESQEXSEADSoundState : uint8
{
	Invalid                                  = 0,
	Ready                                    = 1,
	Playing                                  = 2,
	Paused                                   = 3,
	Unknown                                  = 4,
	ESQEXSEADSoundState_MAX                  = 5,
};

// Enum SQEXSEAD.ESQEXSEADAudioStartTimings
// NumValues: 0x0004
enum class ESQEXSEADAudioStartTimings : uint8
{
	None                                     = 0,
	OnBeginPlay                              = 1,
	OnZeroOneValueVariable                   = 2,
	ESQEXSEADAudioStartTimings_MAX           = 3,
};

// Enum SQEXSEAD.ESQEXSEADZeroOneProperties
// NumValues: 0x0004
enum class ESQEXSEADZeroOneProperties : uint8
{
	None                                     = 0,
	Velocity                                 = 1,
	RotationalVelocity                       = 2,
	ESQEXSEADZeroOneProperties_MAX           = 3,
};

// ScriptStruct SQEXSEAD.SQEXSEADAnimNotifyPlayAutoSeParams
// 0x0028 (0x0028 - 0x0000)
struct FSQEXSEADAnimNotifyPlayAutoSeParams final
{
public:
	ESQEXSEADANPlayAutoSeSourceType               SourceType;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEXSEADAutoSeMotionSoundType                MotionSoundType;                                   // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USQEXSEADSurfaceAssetReferenceTable*    SurfaceAssetPathTable;                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SurfaceAssetTableRecordName;                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEXSEADAutoSePartsType                      AutoSePartsType;                                   // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         AutoSePartsIndex;                                  // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCheckIsGrounded : 1;                              // 0x001A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAttachToParts : 1;                                // 0x001A(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SoundVolume;                                       // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SoundPitchMultiplier;                              // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSQEXSEADAnimNotifyPlayAutoSeParams) == 0x000008, "Wrong alignment on FSQEXSEADAnimNotifyPlayAutoSeParams");
static_assert(sizeof(FSQEXSEADAnimNotifyPlayAutoSeParams) == 0x000028, "Wrong size on FSQEXSEADAnimNotifyPlayAutoSeParams");
static_assert(offsetof(FSQEXSEADAnimNotifyPlayAutoSeParams, SourceType) == 0x000000, "Member 'FSQEXSEADAnimNotifyPlayAutoSeParams::SourceType' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAnimNotifyPlayAutoSeParams, MotionSoundType) == 0x000001, "Member 'FSQEXSEADAnimNotifyPlayAutoSeParams::MotionSoundType' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAnimNotifyPlayAutoSeParams, SurfaceAssetPathTable) == 0x000008, "Member 'FSQEXSEADAnimNotifyPlayAutoSeParams::SurfaceAssetPathTable' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAnimNotifyPlayAutoSeParams, SurfaceAssetTableRecordName) == 0x000010, "Member 'FSQEXSEADAnimNotifyPlayAutoSeParams::SurfaceAssetTableRecordName' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAnimNotifyPlayAutoSeParams, AutoSePartsType) == 0x000018, "Member 'FSQEXSEADAnimNotifyPlayAutoSeParams::AutoSePartsType' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAnimNotifyPlayAutoSeParams, AutoSePartsIndex) == 0x000019, "Member 'FSQEXSEADAnimNotifyPlayAutoSeParams::AutoSePartsIndex' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAnimNotifyPlayAutoSeParams, SoundVolume) == 0x00001C, "Member 'FSQEXSEADAnimNotifyPlayAutoSeParams::SoundVolume' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAnimNotifyPlayAutoSeParams, SoundPitchMultiplier) == 0x000020, "Member 'FSQEXSEADAnimNotifyPlayAutoSeParams::SoundPitchMultiplier' has a wrong offset!");

// ScriptStruct SQEXSEAD.SQEXSEADAudioVolumeEvent
// 0x0018 (0x0018 - 0x0000)
struct FSQEXSEADAudioVolumeEvent final
{
public:
	ESQEXSEADAudioVolumeCommand                   Command;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ExteriorAudioVolumeSoundOcclusionVolume;           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExteriorAudioVolumeSoundOcclusionLPF;              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObstructionVolume;                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObstructionLPF;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeTime;                                          // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSQEXSEADAudioVolumeEvent) == 0x000004, "Wrong alignment on FSQEXSEADAudioVolumeEvent");
static_assert(sizeof(FSQEXSEADAudioVolumeEvent) == 0x000018, "Wrong size on FSQEXSEADAudioVolumeEvent");
static_assert(offsetof(FSQEXSEADAudioVolumeEvent, Command) == 0x000000, "Member 'FSQEXSEADAudioVolumeEvent::Command' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAudioVolumeEvent, ExteriorAudioVolumeSoundOcclusionVolume) == 0x000004, "Member 'FSQEXSEADAudioVolumeEvent::ExteriorAudioVolumeSoundOcclusionVolume' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAudioVolumeEvent, ExteriorAudioVolumeSoundOcclusionLPF) == 0x000008, "Member 'FSQEXSEADAudioVolumeEvent::ExteriorAudioVolumeSoundOcclusionLPF' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAudioVolumeEvent, ObstructionVolume) == 0x00000C, "Member 'FSQEXSEADAudioVolumeEvent::ObstructionVolume' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAudioVolumeEvent, ObstructionLPF) == 0x000010, "Member 'FSQEXSEADAudioVolumeEvent::ObstructionLPF' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAudioVolumeEvent, FadeTime) == 0x000014, "Member 'FSQEXSEADAudioVolumeEvent::FadeTime' has a wrong offset!");

// ScriptStruct SQEXSEAD.SQEXSEADAutoSeMotionSoundFilter
// 0x0003 (0x0003 - 0x0000)
struct FSQEXSEADAutoSeMotionSoundFilter final
{
public:
	uint8                                         bMSFilterFlag_FootStep : 1;                        // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_FootShuffle : 1;                     // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_Jump : 1;                            // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_Land : 1;                            // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_RustleArm : 1;                       // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_RustleHandWave : 1;                  // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_RustleFoot : 1;                      // 0x0000(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_RustleFootCrotch : 1;                // 0x0000(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_RustleFootBend : 1;                  // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_WingFlap : 1;                        // 0x0001(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_Turn : 1;                            // 0x0001(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_Bow : 1;                             // 0x0001(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_HeadRot : 1;                         // 0x0001(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_SwingKnock : 1;                      // 0x0001(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_SwingRub : 1;                        // 0x0001(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_RagdollBounce : 1;                   // 0x0001(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMSFilterFlag_RagdollFricative : 1;                // 0x0002(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
};
static_assert(alignof(FSQEXSEADAutoSeMotionSoundFilter) == 0x000001, "Wrong alignment on FSQEXSEADAutoSeMotionSoundFilter");
static_assert(sizeof(FSQEXSEADAutoSeMotionSoundFilter) == 0x000003, "Wrong size on FSQEXSEADAutoSeMotionSoundFilter");

// ScriptStruct SQEXSEAD.SQEXSEADAutoSeProcessorLODLevelSettings
// 0x0003 (0x0003 - 0x0000)
struct FSQEXSEADAutoSeProcessorLODLevelSettings final
{
public:
	struct FSQEXSEADAutoSeMotionSoundFilter       SoundFilter;                                       // 0x0000(0x0003)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSQEXSEADAutoSeProcessorLODLevelSettings) == 0x000001, "Wrong alignment on FSQEXSEADAutoSeProcessorLODLevelSettings");
static_assert(sizeof(FSQEXSEADAutoSeProcessorLODLevelSettings) == 0x000003, "Wrong size on FSQEXSEADAutoSeProcessorLODLevelSettings");
static_assert(offsetof(FSQEXSEADAutoSeProcessorLODLevelSettings, SoundFilter) == 0x000000, "Member 'FSQEXSEADAutoSeProcessorLODLevelSettings::SoundFilter' has a wrong offset!");

// ScriptStruct SQEXSEAD.SQEXSEADAutoSeAnalyzerSetting
// 0x001C (0x001C - 0x0000)
struct FSQEXSEADAutoSeAnalyzerSetting final
{
public:
	bool                                          bOverrideAssumeFootMotionlessMoveLenInWorld;       // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AssumeFootMotionlessMoveLenInWorld;                // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideAssumeBodyRunngingVelocity;               // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AssumeBodyRunngingVelocity;                        // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideAutoCalcFootGroundedThresholdRatio;       // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AutoCalcFootGroundedThresholdRatio;                // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoWarpDetectionEnable;                          // 0x0018(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSQEXSEADAutoSeAnalyzerSetting) == 0x000004, "Wrong alignment on FSQEXSEADAutoSeAnalyzerSetting");
static_assert(sizeof(FSQEXSEADAutoSeAnalyzerSetting) == 0x00001C, "Wrong size on FSQEXSEADAutoSeAnalyzerSetting");
static_assert(offsetof(FSQEXSEADAutoSeAnalyzerSetting, bOverrideAssumeFootMotionlessMoveLenInWorld) == 0x000000, "Member 'FSQEXSEADAutoSeAnalyzerSetting::bOverrideAssumeFootMotionlessMoveLenInWorld' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeAnalyzerSetting, AssumeFootMotionlessMoveLenInWorld) == 0x000004, "Member 'FSQEXSEADAutoSeAnalyzerSetting::AssumeFootMotionlessMoveLenInWorld' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeAnalyzerSetting, bOverrideAssumeBodyRunngingVelocity) == 0x000008, "Member 'FSQEXSEADAutoSeAnalyzerSetting::bOverrideAssumeBodyRunngingVelocity' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeAnalyzerSetting, AssumeBodyRunngingVelocity) == 0x00000C, "Member 'FSQEXSEADAutoSeAnalyzerSetting::AssumeBodyRunngingVelocity' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeAnalyzerSetting, bOverrideAutoCalcFootGroundedThresholdRatio) == 0x000010, "Member 'FSQEXSEADAutoSeAnalyzerSetting::bOverrideAutoCalcFootGroundedThresholdRatio' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeAnalyzerSetting, AutoCalcFootGroundedThresholdRatio) == 0x000014, "Member 'FSQEXSEADAutoSeAnalyzerSetting::AutoCalcFootGroundedThresholdRatio' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeAnalyzerSetting, bAutoWarpDetectionEnable) == 0x000018, "Member 'FSQEXSEADAutoSeAnalyzerSetting::bAutoWarpDetectionEnable' has a wrong offset!");

// ScriptStruct SQEXSEAD.SQEXSEADAutoSeDetectorSettingFootStep
// 0x007C (0x007C - 0x0000)
struct FSQEXSEADAutoSeDetectorSettingFootStep final
{
public:
	bool                                          bEnableFootStepWalkRun;                            // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideFootStepParameters;                       // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FootStepWalkVolumeRangeMin;                        // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootStepWalkVolumeRangeMax;                        // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootStepRunVolumeRangeMin;                         // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootStepRunVolumeRangeMax;                         // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootStepKEnergyVolumeRangeMin;                     // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootStepKEnergyVolumeRangeMax;                     // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFootShuffle;                                // 0x001C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideFootShuffleParameters;                    // 0x001D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFootShuffleLessMove;                        // 0x001E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FootShuffleAssumeBodyStopVelocityThreshold;        // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootShuffleDetectFootVelocityThreshold;            // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootShuffleVolumeRangeMin;                         // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootShuffleVolumeRangeMax;                         // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFootShuffleInMotion;                        // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FootShuffleInMotionFootAccelThreshold;             // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootShuffleInMotionVolumeRangeMin;                 // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootShuffleInMotionVolumeRangeMax;                 // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFootShuffleTurn;                            // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FootShuffleTurnMoveDirRotVelocityRateThreshold;    // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootShuffleTurnFootVelocityThreshold;              // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootShuffleTurnVolumeRangeMin;                     // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootShuffleTurnVolumeRangeMax;                     // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideLandNormalParameters;                     // 0x0054(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableLandAlgoCheckOnlyCharaGrounded;             // 0x0055(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LandNormalAssumeFlyTime;                           // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LandNormalEnoughVelocity;                          // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LandNormalVolumeRangeMin;                          // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LandNormalVolumeRangeMax;                          // 0x0064(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableLandHard;                                   // 0x0068(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideLandHardParameters;                       // 0x0069(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LandHardAssumeFlyTime;                             // 0x006C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LandHardEnoughVelocity;                            // 0x0070(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LandHardVolumeRangeMin;                            // 0x0074(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LandHardVolumeRangeMax;                            // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSQEXSEADAutoSeDetectorSettingFootStep) == 0x000004, "Wrong alignment on FSQEXSEADAutoSeDetectorSettingFootStep");
static_assert(sizeof(FSQEXSEADAutoSeDetectorSettingFootStep) == 0x00007C, "Wrong size on FSQEXSEADAutoSeDetectorSettingFootStep");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, bEnableFootStepWalkRun) == 0x000000, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::bEnableFootStepWalkRun' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, bOverrideFootStepParameters) == 0x000001, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::bOverrideFootStepParameters' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootStepWalkVolumeRangeMin) == 0x000004, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootStepWalkVolumeRangeMin' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootStepWalkVolumeRangeMax) == 0x000008, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootStepWalkVolumeRangeMax' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootStepRunVolumeRangeMin) == 0x00000C, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootStepRunVolumeRangeMin' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootStepRunVolumeRangeMax) == 0x000010, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootStepRunVolumeRangeMax' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootStepKEnergyVolumeRangeMin) == 0x000014, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootStepKEnergyVolumeRangeMin' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootStepKEnergyVolumeRangeMax) == 0x000018, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootStepKEnergyVolumeRangeMax' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, bEnableFootShuffle) == 0x00001C, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::bEnableFootShuffle' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, bOverrideFootShuffleParameters) == 0x00001D, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::bOverrideFootShuffleParameters' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, bEnableFootShuffleLessMove) == 0x00001E, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::bEnableFootShuffleLessMove' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootShuffleAssumeBodyStopVelocityThreshold) == 0x000020, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootShuffleAssumeBodyStopVelocityThreshold' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootShuffleDetectFootVelocityThreshold) == 0x000024, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootShuffleDetectFootVelocityThreshold' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootShuffleVolumeRangeMin) == 0x000028, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootShuffleVolumeRangeMin' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootShuffleVolumeRangeMax) == 0x00002C, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootShuffleVolumeRangeMax' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, bEnableFootShuffleInMotion) == 0x000030, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::bEnableFootShuffleInMotion' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootShuffleInMotionFootAccelThreshold) == 0x000034, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootShuffleInMotionFootAccelThreshold' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootShuffleInMotionVolumeRangeMin) == 0x000038, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootShuffleInMotionVolumeRangeMin' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootShuffleInMotionVolumeRangeMax) == 0x00003C, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootShuffleInMotionVolumeRangeMax' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, bEnableFootShuffleTurn) == 0x000040, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::bEnableFootShuffleTurn' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootShuffleTurnMoveDirRotVelocityRateThreshold) == 0x000044, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootShuffleTurnMoveDirRotVelocityRateThreshold' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootShuffleTurnFootVelocityThreshold) == 0x000048, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootShuffleTurnFootVelocityThreshold' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootShuffleTurnVolumeRangeMin) == 0x00004C, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootShuffleTurnVolumeRangeMin' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, FootShuffleTurnVolumeRangeMax) == 0x000050, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::FootShuffleTurnVolumeRangeMax' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, bOverrideLandNormalParameters) == 0x000054, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::bOverrideLandNormalParameters' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, bEnableLandAlgoCheckOnlyCharaGrounded) == 0x000055, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::bEnableLandAlgoCheckOnlyCharaGrounded' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, LandNormalAssumeFlyTime) == 0x000058, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::LandNormalAssumeFlyTime' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, LandNormalEnoughVelocity) == 0x00005C, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::LandNormalEnoughVelocity' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, LandNormalVolumeRangeMin) == 0x000060, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::LandNormalVolumeRangeMin' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, LandNormalVolumeRangeMax) == 0x000064, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::LandNormalVolumeRangeMax' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, bEnableLandHard) == 0x000068, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::bEnableLandHard' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, bOverrideLandHardParameters) == 0x000069, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::bOverrideLandHardParameters' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, LandHardAssumeFlyTime) == 0x00006C, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::LandHardAssumeFlyTime' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, LandHardEnoughVelocity) == 0x000070, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::LandHardEnoughVelocity' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, LandHardVolumeRangeMin) == 0x000074, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::LandHardVolumeRangeMin' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingFootStep, LandHardVolumeRangeMax) == 0x000078, "Member 'FSQEXSEADAutoSeDetectorSettingFootStep::LandHardVolumeRangeMax' has a wrong offset!");

// ScriptStruct SQEXSEAD.SQEXSEADAutoSeDetectorSettingRustle
// 0x0064 (0x0064 - 0x0000)
struct FSQEXSEADAutoSeDetectorSettingRustle final
{
public:
	bool                                          bEnableArmRustleElbow;                             // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideArmRustleElbowVolumeRanges;               // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ArmRustleElbowRVelThreshold;                       // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ArmRustleElbowRelativeVelocityVolumeRangeMin;      // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ArmRustleElbowRelativeVelocityVolumeRangeMax;      // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableArmRustleHandWave;                          // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideArmRustleHandWaveParameters;              // 0x0011(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ArmRustleHandWaveRVelThreshold;                    // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ArmRustleHandWaveVolumeRangeMin;                   // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ArmRustleHandWaveVolumeRangeMax;                   // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFootRustleCrotch;                           // 0x0020(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideFootRustleCrotchParameters;               // 0x0021(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FootRustleCrotchFTRelVelThresholdWalk;             // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootRustleCrotchFTRelVelThresholdRun;              // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootRustleCrotchVolumeRangeMin;                    // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootRustleCrotchVolumeRangeMax;                    // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFootRustle;                                 // 0x0034(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideFootRustleParameters;                     // 0x0035(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FootRustleRVelThresholdWalk;                       // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootRustleRVelThresholdRun;                        // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootRustleVolumeRangeMin;                          // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootRustleVolumeRangeMax;                          // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFootRustleBend;                             // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideFootRustleBendParameters;                 // 0x0049(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FootRustleBendBendThreshold;                       // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootRustleBendStretchThreshold;                    // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootRustleBendVolumeRangeMin;                      // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootRustleBendVolumeRangeMax;                      // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DetectionSuppressTimeDefault;                      // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DetectionSuppressTimeForFast;                      // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSQEXSEADAutoSeDetectorSettingRustle) == 0x000004, "Wrong alignment on FSQEXSEADAutoSeDetectorSettingRustle");
static_assert(sizeof(FSQEXSEADAutoSeDetectorSettingRustle) == 0x000064, "Wrong size on FSQEXSEADAutoSeDetectorSettingRustle");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, bEnableArmRustleElbow) == 0x000000, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::bEnableArmRustleElbow' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, bOverrideArmRustleElbowVolumeRanges) == 0x000001, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::bOverrideArmRustleElbowVolumeRanges' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, ArmRustleElbowRVelThreshold) == 0x000004, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::ArmRustleElbowRVelThreshold' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, ArmRustleElbowRelativeVelocityVolumeRangeMin) == 0x000008, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::ArmRustleElbowRelativeVelocityVolumeRangeMin' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, ArmRustleElbowRelativeVelocityVolumeRangeMax) == 0x00000C, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::ArmRustleElbowRelativeVelocityVolumeRangeMax' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, bEnableArmRustleHandWave) == 0x000010, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::bEnableArmRustleHandWave' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, bOverrideArmRustleHandWaveParameters) == 0x000011, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::bOverrideArmRustleHandWaveParameters' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, ArmRustleHandWaveRVelThreshold) == 0x000014, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::ArmRustleHandWaveRVelThreshold' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, ArmRustleHandWaveVolumeRangeMin) == 0x000018, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::ArmRustleHandWaveVolumeRangeMin' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, ArmRustleHandWaveVolumeRangeMax) == 0x00001C, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::ArmRustleHandWaveVolumeRangeMax' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, bEnableFootRustleCrotch) == 0x000020, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::bEnableFootRustleCrotch' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, bOverrideFootRustleCrotchParameters) == 0x000021, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::bOverrideFootRustleCrotchParameters' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, FootRustleCrotchFTRelVelThresholdWalk) == 0x000024, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::FootRustleCrotchFTRelVelThresholdWalk' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, FootRustleCrotchFTRelVelThresholdRun) == 0x000028, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::FootRustleCrotchFTRelVelThresholdRun' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, FootRustleCrotchVolumeRangeMin) == 0x00002C, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::FootRustleCrotchVolumeRangeMin' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, FootRustleCrotchVolumeRangeMax) == 0x000030, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::FootRustleCrotchVolumeRangeMax' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, bEnableFootRustle) == 0x000034, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::bEnableFootRustle' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, bOverrideFootRustleParameters) == 0x000035, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::bOverrideFootRustleParameters' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, FootRustleRVelThresholdWalk) == 0x000038, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::FootRustleRVelThresholdWalk' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, FootRustleRVelThresholdRun) == 0x00003C, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::FootRustleRVelThresholdRun' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, FootRustleVolumeRangeMin) == 0x000040, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::FootRustleVolumeRangeMin' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, FootRustleVolumeRangeMax) == 0x000044, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::FootRustleVolumeRangeMax' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, bEnableFootRustleBend) == 0x000048, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::bEnableFootRustleBend' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, bOverrideFootRustleBendParameters) == 0x000049, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::bOverrideFootRustleBendParameters' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, FootRustleBendBendThreshold) == 0x00004C, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::FootRustleBendBendThreshold' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, FootRustleBendStretchThreshold) == 0x000050, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::FootRustleBendStretchThreshold' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, FootRustleBendVolumeRangeMin) == 0x000054, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::FootRustleBendVolumeRangeMin' has a wrong offset!");
static_assert(offsetof(FSQEXSEADAutoSeDetectorSettingRustle, FootRustleBendVolumeRangeMax) == 0x000058, "Member 'FSQEXSEADAutoSeDetectorSettingRustle::FootRustleBendVolumeRangeMax' has a wrong offset!");
