#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SQEXSEAD

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "SQEXSEAD_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SQEXSEAD.SQEXSEADAudioVolume
// 0x01B0 (0x0410 - 0x0260)
class ASQEXSEADAudioVolume final : public AVolume
{
public:
	class USQEXSEADVolumeComponent*               VolumeComponent;                                   // 0x0260(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnabled : 1;                                      // 0x0268(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EffectPresetNumber;                                // 0x026C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EffectFadeTime;                                    // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound;                                             // 0x0278(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SoundName;                                         // 0x0280(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SoundVolume;                                       // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SoundFadeInTime;                                   // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SoundFadeInCurveNumber;                            // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SoundFadeOutTime;                                  // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SoundFadeOutCurveNumber;                           // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOccludeExteriorAudioVolumeSounds : 1;             // 0x029C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AudioVolumeSoundOcclusionVolume;                   // 0x02A0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AudioVolumeSoundOcclusionLPF;                      // 0x02A4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AudioVolumeSoundOcclusionFadeInTime;               // 0x02A8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AudioVolumeSoundOcclusionFadeOutTime;              // 0x02AC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AudioVolumeSoundOcclusionLPFFadeInTime;            // 0x02B0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AudioVolumeSoundOcclusionLPFFadeOutTime;           // 0x02B4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableUnoccludedObstruction : 1;                  // 0x02B8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ObstructionVolume;                                 // 0x02BC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObstructionLPF;                                    // 0x02C0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InternalObstructionVolume;                         // 0x02C4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InternalObstructionLPF;                            // 0x02C8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObstructionFadeTime;                               // 0x02CC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Priority;                                          // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseObstructionParamsSeparatePriority : 1;         // 0x02D4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ObstructionParamsSeparatePriority;                 // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GroupingID;                                        // 0x02DC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      OverridingAttenuationSettings;                     // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FSQEXSEADAudioVolumeEvent> AudioVolumeEvents;                                 // 0x02E8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         bUseEncompass : 1;                                 // 0x0338(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSyncActorHidden : 1;                              // 0x0338(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_339[0xD7];                                     // 0x0339(0x00D7)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAudioVolume">();
	}
	static class ASQEXSEADAudioVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASQEXSEADAudioVolume>();
	}
};
static_assert(alignof(ASQEXSEADAudioVolume) == 0x000008, "Wrong alignment on ASQEXSEADAudioVolume");
static_assert(sizeof(ASQEXSEADAudioVolume) == 0x000410, "Wrong size on ASQEXSEADAudioVolume");
static_assert(offsetof(ASQEXSEADAudioVolume, VolumeComponent) == 0x000260, "Member 'ASQEXSEADAudioVolume::VolumeComponent' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, EffectPresetNumber) == 0x00026C, "Member 'ASQEXSEADAudioVolume::EffectPresetNumber' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, EffectFadeTime) == 0x000270, "Member 'ASQEXSEADAudioVolume::EffectFadeTime' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, Sound) == 0x000278, "Member 'ASQEXSEADAudioVolume::Sound' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, SoundName) == 0x000280, "Member 'ASQEXSEADAudioVolume::SoundName' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, SoundVolume) == 0x000288, "Member 'ASQEXSEADAudioVolume::SoundVolume' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, SoundFadeInTime) == 0x00028C, "Member 'ASQEXSEADAudioVolume::SoundFadeInTime' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, SoundFadeInCurveNumber) == 0x000290, "Member 'ASQEXSEADAudioVolume::SoundFadeInCurveNumber' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, SoundFadeOutTime) == 0x000294, "Member 'ASQEXSEADAudioVolume::SoundFadeOutTime' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, SoundFadeOutCurveNumber) == 0x000298, "Member 'ASQEXSEADAudioVolume::SoundFadeOutCurveNumber' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, AudioVolumeSoundOcclusionVolume) == 0x0002A0, "Member 'ASQEXSEADAudioVolume::AudioVolumeSoundOcclusionVolume' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, AudioVolumeSoundOcclusionLPF) == 0x0002A4, "Member 'ASQEXSEADAudioVolume::AudioVolumeSoundOcclusionLPF' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, AudioVolumeSoundOcclusionFadeInTime) == 0x0002A8, "Member 'ASQEXSEADAudioVolume::AudioVolumeSoundOcclusionFadeInTime' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, AudioVolumeSoundOcclusionFadeOutTime) == 0x0002AC, "Member 'ASQEXSEADAudioVolume::AudioVolumeSoundOcclusionFadeOutTime' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, AudioVolumeSoundOcclusionLPFFadeInTime) == 0x0002B0, "Member 'ASQEXSEADAudioVolume::AudioVolumeSoundOcclusionLPFFadeInTime' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, AudioVolumeSoundOcclusionLPFFadeOutTime) == 0x0002B4, "Member 'ASQEXSEADAudioVolume::AudioVolumeSoundOcclusionLPFFadeOutTime' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, ObstructionVolume) == 0x0002BC, "Member 'ASQEXSEADAudioVolume::ObstructionVolume' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, ObstructionLPF) == 0x0002C0, "Member 'ASQEXSEADAudioVolume::ObstructionLPF' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, InternalObstructionVolume) == 0x0002C4, "Member 'ASQEXSEADAudioVolume::InternalObstructionVolume' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, InternalObstructionLPF) == 0x0002C8, "Member 'ASQEXSEADAudioVolume::InternalObstructionLPF' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, ObstructionFadeTime) == 0x0002CC, "Member 'ASQEXSEADAudioVolume::ObstructionFadeTime' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, Priority) == 0x0002D0, "Member 'ASQEXSEADAudioVolume::Priority' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, ObstructionParamsSeparatePriority) == 0x0002D8, "Member 'ASQEXSEADAudioVolume::ObstructionParamsSeparatePriority' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, GroupingID) == 0x0002DC, "Member 'ASQEXSEADAudioVolume::GroupingID' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, OverridingAttenuationSettings) == 0x0002E0, "Member 'ASQEXSEADAudioVolume::OverridingAttenuationSettings' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, AudioVolumeEvents) == 0x0002E8, "Member 'ASQEXSEADAudioVolume::AudioVolumeEvents' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAnimNotify_PlayAutoSe
// 0x0028 (0x0060 - 0x0038)
class USQEXSEADAnimNotify_PlayAutoSe final : public UAnimNotify
{
public:
	struct FSQEXSEADAnimNotifyPlayAutoSeParams    PlaySettings;                                      // 0x0038(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAnimNotify_PlayAutoSe">();
	}
	static class USQEXSEADAnimNotify_PlayAutoSe* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAnimNotify_PlayAutoSe>();
	}
};
static_assert(alignof(USQEXSEADAnimNotify_PlayAutoSe) == 0x000008, "Wrong alignment on USQEXSEADAnimNotify_PlayAutoSe");
static_assert(sizeof(USQEXSEADAnimNotify_PlayAutoSe) == 0x000060, "Wrong size on USQEXSEADAnimNotify_PlayAutoSe");
static_assert(offsetof(USQEXSEADAnimNotify_PlayAutoSe, PlaySettings) == 0x000038, "Member 'USQEXSEADAnimNotify_PlayAutoSe::PlaySettings' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAutoSeComponentSetting
// 0x0068 (0x0098 - 0x0030)
class USQEXSEADAutoSeComponentSetting final : public UDataAsset
{
public:
	struct FSQEXSEADAutoSeComponentInitParams     InitParams;                                        // 0x0030(0x0068)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAutoSeComponentSetting">();
	}
	static class USQEXSEADAutoSeComponentSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAutoSeComponentSetting>();
	}
};
static_assert(alignof(USQEXSEADAutoSeComponentSetting) == 0x000008, "Wrong alignment on USQEXSEADAutoSeComponentSetting");
static_assert(sizeof(USQEXSEADAutoSeComponentSetting) == 0x000098, "Wrong size on USQEXSEADAutoSeComponentSetting");
static_assert(offsetof(USQEXSEADAutoSeComponentSetting, InitParams) == 0x000030, "Member 'USQEXSEADAutoSeComponentSetting::InitParams' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAnimNotifyState_PlayAutoSe
// 0x0080 (0x00B0 - 0x0030)
class USQEXSEADAnimNotifyState_PlayAutoSe final : public UAnimNotifyState
{
public:
	struct FSQEXSEADAnimNotifyPlayAutoSeParams    PlaySettings;                                      // 0x0030(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	float                                         FadeOutDuration;                                   // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x54];                                      // 0x005C(0x0054)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAnimNotifyState_PlayAutoSe">();
	}
	static class USQEXSEADAnimNotifyState_PlayAutoSe* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAnimNotifyState_PlayAutoSe>();
	}
};
static_assert(alignof(USQEXSEADAnimNotifyState_PlayAutoSe) == 0x000008, "Wrong alignment on USQEXSEADAnimNotifyState_PlayAutoSe");
static_assert(sizeof(USQEXSEADAnimNotifyState_PlayAutoSe) == 0x0000B0, "Wrong size on USQEXSEADAnimNotifyState_PlayAutoSe");
static_assert(offsetof(USQEXSEADAnimNotifyState_PlayAutoSe, PlaySettings) == 0x000030, "Member 'USQEXSEADAnimNotifyState_PlayAutoSe::PlaySettings' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotifyState_PlayAutoSe, FadeOutDuration) == 0x000058, "Member 'USQEXSEADAnimNotifyState_PlayAutoSe::FadeOutDuration' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAutoSeDetectionSetting
// 0x0330 (0x0360 - 0x0030)
class USQEXSEADAutoSeDetectionSetting final : public UDataAsset
{
public:
	struct FSQEXSEADAutoSeDetectorSettings        Settings;                                          // 0x0030(0x0190)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FSQEXSEADAutoSeDetectorSettings        SettingsForMOMode;                                 // 0x01C0(0x0190)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseAnalyzerSettingForMotionOnlyMode;              // 0x0350(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDistanceClippingEnable;                           // 0x0351(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ClippingDistance;                                  // 0x0354(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFollowMeshVisibility;                             // 0x0358(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceDetectListenerTeleportRuntime;               // 0x0359(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAutoSeDetectionSetting">();
	}
	static class USQEXSEADAutoSeDetectionSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAutoSeDetectionSetting>();
	}
};
static_assert(alignof(USQEXSEADAutoSeDetectionSetting) == 0x000008, "Wrong alignment on USQEXSEADAutoSeDetectionSetting");
static_assert(sizeof(USQEXSEADAutoSeDetectionSetting) == 0x000360, "Wrong size on USQEXSEADAutoSeDetectionSetting");
static_assert(offsetof(USQEXSEADAutoSeDetectionSetting, Settings) == 0x000030, "Member 'USQEXSEADAutoSeDetectionSetting::Settings' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeDetectionSetting, SettingsForMOMode) == 0x0001C0, "Member 'USQEXSEADAutoSeDetectionSetting::SettingsForMOMode' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeDetectionSetting, bUseAnalyzerSettingForMotionOnlyMode) == 0x000350, "Member 'USQEXSEADAutoSeDetectionSetting::bUseAnalyzerSettingForMotionOnlyMode' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeDetectionSetting, bDistanceClippingEnable) == 0x000351, "Member 'USQEXSEADAutoSeDetectionSetting::bDistanceClippingEnable' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeDetectionSetting, ClippingDistance) == 0x000354, "Member 'USQEXSEADAutoSeDetectionSetting::ClippingDistance' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeDetectionSetting, bFollowMeshVisibility) == 0x000358, "Member 'USQEXSEADAutoSeDetectionSetting::bFollowMeshVisibility' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeDetectionSetting, bForceDetectListenerTeleportRuntime) == 0x000359, "Member 'USQEXSEADAutoSeDetectionSetting::bForceDetectListenerTeleportRuntime' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAnimNotifyState_ChangeAutoSeEnable
// 0x0058 (0x0088 - 0x0030)
class USQEXSEADAnimNotifyState_ChangeAutoSeEnable final : public UAnimNotifyState
{
public:
	uint8                                         bEnableAutoSeEnableParameters : 1;                 // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableSetting : 1;                                // 0x0030(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	ESQEXSEADChangeAutoSeEnableNotifyEndBehavior  NotifyEndBehavior;                                 // 0x0031(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableContinuousDisabling : 1;                    // 0x0032(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableMotionDetectFilters : 1;                    // 0x0032(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMotionDetectFilterAsGlobal : 1;                   // 0x0032(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	struct FSQEXSEADAutoSeMotionSoundFilter       MSFilter;                                          // 0x0033(0x0003)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x52];                                      // 0x0036(0x0052)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAnimNotifyState_ChangeAutoSeEnable">();
	}
	static class USQEXSEADAnimNotifyState_ChangeAutoSeEnable* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAnimNotifyState_ChangeAutoSeEnable>();
	}
};
static_assert(alignof(USQEXSEADAnimNotifyState_ChangeAutoSeEnable) == 0x000008, "Wrong alignment on USQEXSEADAnimNotifyState_ChangeAutoSeEnable");
static_assert(sizeof(USQEXSEADAnimNotifyState_ChangeAutoSeEnable) == 0x000088, "Wrong size on USQEXSEADAnimNotifyState_ChangeAutoSeEnable");
static_assert(offsetof(USQEXSEADAnimNotifyState_ChangeAutoSeEnable, NotifyEndBehavior) == 0x000031, "Member 'USQEXSEADAnimNotifyState_ChangeAutoSeEnable::NotifyEndBehavior' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotifyState_ChangeAutoSeEnable, MSFilter) == 0x000033, "Member 'USQEXSEADAnimNotifyState_ChangeAutoSeEnable::MSFilter' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAudioComponent
// 0x0020 (0x0890 - 0x0870)
class USQEXSEADAudioComponent : public UAudioComponent
{
public:
	uint8                                         Pad_870[0x20];                                     // 0x0870(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetPlaybackTimePercent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAudioComponent">();
	}
	static class USQEXSEADAudioComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAudioComponent>();
	}
};
static_assert(alignof(USQEXSEADAudioComponent) == 0x000010, "Wrong alignment on USQEXSEADAudioComponent");
static_assert(sizeof(USQEXSEADAudioComponent) == 0x000890, "Wrong size on USQEXSEADAudioComponent");

// Class SQEXSEAD.SQEXSEADAutoSeComponentAssetTable
// 0x30A0 (0x30D0 - 0x0030)
class USQEXSEADAutoSeComponentAssetTable final : public UDataAsset
{
public:
	struct FSQEXSEADAutoSeComponentAssetTablePerSurface PerSurfaceInfos[0x3F];                             // 0x0030(0x00C0)(Edit, NativeAccessSpecifierPublic)
	struct FSQEXSEADAutoSeComponentAssetTableNonSurface NonSurfaceInfos;                                   // 0x2F70(0x0150)(Edit, NativeAccessSpecifierPublic)
	struct FSQEXSEADSurfaceAssetReferenceTableData AuxSurfaceAssetTable;                              // 0x30C0(0x0010)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAutoSeComponentAssetTable">();
	}
	static class USQEXSEADAutoSeComponentAssetTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAutoSeComponentAssetTable>();
	}
};
static_assert(alignof(USQEXSEADAutoSeComponentAssetTable) == 0x000008, "Wrong alignment on USQEXSEADAutoSeComponentAssetTable");
static_assert(sizeof(USQEXSEADAutoSeComponentAssetTable) == 0x0030D0, "Wrong size on USQEXSEADAutoSeComponentAssetTable");
static_assert(offsetof(USQEXSEADAutoSeComponentAssetTable, PerSurfaceInfos) == 0x000030, "Member 'USQEXSEADAutoSeComponentAssetTable::PerSurfaceInfos' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeComponentAssetTable, NonSurfaceInfos) == 0x002F70, "Member 'USQEXSEADAutoSeComponentAssetTable::NonSurfaceInfos' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeComponentAssetTable, AuxSurfaceAssetTable) == 0x0030C0, "Member 'USQEXSEADAutoSeComponentAssetTable::AuxSurfaceAssetTable' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAutoSeProcessorLODSettings
// 0x0010 (0x0040 - 0x0030)
class USQEXSEADAutoSeProcessorLODSettings final : public UDataAsset
{
public:
	struct FSQEXSEADAutoSeProcessorLODLevelSettings LODLevels[0x4];                                    // 0x0030(0x0003)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAutoSeProcessorLODSettings">();
	}
	static class USQEXSEADAutoSeProcessorLODSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAutoSeProcessorLODSettings>();
	}
};
static_assert(alignof(USQEXSEADAutoSeProcessorLODSettings) == 0x000008, "Wrong alignment on USQEXSEADAutoSeProcessorLODSettings");
static_assert(sizeof(USQEXSEADAutoSeProcessorLODSettings) == 0x000040, "Wrong size on USQEXSEADAutoSeProcessorLODSettings");
static_assert(offsetof(USQEXSEADAutoSeProcessorLODSettings, LODLevels) == 0x000030, "Member 'USQEXSEADAutoSeProcessorLODSettings::LODLevels' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAutoSeComponentCallback
// 0x0000 (0x0028 - 0x0028)
class USQEXSEADAutoSeComponentCallback : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAutoSeComponentCallback">();
	}
	static class USQEXSEADAutoSeComponentCallback* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAutoSeComponentCallback>();
	}
};
static_assert(alignof(USQEXSEADAutoSeComponentCallback) == 0x000008, "Wrong alignment on USQEXSEADAutoSeComponentCallback");
static_assert(sizeof(USQEXSEADAutoSeComponentCallback) == 0x000028, "Wrong size on USQEXSEADAutoSeComponentCallback");

// Class SQEXSEAD.SQEXSEADAutoSeComponentCallbackDefault
// 0x0060 (0x0088 - 0x0028)
class USQEXSEADAutoSeComponentCallbackDefault final : public USQEXSEADAutoSeComponentCallback
{
public:
	uint8                                         Pad_28[0x60];                                      // 0x0028(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAutoSeComponentCallbackDefault">();
	}
	static class USQEXSEADAutoSeComponentCallbackDefault* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAutoSeComponentCallbackDefault>();
	}
};
static_assert(alignof(USQEXSEADAutoSeComponentCallbackDefault) == 0x000008, "Wrong alignment on USQEXSEADAutoSeComponentCallbackDefault");
static_assert(sizeof(USQEXSEADAutoSeComponentCallbackDefault) == 0x000088, "Wrong size on USQEXSEADAutoSeComponentCallbackDefault");

// Class SQEXSEAD.SQEXSEADAutoSeComponent
// 0x0180 (0x0230 - 0x00B0)
class alignas(0x10) USQEXSEADAutoSeComponent final : public UActorComponent
{
public:
	class USQEXSEADAutoSeComponentCallback*       AutoSeCallback;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USQEXSEADAutoSeComponentSetting*        SettingData;                                       // 0x00B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USQEXSEADAutoSeComponentAssetTable*     AssetTable;                                        // 0x00C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USQEXSEADAutoSeDetectionSetting*        DetectionSetting;                                  // 0x00C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USQEXSEADAutoSeProcessorLODSettings*    ProcLodSetting;                                    // 0x00D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CachedMeshReference;                               // 0x00E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPawnMovementComponent*                 CachedMovementComponent;                           // 0x00E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F0[0x140];                                     // 0x00F0(0x0140)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAutoSeComponent">();
	}
	static class USQEXSEADAutoSeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAutoSeComponent>();
	}
};
static_assert(alignof(USQEXSEADAutoSeComponent) == 0x000010, "Wrong alignment on USQEXSEADAutoSeComponent");
static_assert(sizeof(USQEXSEADAutoSeComponent) == 0x000230, "Wrong size on USQEXSEADAutoSeComponent");
static_assert(offsetof(USQEXSEADAutoSeComponent, AutoSeCallback) == 0x0000B0, "Member 'USQEXSEADAutoSeComponent::AutoSeCallback' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeComponent, SettingData) == 0x0000B8, "Member 'USQEXSEADAutoSeComponent::SettingData' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeComponent, AssetTable) == 0x0000C0, "Member 'USQEXSEADAutoSeComponent::AssetTable' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeComponent, DetectionSetting) == 0x0000C8, "Member 'USQEXSEADAutoSeComponent::DetectionSetting' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeComponent, ProcLodSetting) == 0x0000D0, "Member 'USQEXSEADAutoSeComponent::ProcLodSetting' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeComponent, CachedMeshReference) == 0x0000E0, "Member 'USQEXSEADAutoSeComponent::CachedMeshReference' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeComponent, CachedMovementComponent) == 0x0000E8, "Member 'USQEXSEADAutoSeComponent::CachedMovementComponent' has a wrong offset!");

// Class SQEXSEAD.SQEXSEAD_BGM
// 0x0050 (0x0078 - 0x0028)
class USQEXSEAD_BGM final : public UObject
{
public:
	class USQEXSEADSound*                         Sound_;                                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEAD_BGM">();
	}
	static class USQEXSEAD_BGM* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEAD_BGM>();
	}
};
static_assert(alignof(USQEXSEAD_BGM) == 0x000008, "Wrong alignment on USQEXSEAD_BGM");
static_assert(sizeof(USQEXSEAD_BGM) == 0x000078, "Wrong size on USQEXSEAD_BGM");
static_assert(offsetof(USQEXSEAD_BGM, Sound_) == 0x000028, "Member 'USQEXSEAD_BGM::Sound_' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADBGMManager
// 0x0128 (0x0150 - 0x0028)
class USQEXSEADBGMManager final : public UObject
{
public:
	TArray<class USQEXSEADBGMSlot*>               Slots_;                                            // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class USQEXSEADBGMSlotController*>     Controllers_;                                      // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0xF8];                                      // 0x0048(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSQEXSEAD_BGMSlotSetting>       SlotSettings_;                                     // 0x0140(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADBGMManager">();
	}
	static class USQEXSEADBGMManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADBGMManager>();
	}
};
static_assert(alignof(USQEXSEADBGMManager) == 0x000008, "Wrong alignment on USQEXSEADBGMManager");
static_assert(sizeof(USQEXSEADBGMManager) == 0x000150, "Wrong size on USQEXSEADBGMManager");
static_assert(offsetof(USQEXSEADBGMManager, Slots_) == 0x000028, "Member 'USQEXSEADBGMManager::Slots_' has a wrong offset!");
static_assert(offsetof(USQEXSEADBGMManager, Controllers_) == 0x000038, "Member 'USQEXSEADBGMManager::Controllers_' has a wrong offset!");
static_assert(offsetof(USQEXSEADBGMManager, SlotSettings_) == 0x000140, "Member 'USQEXSEADBGMManager::SlotSettings_' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADBGMSlot
// 0x00B0 (0x00D8 - 0x0028)
class USQEXSEADBGMSlot final : public UObject
{
public:
	ESQEXSEAD_BGMState                            State;                                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x77];                                      // 0x0029(0x0077)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSQEXSEAD_BGMOptions                   DefaultOptions_;                                   // 0x00A0(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USQEXSEAD_BGM*                          BGM_;                                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class USQEXSEAD_BGM*>                  FadeOutBGMs_;                                      // 0x00C8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADBGMSlot">();
	}
	static class USQEXSEADBGMSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADBGMSlot>();
	}
};
static_assert(alignof(USQEXSEADBGMSlot) == 0x000008, "Wrong alignment on USQEXSEADBGMSlot");
static_assert(sizeof(USQEXSEADBGMSlot) == 0x0000D8, "Wrong size on USQEXSEADBGMSlot");
static_assert(offsetof(USQEXSEADBGMSlot, State) == 0x000028, "Member 'USQEXSEADBGMSlot::State' has a wrong offset!");
static_assert(offsetof(USQEXSEADBGMSlot, DefaultOptions_) == 0x0000A0, "Member 'USQEXSEADBGMSlot::DefaultOptions_' has a wrong offset!");
static_assert(offsetof(USQEXSEADBGMSlot, BGM_) == 0x0000C0, "Member 'USQEXSEADBGMSlot::BGM_' has a wrong offset!");
static_assert(offsetof(USQEXSEADBGMSlot, FadeOutBGMs_) == 0x0000C8, "Member 'USQEXSEADBGMSlot::FadeOutBGMs_' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADBGMSlotController
// 0x0008 (0x0030 - 0x0028)
class USQEXSEADBGMSlotController final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FSQEXSEAD_Timing GetJustTiming();
	float GetLowpassValue();
	int32 GetModeIndex();
	float GetMusicalTime();
	struct FSQEXSEAD_Timing GetNearTiming();
	int32 GetNextSectionIndex();
	float GetPlayTime();
	int32 GetSectionIndex();
	float GetTempo();
	struct FVector GetVirtual3DPosition();
	bool IsFadeOuting(class FName SoundAssetName);
	bool IsPlaying();
	void Play();
	void Reset();
	void Set(class USoundBase* Sound);
	void SetEnableVirtual3D(bool bEnable, float FadeTime);
	void SetMode(int32 Index_0);
	void SetModeByName(class FName Name_0);
	void SetOptions(const struct FSQEXSEAD_BGMOptions& NewOptions);
	void SetPath(const class FString& Path);
	void SetPlayFadeInTime(float FadeTime);
	void SetPriority(int32 Priority);
	void SetRestartSameBGM(bool bRestart);
	void SetResumeFadeInTime(float FadeTime);
	void SetSection(int32 Index_0);
	void SetSectionByName(class FName Name_0);
	void SetSeekTime(float SeekTime);
	void SetSilent();
	void SetStopFadeOutTime(float FadeTime);
	void SetStoreBehaviour(ESQEXSEAD_BGMStoreBehaviour StoreBehaviour);
	void SetSuspendFadeOutTime(float FadeTime);
	void SetVirtual3DParam(const struct FSQEXSEAD_BGMVirtual3DParam& Param);
	void SetVirtual3DPosition(const struct FVector& Position, float FadeTime);
	void SetVolume(float Volume, float FadeTime);
	void Stop();
	void Unreference();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADBGMSlotController">();
	}
	static class USQEXSEADBGMSlotController* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADBGMSlotController>();
	}
};
static_assert(alignof(USQEXSEADBGMSlotController) == 0x000008, "Wrong alignment on USQEXSEADBGMSlotController");
static_assert(sizeof(USQEXSEADBGMSlotController) == 0x000030, "Wrong size on USQEXSEADBGMSlotController");

// Class SQEXSEAD.SQEXSEADSurfaceNameTable
// 0x01F8 (0x0228 - 0x0030)
class USQEXSEADSurfaceNameTable final : public UDataAsset
{
public:
	class FName                                   Names[0x3F];                                       // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADSurfaceNameTable">();
	}
	static class USQEXSEADSurfaceNameTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADSurfaceNameTable>();
	}
};
static_assert(alignof(USQEXSEADSurfaceNameTable) == 0x000008, "Wrong alignment on USQEXSEADSurfaceNameTable");
static_assert(sizeof(USQEXSEADSurfaceNameTable) == 0x000228, "Wrong size on USQEXSEADSurfaceNameTable");
static_assert(offsetof(USQEXSEADSurfaceNameTable, Names) == 0x000030, "Member 'USQEXSEADSurfaceNameTable::Names' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADSurfaceAssetReferenceTable
// 0x0010 (0x0040 - 0x0030)
class USQEXSEADSurfaceAssetReferenceTable final : public UDataAsset
{
public:
	struct FSQEXSEADSurfaceAssetReferenceTableData TableData;                                         // 0x0030(0x0010)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADSurfaceAssetReferenceTable">();
	}
	static class USQEXSEADSurfaceAssetReferenceTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADSurfaceAssetReferenceTable>();
	}
};
static_assert(alignof(USQEXSEADSurfaceAssetReferenceTable) == 0x000008, "Wrong alignment on USQEXSEADSurfaceAssetReferenceTable");
static_assert(sizeof(USQEXSEADSurfaceAssetReferenceTable) == 0x000040, "Wrong size on USQEXSEADSurfaceAssetReferenceTable");
static_assert(offsetof(USQEXSEADSurfaceAssetReferenceTable, TableData) == 0x000030, "Member 'USQEXSEADSurfaceAssetReferenceTable::TableData' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADLayoutAudioComponent
// 0x0000 (0x0890 - 0x0890)
class USQEXSEADLayoutAudioComponent final : public USQEXSEADAudioComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADLayoutAudioComponent">();
	}
	static class USQEXSEADLayoutAudioComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADLayoutAudioComponent>();
	}
};
static_assert(alignof(USQEXSEADLayoutAudioComponent) == 0x000010, "Wrong alignment on USQEXSEADLayoutAudioComponent");
static_assert(sizeof(USQEXSEADLayoutAudioComponent) == 0x000890, "Wrong size on USQEXSEADLayoutAudioComponent");

// Class SQEXSEAD.SQEXSEADLayoutComponent
// 0x00A0 (0x0530 - 0x0490)
class USQEXSEADLayoutComponent final : public UPrimitiveComponent
{
public:
	class USoundBase*                             Sound;                                             // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SoundName;                                         // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSQEXSEADLayoutInfo                    LayoutInfo;                                        // 0x04A0(0x0060)(Edit, NativeAccessSpecifierPublic)
	uint8                                         bIgnoreObstruction : 1;                            // 0x0500(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverrideInteriorFactor : 1;                       // 0x0500(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_501[0x3];                                      // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InteriorFactor;                                    // 0x0504(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeMultiplier;                                  // 0x0508(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x050C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_510[0x20];                                     // 0x0510(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADLayoutComponent">();
	}
	static class USQEXSEADLayoutComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADLayoutComponent>();
	}
};
static_assert(alignof(USQEXSEADLayoutComponent) == 0x000010, "Wrong alignment on USQEXSEADLayoutComponent");
static_assert(sizeof(USQEXSEADLayoutComponent) == 0x000530, "Wrong size on USQEXSEADLayoutComponent");
static_assert(offsetof(USQEXSEADLayoutComponent, Sound) == 0x000490, "Member 'USQEXSEADLayoutComponent::Sound' has a wrong offset!");
static_assert(offsetof(USQEXSEADLayoutComponent, SoundName) == 0x000498, "Member 'USQEXSEADLayoutComponent::SoundName' has a wrong offset!");
static_assert(offsetof(USQEXSEADLayoutComponent, LayoutInfo) == 0x0004A0, "Member 'USQEXSEADLayoutComponent::LayoutInfo' has a wrong offset!");
static_assert(offsetof(USQEXSEADLayoutComponent, InteriorFactor) == 0x000504, "Member 'USQEXSEADLayoutComponent::InteriorFactor' has a wrong offset!");
static_assert(offsetof(USQEXSEADLayoutComponent, VolumeMultiplier) == 0x000508, "Member 'USQEXSEADLayoutComponent::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(USQEXSEADLayoutComponent, PitchMultiplier) == 0x00050C, "Member 'USQEXSEADLayoutComponent::PitchMultiplier' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADLayoutSound
// 0x0010 (0x0238 - 0x0228)
class ASQEXSEADLayoutSound final : public AActor
{
public:
	class USQEXSEADLayoutComponent*               LayoutComponent;                                   // 0x0228(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bSyncActorHidden : 1;                              // 0x0230(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADLayoutSound">();
	}
	static class ASQEXSEADLayoutSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASQEXSEADLayoutSound>();
	}
};
static_assert(alignof(ASQEXSEADLayoutSound) == 0x000008, "Wrong alignment on ASQEXSEADLayoutSound");
static_assert(sizeof(ASQEXSEADLayoutSound) == 0x000238, "Wrong size on ASQEXSEADLayoutSound");
static_assert(offsetof(ASQEXSEADLayoutSound, LayoutComponent) == 0x000228, "Member 'ASQEXSEADLayoutSound::LayoutComponent' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADSound
// 0x01C0 (0x0550 - 0x0390)
class USQEXSEADSound : public USoundWave
{
public:
	bool                                          bForcedIgnore;                                     // 0x0390(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseKohrogiAttenuation;                            // 0x0391(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_392[0x6];                                      // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USQEXSEADSoundBank*                     ReferenceBank;                                     // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SoundIndex;                                        // 0x03A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideStopFadeTime;                             // 0x03A4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StopFadeTime;                                      // 0x03A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUISound;                                        // 0x03AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3AD[0x3];                                      // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PauseFadeTime;                                     // 0x03B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreListenerDynamicAudibleRangeMagnification;   // 0x03B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNoSEAD3DForcePlayOnLoopSound;                     // 0x03B5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreAudioVolumeAttenuation;                     // 0x03B6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableSEADTracingOcclusion;                       // 0x03B7(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             SEADOcclusionTraceChannel;                         // 0x03B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FSQEXSEADSoundIndexInfo> SoundNameIndexTable;                               // 0x03C0(0x0050)(Edit, EditFixedSize, NativeAccessSpecifierPublic)
	class USQEXSEADSoundAliasNameSetting*         SoundNameAliasSetting;                             // 0x0410(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStreamingAsset_PlatformPS5;                       // 0x0418(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStreamingAsset_PlatformXSX;                       // 0x0419(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESQEXSEADENDCustomSoundTypes                  EndCustomType;                                     // 0x041A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41B[0x135];                                    // 0x041B(0x0135)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADSound">();
	}
	static class USQEXSEADSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADSound>();
	}
};
static_assert(alignof(USQEXSEADSound) == 0x000008, "Wrong alignment on USQEXSEADSound");
static_assert(sizeof(USQEXSEADSound) == 0x000550, "Wrong size on USQEXSEADSound");
static_assert(offsetof(USQEXSEADSound, bForcedIgnore) == 0x000390, "Member 'USQEXSEADSound::bForcedIgnore' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, bUseKohrogiAttenuation) == 0x000391, "Member 'USQEXSEADSound::bUseKohrogiAttenuation' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, ReferenceBank) == 0x000398, "Member 'USQEXSEADSound::ReferenceBank' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, SoundIndex) == 0x0003A0, "Member 'USQEXSEADSound::SoundIndex' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, bOverrideStopFadeTime) == 0x0003A4, "Member 'USQEXSEADSound::bOverrideStopFadeTime' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, StopFadeTime) == 0x0003A8, "Member 'USQEXSEADSound::StopFadeTime' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, bIsUISound) == 0x0003AC, "Member 'USQEXSEADSound::bIsUISound' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, PauseFadeTime) == 0x0003B0, "Member 'USQEXSEADSound::PauseFadeTime' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, bIgnoreListenerDynamicAudibleRangeMagnification) == 0x0003B4, "Member 'USQEXSEADSound::bIgnoreListenerDynamicAudibleRangeMagnification' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, bNoSEAD3DForcePlayOnLoopSound) == 0x0003B5, "Member 'USQEXSEADSound::bNoSEAD3DForcePlayOnLoopSound' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, bIgnoreAudioVolumeAttenuation) == 0x0003B6, "Member 'USQEXSEADSound::bIgnoreAudioVolumeAttenuation' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, bEnableSEADTracingOcclusion) == 0x0003B7, "Member 'USQEXSEADSound::bEnableSEADTracingOcclusion' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, SEADOcclusionTraceChannel) == 0x0003B8, "Member 'USQEXSEADSound::SEADOcclusionTraceChannel' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, SoundNameIndexTable) == 0x0003C0, "Member 'USQEXSEADSound::SoundNameIndexTable' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, SoundNameAliasSetting) == 0x000410, "Member 'USQEXSEADSound::SoundNameAliasSetting' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, bStreamingAsset_PlatformPS5) == 0x000418, "Member 'USQEXSEADSound::bStreamingAsset_PlatformPS5' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, bStreamingAsset_PlatformXSX) == 0x000419, "Member 'USQEXSEADSound::bStreamingAsset_PlatformXSX' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, EndCustomType) == 0x00041A, "Member 'USQEXSEADSound::EndCustomType' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADMusic
// 0x00A0 (0x05F0 - 0x0550)
class USQEXSEADMusic final : public USQEXSEADSound
{
public:
	TMap<class FName, int32>                      SectionNameIndexTable;                             // 0x0550(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<class FName, int32>                      ModeNameIndexTable;                                // 0x05A0(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADMusic">();
	}
	static class USQEXSEADMusic* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADMusic>();
	}
};
static_assert(alignof(USQEXSEADMusic) == 0x000008, "Wrong alignment on USQEXSEADMusic");
static_assert(sizeof(USQEXSEADMusic) == 0x0005F0, "Wrong size on USQEXSEADMusic");
static_assert(offsetof(USQEXSEADMusic, SectionNameIndexTable) == 0x000550, "Member 'USQEXSEADMusic::SectionNameIndexTable' has a wrong offset!");
static_assert(offsetof(USQEXSEADMusic, ModeNameIndexTable) == 0x0005A0, "Member 'USQEXSEADMusic::ModeNameIndexTable' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADSoundAliasNameSetting
// 0x00F0 (0x0120 - 0x0030)
class USQEXSEADSoundAliasNameSetting final : public UDataAsset
{
public:
	TMap<class FName, class FName>                TranslateSettings;                                 // 0x0030(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, struct FSQEXSEADOrderSoundSetting> OrderSettings;                                     // 0x0080(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, struct FSQEXSEADRandomSoundSetting> RandomSettings;                                    // 0x00D0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	void SortSettings();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADSoundAliasNameSetting">();
	}
	static class USQEXSEADSoundAliasNameSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADSoundAliasNameSetting>();
	}
};
static_assert(alignof(USQEXSEADSoundAliasNameSetting) == 0x000008, "Wrong alignment on USQEXSEADSoundAliasNameSetting");
static_assert(sizeof(USQEXSEADSoundAliasNameSetting) == 0x000120, "Wrong size on USQEXSEADSoundAliasNameSetting");
static_assert(offsetof(USQEXSEADSoundAliasNameSetting, TranslateSettings) == 0x000030, "Member 'USQEXSEADSoundAliasNameSetting::TranslateSettings' has a wrong offset!");
static_assert(offsetof(USQEXSEADSoundAliasNameSetting, OrderSettings) == 0x000080, "Member 'USQEXSEADSoundAliasNameSetting::OrderSettings' has a wrong offset!");
static_assert(offsetof(USQEXSEADSoundAliasNameSetting, RandomSettings) == 0x0000D0, "Member 'USQEXSEADSoundAliasNameSetting::RandomSettings' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADSoundBank
// 0x0138 (0x0160 - 0x0028)
class USQEXSEADSoundBank final : public UObject
{
public:
	class UAssetImportData*                       AssetImportData;                                   // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x130];                                     // 0x0030(0x0130)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADSoundBank">();
	}
	static class USQEXSEADSoundBank* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADSoundBank>();
	}
};
static_assert(alignof(USQEXSEADSoundBank) == 0x000008, "Wrong alignment on USQEXSEADSoundBank");
static_assert(sizeof(USQEXSEADSoundBank) == 0x000160, "Wrong size on USQEXSEADSoundBank");
static_assert(offsetof(USQEXSEADSoundBank, AssetImportData) == 0x000028, "Member 'USQEXSEADSoundBank::AssetImportData' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADStatics
// 0x0000 (0x0028 - 0x0028)
class USQEXSEADStatics final : public UObject
{
public:
	static void AutoSeCtrl_SetEnable(bool Enable);
	static void CallEvent(class FName EventName);
	static void CategoryCtrl_DebugMute(class FName CategoryName, bool bToBeMuted, float FadeTime);
	static float CategoryCtrl_GetVolume(class FName CategoryName, ESQEXSEADCategoryVolumeLayers targerlayer);
	static void CategoryCtrl_Resume(class FName CategoryName, float FadeInTime);
	static void CategoryCtrl_SetPitch(class FName CategoryName, float Pitch, float FadeTime);
