#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Startmenu_btn00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Startmenu_btn00.Startmenu_btn00_C
// 0x0050 (0x0418 - 0x03C8)
class UStartmenu_btn00_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       In;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Arrow00;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Button_00;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Hovered;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStartmenu_BtnLight_C*                  Startmenu_BtnLight;                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Command;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_Startmenu_btn00(int32 EntryPoint);
	void BndEvt__Button_00_K2Node_ComponentBoundEvent_63_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Startmenu_btn00_C">();
	}
	static class UStartmenu_btn00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStartmenu_btn00_C>();
	}
};
static_assert(alignof(UStartmenu_btn00_C) == 0x000008, "Wrong alignment on UStartmenu_btn00_C");
static_assert(sizeof(UStartmenu_btn00_C) == 0x000418, "Wrong size on UStartmenu_btn00_C");
static_assert(offsetof(UStartmenu_btn00_C, UberGraphFrame) == 0x0003C8, "Member 'UStartmenu_btn00_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStartmenu_btn00_C, In) == 0x0003D0, "Member 'UStartmenu_btn00_C::In' has a wrong offset!");
static_assert(offsetof(UStartmenu_btn00_C, Hovered) == 0x0003D8, "Member 'UStartmenu_btn00_C::Hovered' has a wrong offset!");
static_assert(offsetof(UStartmenu_btn00_C, Arrow00) == 0x0003E0, "Member 'UStartmenu_btn00_C::Arrow00' has a wrong offset!");
static_assert(offsetof(UStartmenu_btn00_C, Button_00) == 0x0003E8, "Member 'UStartmenu_btn00_C::Button_00' has a wrong offset!");
static_assert(offsetof(UStartmenu_btn00_C, Img_Hovered) == 0x0003F0, "Member 'UStartmenu_btn00_C::Img_Hovered' has a wrong offset!");
static_assert(offsetof(UStartmenu_btn00_C, Startmenu_BtnLight) == 0x0003F8, "Member 'UStartmenu_btn00_C::Startmenu_BtnLight' has a wrong offset!");
static_assert(offsetof(UStartmenu_btn00_C, Txt_Command) == 0x000400, "Member 'UStartmenu_btn00_C::Txt_Command' has a wrong offset!");
static_assert(offsetof(UStartmenu_btn00_C, OnClicked) == 0x000408, "Member 'UStartmenu_btn00_C::OnClicked' has a wrong offset!");

}

