#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Startmenu_BtnLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Startmenu_BtnLight.Startmenu_BtnLight_C
// 0x0020 (0x03E8 - 0x03C8)
class UStartmenu_BtnLight_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Arrow01;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Startmenu_BtnLight(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Startmenu_BtnLight_C">();
	}
	static class UStartmenu_BtnLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStartmenu_BtnLight_C>();
	}
};
static_assert(alignof(UStartmenu_BtnLight_C) == 0x000008, "Wrong alignment on UStartmenu_BtnLight_C");
static_assert(sizeof(UStartmenu_BtnLight_C) == 0x0003E8, "Wrong size on UStartmenu_BtnLight_C");
static_assert(offsetof(UStartmenu_BtnLight_C, UberGraphFrame) == 0x0003C8, "Member 'UStartmenu_BtnLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStartmenu_BtnLight_C, Loop) == 0x0003D0, "Member 'UStartmenu_BtnLight_C::Loop' has a wrong offset!");
static_assert(offsetof(UStartmenu_BtnLight_C, Arrow01) == 0x0003D8, "Member 'UStartmenu_BtnLight_C::Arrow01' has a wrong offset!");
static_assert(offsetof(UStartmenu_BtnLight_C, Img_BtnLight) == 0x0003E0, "Member 'UStartmenu_BtnLight_C::Img_BtnLight' has a wrong offset!");

}

