#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatusList

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StatusList.StatusList_C
// 0x0078 (0x0568 - 0x04F0)
class UStatusList_C final : public UEndStatusList
{
public:
	class UEndImage*                              Bg;                                                // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase1;                                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_01;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_02;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_1;                                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_2;                                            // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_3;                                            // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_4;                                            // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_5;                                            // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_6;                                            // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_7;                                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_8;                                            // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_9;                                            // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_10;                                           // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_BtnGuide;                                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StatusList_C">();
	}
	static class UStatusList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatusList_C>();
	}
};
static_assert(alignof(UStatusList_C) == 0x000008, "Wrong alignment on UStatusList_C");
static_assert(sizeof(UStatusList_C) == 0x000568, "Wrong size on UStatusList_C");
static_assert(offsetof(UStatusList_C, Bg) == 0x0004F0, "Member 'UStatusList_C::Bg' has a wrong offset!");
static_assert(offsetof(UStatusList_C, BtnBase1) == 0x0004F8, "Member 'UStatusList_C::BtnBase1' has a wrong offset!");
static_assert(offsetof(UStatusList_C, Img_Slash_01) == 0x000500, "Member 'UStatusList_C::Img_Slash_01' has a wrong offset!");
static_assert(offsetof(UStatusList_C, Img_Slash_02) == 0x000508, "Member 'UStatusList_C::Img_Slash_02' has a wrong offset!");
static_assert(offsetof(UStatusList_C, Line_1) == 0x000510, "Member 'UStatusList_C::Line_1' has a wrong offset!");
static_assert(offsetof(UStatusList_C, Line_2) == 0x000518, "Member 'UStatusList_C::Line_2' has a wrong offset!");
static_assert(offsetof(UStatusList_C, Line_3) == 0x000520, "Member 'UStatusList_C::Line_3' has a wrong offset!");
static_assert(offsetof(UStatusList_C, Line_4) == 0x000528, "Member 'UStatusList_C::Line_4' has a wrong offset!");
static_assert(offsetof(UStatusList_C, Line_5) == 0x000530, "Member 'UStatusList_C::Line_5' has a wrong offset!");
static_assert(offsetof(UStatusList_C, Line_6) == 0x000538, "Member 'UStatusList_C::Line_6' has a wrong offset!");
static_assert(offsetof(UStatusList_C, Line_7) == 0x000540, "Member 'UStatusList_C::Line_7' has a wrong offset!");
static_assert(offsetof(UStatusList_C, Line_8) == 0x000548, "Member 'UStatusList_C::Line_8' has a wrong offset!");
static_assert(offsetof(UStatusList_C, Line_9) == 0x000550, "Member 'UStatusList_C::Line_9' has a wrong offset!");
static_assert(offsetof(UStatusList_C, Line_10) == 0x000558, "Member 'UStatusList_C::Line_10' has a wrong offset!");
static_assert(offsetof(UStatusList_C, Txt_BtnGuide) == 0x000560, "Member 'UStatusList_C::Txt_BtnGuide' has a wrong offset!");

}

