#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatusList_Cell3

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StatusList_Cell3.StatusList_Cell3_C
// 0x0018 (0x0400 - 0x03E8)
class UStatusList_Cell3_C final : public UEndStatusListCell
{
public:
	class UCore_ListNew_C*                        Core_List;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_58;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateria_ListNew_C*                     Materia_ListNew2;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StatusList_Cell3_C">();
	}
	static class UStatusList_Cell3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatusList_Cell3_C>();
	}
};
static_assert(alignof(UStatusList_Cell3_C) == 0x000008, "Wrong alignment on UStatusList_Cell3_C");
static_assert(sizeof(UStatusList_Cell3_C) == 0x000400, "Wrong size on UStatusList_Cell3_C");
static_assert(offsetof(UStatusList_Cell3_C, Core_List) == 0x0003E8, "Member 'UStatusList_Cell3_C::Core_List' has a wrong offset!");
static_assert(offsetof(UStatusList_Cell3_C, EndImage_58) == 0x0003F0, "Member 'UStatusList_Cell3_C::EndImage_58' has a wrong offset!");
static_assert(offsetof(UStatusList_Cell3_C, Materia_ListNew2) == 0x0003F8, "Member 'UStatusList_Cell3_C::Materia_ListNew2' has a wrong offset!");

}

