#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Status_LimitEffect_01

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Status_LimitEffect_01.Status_LimitEffect_01_C
// 0x00B0 (0x0490 - 0x03E0)
class UStatus_LimitEffect_01_C final : public UEndMenuCmdLimitEffect
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_Command_LimitEffect;                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Color_00;                               // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Color_01;                               // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Color_02;                               // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Gradation_00;                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Light_00;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Light_01;                               // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Light_02;                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Light_04;                               // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Line_00;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_02;                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_03;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_04;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_05;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_06;                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Command_LimitEffect;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Effect_Color;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_Light;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_Particle;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Status_LimitEffect_01_C">();
	}
	static class UStatus_LimitEffect_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatus_LimitEffect_01_C>();
	}
};
static_assert(alignof(UStatus_LimitEffect_01_C) == 0x000008, "Wrong alignment on UStatus_LimitEffect_01_C");
static_assert(sizeof(UStatus_LimitEffect_01_C) == 0x000490, "Wrong size on UStatus_LimitEffect_01_C");
static_assert(offsetof(UStatus_LimitEffect_01_C, Out) == 0x0003E0, "Member 'UStatus_LimitEffect_01_C::Out' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, In) == 0x0003E8, "Member 'UStatus_LimitEffect_01_C::In' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Loop) == 0x0003F0, "Member 'UStatus_LimitEffect_01_C::Loop' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, All_Command_LimitEffect) == 0x0003F8, "Member 'UStatus_LimitEffect_01_C::All_Command_LimitEffect' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Img_Effect_Color_00) == 0x000400, "Member 'UStatus_LimitEffect_01_C::Img_Effect_Color_00' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Img_Effect_Color_01) == 0x000408, "Member 'UStatus_LimitEffect_01_C::Img_Effect_Color_01' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Img_Effect_Color_02) == 0x000410, "Member 'UStatus_LimitEffect_01_C::Img_Effect_Color_02' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Img_Effect_Gradation_00) == 0x000418, "Member 'UStatus_LimitEffect_01_C::Img_Effect_Gradation_00' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Img_Effect_Light_00) == 0x000420, "Member 'UStatus_LimitEffect_01_C::Img_Effect_Light_00' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Img_Effect_Light_01) == 0x000428, "Member 'UStatus_LimitEffect_01_C::Img_Effect_Light_01' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Img_Effect_Light_02) == 0x000430, "Member 'UStatus_LimitEffect_01_C::Img_Effect_Light_02' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Img_Effect_Light_04) == 0x000438, "Member 'UStatus_LimitEffect_01_C::Img_Effect_Light_04' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Img_Effect_Line_00) == 0x000440, "Member 'UStatus_LimitEffect_01_C::Img_Effect_Line_00' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Img_Effect_Particle_02) == 0x000448, "Member 'UStatus_LimitEffect_01_C::Img_Effect_Particle_02' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Img_Effect_Particle_03) == 0x000450, "Member 'UStatus_LimitEffect_01_C::Img_Effect_Particle_03' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Img_Effect_Particle_04) == 0x000458, "Member 'UStatus_LimitEffect_01_C::Img_Effect_Particle_04' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Img_Effect_Particle_05) == 0x000460, "Member 'UStatus_LimitEffect_01_C::Img_Effect_Particle_05' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Img_Effect_Particle_06) == 0x000468, "Member 'UStatus_LimitEffect_01_C::Img_Effect_Particle_06' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Nut_Command_LimitEffect) == 0x000470, "Member 'UStatus_LimitEffect_01_C::Nut_Command_LimitEffect' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Nut_Effect_Color) == 0x000478, "Member 'UStatus_LimitEffect_01_C::Nut_Effect_Color' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Pnl_Light) == 0x000480, "Member 'UStatus_LimitEffect_01_C::Pnl_Light' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_01_C, Pnl_Particle) == 0x000488, "Member 'UStatus_LimitEffect_01_C::Pnl_Particle' has a wrong offset!");

}

