#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Status_CurrentLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Status_CurrentLight.Status_CurrentLight_C
// 0x0018 (0x03E0 - 0x03C8)
class UStatus_CurrentLight_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Status_CurrentLight(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Status_CurrentLight_C">();
	}
	static class UStatus_CurrentLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatus_CurrentLight_C>();
	}
};
static_assert(alignof(UStatus_CurrentLight_C) == 0x000008, "Wrong alignment on UStatus_CurrentLight_C");
static_assert(sizeof(UStatus_CurrentLight_C) == 0x0003E0, "Wrong size on UStatus_CurrentLight_C");
static_assert(offsetof(UStatus_CurrentLight_C, UberGraphFrame) == 0x0003C8, "Member 'UStatus_CurrentLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStatus_CurrentLight_C, Loop) == 0x0003D0, "Member 'UStatus_CurrentLight_C::Loop' has a wrong offset!");
static_assert(offsetof(UStatus_CurrentLight_C, Img_BtnLight) == 0x0003D8, "Member 'UStatus_CurrentLight_C::Img_BtnLight' has a wrong offset!");

}

