#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Status_Friend_Cell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Status_Friend_Cell.Status_Friend_Cell_C
// 0x0050 (0x04A0 - 0x0450)
class UStatus_Friend_Cell_C final : public UEndBattleFriendStatusCell
{
public:
	class UEndImage*                              Base_00;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_HP;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_00;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_01;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_02;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_StatusSimple_C*                   Icon_StatusSimple_00;                              // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_StatusSimple_C*                   Icon_StatusSimple_01;                              // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_HP_Gauge_BG;                                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_HP;                                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_HP_Num;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Status_Friend_Cell_C">();
	}
	static class UStatus_Friend_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatus_Friend_Cell_C>();
	}
};
static_assert(alignof(UStatus_Friend_Cell_C) == 0x000008, "Wrong alignment on UStatus_Friend_Cell_C");
static_assert(sizeof(UStatus_Friend_Cell_C) == 0x0004A0, "Wrong size on UStatus_Friend_Cell_C");
static_assert(offsetof(UStatus_Friend_Cell_C, Base_00) == 0x000450, "Member 'UStatus_Friend_Cell_C::Base_00' has a wrong offset!");
static_assert(offsetof(UStatus_Friend_Cell_C, Gauge_HP) == 0x000458, "Member 'UStatus_Friend_Cell_C::Gauge_HP' has a wrong offset!");
static_assert(offsetof(UStatus_Friend_Cell_C, Icon_Status_00) == 0x000460, "Member 'UStatus_Friend_Cell_C::Icon_Status_00' has a wrong offset!");
static_assert(offsetof(UStatus_Friend_Cell_C, Icon_Status_01) == 0x000468, "Member 'UStatus_Friend_Cell_C::Icon_Status_01' has a wrong offset!");
static_assert(offsetof(UStatus_Friend_Cell_C, Icon_Status_02) == 0x000470, "Member 'UStatus_Friend_Cell_C::Icon_Status_02' has a wrong offset!");
static_assert(offsetof(UStatus_Friend_Cell_C, Icon_StatusSimple_00) == 0x000478, "Member 'UStatus_Friend_Cell_C::Icon_StatusSimple_00' has a wrong offset!");
static_assert(offsetof(UStatus_Friend_Cell_C, Icon_StatusSimple_01) == 0x000480, "Member 'UStatus_Friend_Cell_C::Icon_StatusSimple_01' has a wrong offset!");
static_assert(offsetof(UStatus_Friend_Cell_C, Img_HP_Gauge_BG) == 0x000488, "Member 'UStatus_Friend_Cell_C::Img_HP_Gauge_BG' has a wrong offset!");
static_assert(offsetof(UStatus_Friend_Cell_C, Txt_HP) == 0x000490, "Member 'UStatus_Friend_Cell_C::Txt_HP' has a wrong offset!");
static_assert(offsetof(UStatus_Friend_Cell_C, Txt_HP_Num) == 0x000498, "Member 'UStatus_Friend_Cell_C::Txt_HP_Num' has a wrong offset!");

}

