#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Status

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Status.Status_C
// 0x0050 (0x0470 - 0x0420)
class UStatus_C final : public UEndFieldStatusMenu
{
public:
	class UWidgetAnimation*                       Status_In;                                         // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_00;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_01;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_00;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatus_PartySet_C*                     PartySet;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGauge_Cell_C*                          Status_00;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGauge_Cell_C*                          Status_01;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGauge_Cell_C*                          Status_02;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatus_BtnGuide_C*                     Status_BtnGuide;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Status_C">();
	}
	static class UStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatus_C>();
	}
};
static_assert(alignof(UStatus_C) == 0x000008, "Wrong alignment on UStatus_C");
static_assert(sizeof(UStatus_C) == 0x000470, "Wrong size on UStatus_C");
static_assert(offsetof(UStatus_C, Status_In) == 0x000420, "Member 'UStatus_C::Status_In' has a wrong offset!");
static_assert(offsetof(UStatus_C, Img_Base_00) == 0x000428, "Member 'UStatus_C::Img_Base_00' has a wrong offset!");
static_assert(offsetof(UStatus_C, Img_Base_01) == 0x000430, "Member 'UStatus_C::Img_Base_01' has a wrong offset!");
static_assert(offsetof(UStatus_C, Img_Effect_00) == 0x000438, "Member 'UStatus_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UStatus_C, Line_00) == 0x000440, "Member 'UStatus_C::Line_00' has a wrong offset!");
static_assert(offsetof(UStatus_C, PartySet) == 0x000448, "Member 'UStatus_C::PartySet' has a wrong offset!");
static_assert(offsetof(UStatus_C, Status_00) == 0x000450, "Member 'UStatus_C::Status_00' has a wrong offset!");
static_assert(offsetof(UStatus_C, Status_01) == 0x000458, "Member 'UStatus_C::Status_01' has a wrong offset!");
static_assert(offsetof(UStatus_C, Status_02) == 0x000460, "Member 'UStatus_C::Status_02' has a wrong offset!");
static_assert(offsetof(UStatus_C, Status_BtnGuide) == 0x000468, "Member 'UStatus_C::Status_BtnGuide' has a wrong offset!");

}

