#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Status_JoinEffect

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Status_JoinEffect.Status_JoinEffect_C
// 0x0018 (0x03E0 - 0x03C8)
class UStatus_JoinEffect_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       MemberJoin;                                        // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_Com_Effect_02;                                 // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_JoinEffect_00;                                 // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Status_JoinEffect_C">();
	}
	static class UStatus_JoinEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatus_JoinEffect_C>();
	}
};
static_assert(alignof(UStatus_JoinEffect_C) == 0x000008, "Wrong alignment on UStatus_JoinEffect_C");
static_assert(sizeof(UStatus_JoinEffect_C) == 0x0003E0, "Wrong size on UStatus_JoinEffect_C");
static_assert(offsetof(UStatus_JoinEffect_C, MemberJoin) == 0x0003C8, "Member 'UStatus_JoinEffect_C::MemberJoin' has a wrong offset!");
static_assert(offsetof(UStatus_JoinEffect_C, Img_Com_Effect_02) == 0x0003D0, "Member 'UStatus_JoinEffect_C::Img_Com_Effect_02' has a wrong offset!");
static_assert(offsetof(UStatus_JoinEffect_C, Img_JoinEffect_00) == 0x0003D8, "Member 'UStatus_JoinEffect_C::Img_JoinEffect_00' has a wrong offset!");

}

