#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Status_BtnGuide

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Status_BtnGuide.Status_BtnGuide_C
// 0x0020 (0x03E8 - 0x03C8)
class UStatus_BtnGuide_C final : public UEndUserWidget
{
public:
	class UEndImageSet*                           Icon;                                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Shadow;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_00;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Shadow;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Status_BtnGuide_C">();
	}
	static class UStatus_BtnGuide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatus_BtnGuide_C>();
	}
};
static_assert(alignof(UStatus_BtnGuide_C) == 0x000008, "Wrong alignment on UStatus_BtnGuide_C");
static_assert(sizeof(UStatus_BtnGuide_C) == 0x0003E8, "Wrong size on UStatus_BtnGuide_C");
static_assert(offsetof(UStatus_BtnGuide_C, Icon) == 0x0003C8, "Member 'UStatus_BtnGuide_C::Icon' has a wrong offset!");
static_assert(offsetof(UStatus_BtnGuide_C, Icon_Shadow) == 0x0003D0, "Member 'UStatus_BtnGuide_C::Icon_Shadow' has a wrong offset!");
static_assert(offsetof(UStatus_BtnGuide_C, Line_00) == 0x0003D8, "Member 'UStatus_BtnGuide_C::Line_00' has a wrong offset!");
static_assert(offsetof(UStatus_BtnGuide_C, Line_Shadow) == 0x0003E0, "Member 'UStatus_BtnGuide_C::Line_Shadow' has a wrong offset!");

}

