#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Status_CloneBuff

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Status_CloneBuff.Status_CloneBuff_C
// 0x0050 (0x0418 - 0x03C8)
class UStatus_CloneBuff_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Effect_01;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_00;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Circle;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Frame;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Light;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Light2;                                 // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Status_CloneBuff_C">();
	}
	static class UStatus_CloneBuff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatus_CloneBuff_C>();
	}
};
static_assert(alignof(UStatus_CloneBuff_C) == 0x000008, "Wrong alignment on UStatus_CloneBuff_C");
static_assert(sizeof(UStatus_CloneBuff_C) == 0x000418, "Wrong size on UStatus_CloneBuff_C");
static_assert(offsetof(UStatus_CloneBuff_C, Out) == 0x0003C8, "Member 'UStatus_CloneBuff_C::Out' has a wrong offset!");
static_assert(offsetof(UStatus_CloneBuff_C, Loop) == 0x0003D0, "Member 'UStatus_CloneBuff_C::Loop' has a wrong offset!");
static_assert(offsetof(UStatus_CloneBuff_C, In) == 0x0003D8, "Member 'UStatus_CloneBuff_C::In' has a wrong offset!");
static_assert(offsetof(UStatus_CloneBuff_C, Effect_01) == 0x0003E0, "Member 'UStatus_CloneBuff_C::Effect_01' has a wrong offset!");
static_assert(offsetof(UStatus_CloneBuff_C, Icon_00) == 0x0003E8, "Member 'UStatus_CloneBuff_C::Icon_00' has a wrong offset!");
static_assert(offsetof(UStatus_CloneBuff_C, Img_Effect_00) == 0x0003F0, "Member 'UStatus_CloneBuff_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UStatus_CloneBuff_C, Img_Effect_Circle) == 0x0003F8, "Member 'UStatus_CloneBuff_C::Img_Effect_Circle' has a wrong offset!");
static_assert(offsetof(UStatus_CloneBuff_C, Img_Effect_Frame) == 0x000400, "Member 'UStatus_CloneBuff_C::Img_Effect_Frame' has a wrong offset!");
static_assert(offsetof(UStatus_CloneBuff_C, Img_Effect_Light) == 0x000408, "Member 'UStatus_CloneBuff_C::Img_Effect_Light' has a wrong offset!");
static_assert(offsetof(UStatus_CloneBuff_C, Img_Effect_Light2) == 0x000410, "Member 'UStatus_CloneBuff_C::Img_Effect_Light2' has a wrong offset!");

}

