#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Stone_Filter

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Stone_Filter.Stone_Filter_C
// 0x0028 (0x03F0 - 0x03C8)
class UStone_Filter_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       In;                                                // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImageSet*                           Filter_01;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Filter_02;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Filter_L00;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Filter_R00;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Stone_Filter_C">();
	}
	static class UStone_Filter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStone_Filter_C>();
	}
};
static_assert(alignof(UStone_Filter_C) == 0x000008, "Wrong alignment on UStone_Filter_C");
static_assert(sizeof(UStone_Filter_C) == 0x0003F0, "Wrong size on UStone_Filter_C");
static_assert(offsetof(UStone_Filter_C, In) == 0x0003C8, "Member 'UStone_Filter_C::In' has a wrong offset!");
static_assert(offsetof(UStone_Filter_C, Filter_01) == 0x0003D0, "Member 'UStone_Filter_C::Filter_01' has a wrong offset!");
static_assert(offsetof(UStone_Filter_C, Filter_02) == 0x0003D8, "Member 'UStone_Filter_C::Filter_02' has a wrong offset!");
static_assert(offsetof(UStone_Filter_C, Filter_L00) == 0x0003E0, "Member 'UStone_Filter_C::Filter_L00' has a wrong offset!");
static_assert(offsetof(UStone_Filter_C, Filter_R00) == 0x0003E8, "Member 'UStone_Filter_C::Filter_R00' has a wrong offset!");

}

