#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Story_DetailInfo2

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Story_DetailInfo2.Story_DetailInfo2_C
// 0x0108 (0x04D0 - 0x03C8)
class UStory_DetailInfo2_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Main_Child_Info_Close;                             // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Side_Info_Closed;                                  // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Side_Info_Clear;                                   // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Main_Child_Info_Clear;                             // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Main_Child_Info;                                   // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Main_Info_Clear;                                   // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Main_Info;                                         // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Side_Info;                                         // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base1_4;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_1_1;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg_3;                                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_StoryImg;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_3;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_4;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_5;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_6;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_7;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_8;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_9;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_151;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_541;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_MainStory;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_3;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_4;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_5;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_6;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_7;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_8;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuest_RecommendLevel_C*                RecommendLevel;                                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Title_Icon;                                        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Story_DetailInfo2_C">();
	}
	static class UStory_DetailInfo2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStory_DetailInfo2_C>();
	}
};
static_assert(alignof(UStory_DetailInfo2_C) == 0x000008, "Wrong alignment on UStory_DetailInfo2_C");
static_assert(sizeof(UStory_DetailInfo2_C) == 0x0004D0, "Wrong size on UStory_DetailInfo2_C");
static_assert(offsetof(UStory_DetailInfo2_C, Main_Child_Info_Close) == 0x0003C8, "Member 'UStory_DetailInfo2_C::Main_Child_Info_Close' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, Menu_In) == 0x0003D0, "Member 'UStory_DetailInfo2_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, Side_Info_Closed) == 0x0003D8, "Member 'UStory_DetailInfo2_C::Side_Info_Closed' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, Side_Info_Clear) == 0x0003E0, "Member 'UStory_DetailInfo2_C::Side_Info_Clear' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, Main_Child_Info_Clear) == 0x0003E8, "Member 'UStory_DetailInfo2_C::Main_Child_Info_Clear' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, Main_Child_Info) == 0x0003F0, "Member 'UStory_DetailInfo2_C::Main_Child_Info' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, Main_Info_Clear) == 0x0003F8, "Member 'UStory_DetailInfo2_C::Main_Info_Clear' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, Main_Info) == 0x000400, "Member 'UStory_DetailInfo2_C::Main_Info' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, Side_Info) == 0x000408, "Member 'UStory_DetailInfo2_C::Side_Info' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, Base1_4) == 0x000410, "Member 'UStory_DetailInfo2_C::Base1_4' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, Base_1_1) == 0x000418, "Member 'UStory_DetailInfo2_C::Base_1_1' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, Bg_3) == 0x000420, "Member 'UStory_DetailInfo2_C::Bg_3' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, Billboard_StoryImg) == 0x000428, "Member 'UStory_DetailInfo2_C::Billboard_StoryImg' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, EndImage) == 0x000430, "Member 'UStory_DetailInfo2_C::EndImage' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, EndImage_1) == 0x000438, "Member 'UStory_DetailInfo2_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, EndImage_3) == 0x000440, "Member 'UStory_DetailInfo2_C::EndImage_3' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, EndImage_4) == 0x000448, "Member 'UStory_DetailInfo2_C::EndImage_4' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, EndImage_5) == 0x000450, "Member 'UStory_DetailInfo2_C::EndImage_5' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, EndImage_6) == 0x000458, "Member 'UStory_DetailInfo2_C::EndImage_6' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, EndImage_7) == 0x000460, "Member 'UStory_DetailInfo2_C::EndImage_7' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, EndImage_8) == 0x000468, "Member 'UStory_DetailInfo2_C::EndImage_8' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, EndImage_9) == 0x000470, "Member 'UStory_DetailInfo2_C::EndImage_9' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, EndImage_151) == 0x000478, "Member 'UStory_DetailInfo2_C::EndImage_151' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, EndImage_541) == 0x000480, "Member 'UStory_DetailInfo2_C::EndImage_541' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, Icon_MainStory) == 0x000488, "Member 'UStory_DetailInfo2_C::Icon_MainStory' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, ListPoint_3) == 0x000490, "Member 'UStory_DetailInfo2_C::ListPoint_3' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, ListPoint_4) == 0x000498, "Member 'UStory_DetailInfo2_C::ListPoint_4' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, ListPoint_5) == 0x0004A0, "Member 'UStory_DetailInfo2_C::ListPoint_5' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, ListPoint_6) == 0x0004A8, "Member 'UStory_DetailInfo2_C::ListPoint_6' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, ListPoint_7) == 0x0004B0, "Member 'UStory_DetailInfo2_C::ListPoint_7' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, ListPoint_8) == 0x0004B8, "Member 'UStory_DetailInfo2_C::ListPoint_8' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, RecommendLevel) == 0x0004C0, "Member 'UStory_DetailInfo2_C::RecommendLevel' has a wrong offset!");
static_assert(offsetof(UStory_DetailInfo2_C, Title_Icon) == 0x0004C8, "Member 'UStory_DetailInfo2_C::Title_Icon' has a wrong offset!");

}

