#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Story_Cell_03

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Story_Cell_03.Story_Cell_03_C
// 0x0220 (0x05E8 - 0x03C8)
class UStory_Cell_03_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       BtnHover_Main_Child3Close;                         // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Main_Child3Close;                       // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Main_ChildClose;                          // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Main_ChildClose;                        // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Main_Child3Clear;                         // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Main_Child3;                              // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Main_Child3Clear;                       // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Main_Child3;                            // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Main_Child2Clear;                         // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Main_Child2;                              // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Main_Child2Clear;                       // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Main_Child2;                            // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CharaName_Active;                                  // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CharaName;                                         // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Category_Side;                            // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Category_Main;                            // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_SideClosed;                               // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_SideClosed;                             // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Chapter;                                // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_SideClear;                                // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Side;                                     // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_SideClear;                              // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Side;                                   // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Main_ChildClear;                          // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Main_Child;                               // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Main_ChildClear;                        // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Main_Child;                             // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_MainClear;                                // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Main;                                     // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_MainClear;                              // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Main;                                   // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Category_Side;                                     // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Category_Main;                                     // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Chapter;                                  // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              BtnBase_Chapter;                                   // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase_Child;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase_Child_S;                                   // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase_Main;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase_Side2;                                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnHoverBase_Chapter;                              // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnHoverBase_Main;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnHoverBase_Side;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight2;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight2_Side;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItem_Cell_Light2_C*                    BtnLight3;                                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItem_Cell_Light2_C*                    BtnLight3_Side;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItem_Cell_Light2_C*                    BtnLight_Category_Title;                           // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItem_Cell_Light2_C*                    BtnLight_Chapter;                                  // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Category_Btn;                                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             EndButton_0;                                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_314;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Active;                                       // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Active2;                                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_MainStory;                                    // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_SideStory;                                    // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line00;                                            // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_1;                                       // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_2;                                       // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Side_Btn;                                          // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Story_Btn;                                         // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Story_Line;                                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Story_Line_2;                                      // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Story_Line_3;                                      // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Story_Line2;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Story_Line_Category;                               // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TitleBg;                                           // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Story_Cell_03_C">();
	}
	static class UStory_Cell_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStory_Cell_03_C>();
	}
};
static_assert(alignof(UStory_Cell_03_C) == 0x000008, "Wrong alignment on UStory_Cell_03_C");
static_assert(sizeof(UStory_Cell_03_C) == 0x0005E8, "Wrong size on UStory_Cell_03_C");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Main_Child3Close) == 0x0003C8, "Member 'UStory_Cell_03_C::BtnHover_Main_Child3Close' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Main_Child3Close) == 0x0003D0, "Member 'UStory_Cell_03_C::BtnUnHover_Main_Child3Close' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Main_ChildClose) == 0x0003D8, "Member 'UStory_Cell_03_C::BtnHover_Main_ChildClose' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Main_ChildClose) == 0x0003E0, "Member 'UStory_Cell_03_C::BtnUnHover_Main_ChildClose' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Main_Child3Clear) == 0x0003E8, "Member 'UStory_Cell_03_C::BtnHover_Main_Child3Clear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Main_Child3) == 0x0003F0, "Member 'UStory_Cell_03_C::BtnHover_Main_Child3' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Main_Child3Clear) == 0x0003F8, "Member 'UStory_Cell_03_C::BtnUnHover_Main_Child3Clear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Main_Child3) == 0x000400, "Member 'UStory_Cell_03_C::BtnUnHover_Main_Child3' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Main_Child2Clear) == 0x000408, "Member 'UStory_Cell_03_C::BtnHover_Main_Child2Clear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Main_Child2) == 0x000410, "Member 'UStory_Cell_03_C::BtnHover_Main_Child2' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Main_Child2Clear) == 0x000418, "Member 'UStory_Cell_03_C::BtnUnHover_Main_Child2Clear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Main_Child2) == 0x000420, "Member 'UStory_Cell_03_C::BtnUnHover_Main_Child2' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, CharaName_Active) == 0x000428, "Member 'UStory_Cell_03_C::CharaName_Active' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, CharaName) == 0x000430, "Member 'UStory_Cell_03_C::CharaName' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Category_Side) == 0x000438, "Member 'UStory_Cell_03_C::BtnHover_Category_Side' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Category_Main) == 0x000440, "Member 'UStory_Cell_03_C::BtnHover_Category_Main' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_SideClosed) == 0x000448, "Member 'UStory_Cell_03_C::BtnHover_SideClosed' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_SideClosed) == 0x000450, "Member 'UStory_Cell_03_C::BtnUnHover_SideClosed' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Chapter) == 0x000458, "Member 'UStory_Cell_03_C::BtnUnHover_Chapter' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_SideClear) == 0x000460, "Member 'UStory_Cell_03_C::BtnHover_SideClear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Side) == 0x000468, "Member 'UStory_Cell_03_C::BtnHover_Side' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_SideClear) == 0x000470, "Member 'UStory_Cell_03_C::BtnUnHover_SideClear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Side) == 0x000478, "Member 'UStory_Cell_03_C::BtnUnHover_Side' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Main_ChildClear) == 0x000480, "Member 'UStory_Cell_03_C::BtnHover_Main_ChildClear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Main_Child) == 0x000488, "Member 'UStory_Cell_03_C::BtnHover_Main_Child' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Main_ChildClear) == 0x000490, "Member 'UStory_Cell_03_C::BtnUnHover_Main_ChildClear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Main_Child) == 0x000498, "Member 'UStory_Cell_03_C::BtnUnHover_Main_Child' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_MainClear) == 0x0004A0, "Member 'UStory_Cell_03_C::BtnHover_MainClear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Main) == 0x0004A8, "Member 'UStory_Cell_03_C::BtnHover_Main' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_MainClear) == 0x0004B0, "Member 'UStory_Cell_03_C::BtnUnHover_MainClear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Main) == 0x0004B8, "Member 'UStory_Cell_03_C::BtnUnHover_Main' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Category_Side) == 0x0004C0, "Member 'UStory_Cell_03_C::Category_Side' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Category_Main) == 0x0004C8, "Member 'UStory_Cell_03_C::Category_Main' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Chapter) == 0x0004D0, "Member 'UStory_Cell_03_C::BtnHover_Chapter' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnBase_Chapter) == 0x0004D8, "Member 'UStory_Cell_03_C::BtnBase_Chapter' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnBase_Child) == 0x0004E0, "Member 'UStory_Cell_03_C::BtnBase_Child' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnBase_Child_S) == 0x0004E8, "Member 'UStory_Cell_03_C::BtnBase_Child_S' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnBase_Main) == 0x0004F0, "Member 'UStory_Cell_03_C::BtnBase_Main' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnBase_Side2) == 0x0004F8, "Member 'UStory_Cell_03_C::BtnBase_Side2' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHoverBase_Chapter) == 0x000500, "Member 'UStory_Cell_03_C::BtnHoverBase_Chapter' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHoverBase_Main) == 0x000508, "Member 'UStory_Cell_03_C::BtnHoverBase_Main' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHoverBase_Side) == 0x000510, "Member 'UStory_Cell_03_C::BtnHoverBase_Side' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnLight2) == 0x000518, "Member 'UStory_Cell_03_C::BtnLight2' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnLight2_Side) == 0x000520, "Member 'UStory_Cell_03_C::BtnLight2_Side' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnLight3) == 0x000528, "Member 'UStory_Cell_03_C::BtnLight3' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnLight3_Side) == 0x000530, "Member 'UStory_Cell_03_C::BtnLight3_Side' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnLight_Category_Title) == 0x000538, "Member 'UStory_Cell_03_C::BtnLight_Category_Title' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnLight_Chapter) == 0x000540, "Member 'UStory_Cell_03_C::BtnLight_Chapter' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Category_Btn) == 0x000548, "Member 'UStory_Cell_03_C::Category_Btn' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, EndButton_0) == 0x000550, "Member 'UStory_Cell_03_C::EndButton_0' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, EndImage_314) == 0x000558, "Member 'UStory_Cell_03_C::EndImage_314' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Icon_Active) == 0x000560, "Member 'UStory_Cell_03_C::Icon_Active' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Icon_Active2) == 0x000568, "Member 'UStory_Cell_03_C::Icon_Active2' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Icon_MainStory) == 0x000570, "Member 'UStory_Cell_03_C::Icon_MainStory' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Icon_SideStory) == 0x000578, "Member 'UStory_Cell_03_C::Icon_SideStory' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Line00) == 0x000580, "Member 'UStory_Cell_03_C::Line00' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, ListPoint_1) == 0x000588, "Member 'UStory_Cell_03_C::ListPoint_1' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, ListPoint_2) == 0x000590, "Member 'UStory_Cell_03_C::ListPoint_2' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, MainMenu_Btn) == 0x000598, "Member 'UStory_Cell_03_C::MainMenu_Btn' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Side_Btn) == 0x0005A0, "Member 'UStory_Cell_03_C::Side_Btn' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Story_Btn) == 0x0005A8, "Member 'UStory_Cell_03_C::Story_Btn' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Story_Line) == 0x0005B0, "Member 'UStory_Cell_03_C::Story_Line' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Story_Line_2) == 0x0005B8, "Member 'UStory_Cell_03_C::Story_Line_2' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Story_Line_3) == 0x0005C0, "Member 'UStory_Cell_03_C::Story_Line_3' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Story_Line2) == 0x0005C8, "Member 'UStory_Cell_03_C::Story_Line2' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Story_Line_Category) == 0x0005D0, "Member 'UStory_Cell_03_C::Story_Line_Category' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, TitleBg) == 0x0005D8, "Member 'UStory_Cell_03_C::TitleBg' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Txt_Title) == 0x0005E0, "Member 'UStory_Cell_03_C::Txt_Title' has a wrong offset!");

}

