#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Story_ChapterInfo

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Story_ChapterInfo.Story_ChapterInfo_C
// 0x0040 (0x0408 - 0x03C8)
class UStory_ChapterInfo_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Menu_In;                                           // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_1;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_2;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_3;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_SideImg;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_170;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Story_ChapterInfo_C">();
	}
	static class UStory_ChapterInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStory_ChapterInfo_C>();
	}
};
static_assert(alignof(UStory_ChapterInfo_C) == 0x000008, "Wrong alignment on UStory_ChapterInfo_C");
static_assert(sizeof(UStory_ChapterInfo_C) == 0x000408, "Wrong size on UStory_ChapterInfo_C");
static_assert(offsetof(UStory_ChapterInfo_C, Menu_In) == 0x0003C8, "Member 'UStory_ChapterInfo_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UStory_ChapterInfo_C, Base1) == 0x0003D0, "Member 'UStory_ChapterInfo_C::Base1' has a wrong offset!");
static_assert(offsetof(UStory_ChapterInfo_C, Base1_1) == 0x0003D8, "Member 'UStory_ChapterInfo_C::Base1_1' has a wrong offset!");
static_assert(offsetof(UStory_ChapterInfo_C, Base1_2) == 0x0003E0, "Member 'UStory_ChapterInfo_C::Base1_2' has a wrong offset!");
static_assert(offsetof(UStory_ChapterInfo_C, Base1_3) == 0x0003E8, "Member 'UStory_ChapterInfo_C::Base1_3' has a wrong offset!");
static_assert(offsetof(UStory_ChapterInfo_C, Billboard_SideImg) == 0x0003F0, "Member 'UStory_ChapterInfo_C::Billboard_SideImg' has a wrong offset!");
static_assert(offsetof(UStory_ChapterInfo_C, EndImage) == 0x0003F8, "Member 'UStory_ChapterInfo_C::EndImage' has a wrong offset!");
static_assert(offsetof(UStory_ChapterInfo_C, EndImage_170) == 0x000400, "Member 'UStory_ChapterInfo_C::EndImage_170' has a wrong offset!");

}

