#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Summon_GaugeHead

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Summon_GaugeHead.Summon_GaugeHead_C
// 0x0020 (0x03E8 - 0x03C8)
class USummon_GaugeHead_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Loop;                                              // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_00;                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Light_Vertical_00;                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Light_Horizontal_00;                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Summon_GaugeHead_C">();
	}
	static class USummon_GaugeHead_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USummon_GaugeHead_C>();
	}
};
static_assert(alignof(USummon_GaugeHead_C) == 0x000008, "Wrong alignment on USummon_GaugeHead_C");
static_assert(sizeof(USummon_GaugeHead_C) == 0x0003E8, "Wrong size on USummon_GaugeHead_C");
static_assert(offsetof(USummon_GaugeHead_C, Loop) == 0x0003C8, "Member 'USummon_GaugeHead_C::Loop' has a wrong offset!");
static_assert(offsetof(USummon_GaugeHead_C, Img_Effect_Particle_00) == 0x0003D0, "Member 'USummon_GaugeHead_C::Img_Effect_Particle_00' has a wrong offset!");
static_assert(offsetof(USummon_GaugeHead_C, Img_Light_Vertical_00) == 0x0003D8, "Member 'USummon_GaugeHead_C::Img_Light_Vertical_00' has a wrong offset!");
static_assert(offsetof(USummon_GaugeHead_C, Ims_Light_Horizontal_00) == 0x0003E0, "Member 'USummon_GaugeHead_C::Ims_Light_Horizontal_00' has a wrong offset!");

}

