#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SummonChantGauge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SummonChantGauge.SummonChantGauge_C
// 0x0090 (0x0458 - 0x03C8)
class USummonChantGauge_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Gauge_In;                                          // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Cancel_Out;                                        // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Execution;                                         // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Full_Loop;                                         // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_SummonTime;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_SummonTime2;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USummon_GaugeHead_C*                    GaugeHead;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_00;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_01;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Add;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_02;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_00;                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_GaugeBase;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Light_Vertical_00;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Light_Horizontal_00;                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SummonChantGauge(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SummonChantGauge_C">();
	}
	static class USummonChantGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USummonChantGauge_C>();
	}
};
static_assert(alignof(USummonChantGauge_C) == 0x000008, "Wrong alignment on USummonChantGauge_C");
static_assert(sizeof(USummonChantGauge_C) == 0x000458, "Wrong size on USummonChantGauge_C");
static_assert(offsetof(USummonChantGauge_C, UberGraphFrame) == 0x0003C8, "Member 'USummonChantGauge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, Gauge_In) == 0x0003D0, "Member 'USummonChantGauge_C::Gauge_In' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, Cancel_Out) == 0x0003D8, "Member 'USummonChantGauge_C::Cancel_Out' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, Execution) == 0x0003E0, "Member 'USummonChantGauge_C::Execution' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, Full_Loop) == 0x0003E8, "Member 'USummonChantGauge_C::Full_Loop' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, In) == 0x0003F0, "Member 'USummonChantGauge_C::In' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, Gauge_SummonTime) == 0x0003F8, "Member 'USummonChantGauge_C::Gauge_SummonTime' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, Gauge_SummonTime2) == 0x000400, "Member 'USummonChantGauge_C::Gauge_SummonTime2' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, GaugeHead) == 0x000408, "Member 'USummonChantGauge_C::GaugeHead' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, Img_Base_00) == 0x000410, "Member 'USummonChantGauge_C::Img_Base_00' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, Img_Base_01) == 0x000418, "Member 'USummonChantGauge_C::Img_Base_01' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, Img_Base_Add) == 0x000420, "Member 'USummonChantGauge_C::Img_Base_Add' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, Img_Effect_01) == 0x000428, "Member 'USummonChantGauge_C::Img_Effect_01' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, Img_Effect_02) == 0x000430, "Member 'USummonChantGauge_C::Img_Effect_02' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, Img_Effect_Particle_00) == 0x000438, "Member 'USummonChantGauge_C::Img_Effect_Particle_00' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, Img_GaugeBase) == 0x000440, "Member 'USummonChantGauge_C::Img_GaugeBase' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, Img_Light_Vertical_00) == 0x000448, "Member 'USummonChantGauge_C::Img_Light_Vertical_00' has a wrong offset!");
static_assert(offsetof(USummonChantGauge_C, Ims_Light_Horizontal_00) == 0x000450, "Member 'USummonChantGauge_C::Ims_Light_Horizontal_00' has a wrong offset!");

}

