#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SummonTimeGauge

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SummonTimeGauge.SummonTimeGauge_C
// 0x0058 (0x04D0 - 0x0478)
class USummonTimeGauge_C final : public UEndBattleSummonGaugeIcon
{
public:
	class UWidgetAnimation*                       LossTime;                                          // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Effect_00;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Gauge_00;                                   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_Gauge_01;                                   // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_SummonTime;                                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base;                                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_GaugeBase;                                     // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Light_Horizontal_00;                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SummonTimeGauge_C">();
	}
	static class USummonTimeGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USummonTimeGauge_C>();
	}
};
static_assert(alignof(USummonTimeGauge_C) == 0x000008, "Wrong alignment on USummonTimeGauge_C");
static_assert(sizeof(USummonTimeGauge_C) == 0x0004D0, "Wrong size on USummonTimeGauge_C");
static_assert(offsetof(USummonTimeGauge_C, LossTime) == 0x000478, "Member 'USummonTimeGauge_C::LossTime' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, Out) == 0x000480, "Member 'USummonTimeGauge_C::Out' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, Loop) == 0x000488, "Member 'USummonTimeGauge_C::Loop' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, In) == 0x000490, "Member 'USummonTimeGauge_C::In' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, Effect_00) == 0x000498, "Member 'USummonTimeGauge_C::Effect_00' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, Effect_Gauge_00) == 0x0004A0, "Member 'USummonTimeGauge_C::Effect_Gauge_00' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, Effect_Gauge_01) == 0x0004A8, "Member 'USummonTimeGauge_C::Effect_Gauge_01' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, Gauge_SummonTime) == 0x0004B0, "Member 'USummonTimeGauge_C::Gauge_SummonTime' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, Img_Base) == 0x0004B8, "Member 'USummonTimeGauge_C::Img_Base' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, Img_GaugeBase) == 0x0004C0, "Member 'USummonTimeGauge_C::Img_GaugeBase' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, Img_Light_Horizontal_00) == 0x0004C8, "Member 'USummonTimeGauge_C::Img_Light_Horizontal_00' has a wrong offset!");

}

