#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TalkMenu_ItemList_Cell_01

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TalkMenu_ItemList_Cell_01.TalkMenu_ItemList_Cell_01_C
// 0x0070 (0x0438 - 0x03C8)
class UTalkMenu_ItemList_Cell_01_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Status_3;                                          // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Status_2;                                          // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Status_1;                                          // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Rank_Other;                                        // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Rank_1;                                            // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              BLACK;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              blue;                                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gradation;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Comlete;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_DecoLeft;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_DecoLeft_2;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_DecoRight;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_DecoRight_2;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ModeIcon;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TalkMenu_ItemList_Cell_01_C">();
	}
	static class UTalkMenu_ItemList_Cell_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTalkMenu_ItemList_Cell_01_C>();
	}
};
static_assert(alignof(UTalkMenu_ItemList_Cell_01_C) == 0x000008, "Wrong alignment on UTalkMenu_ItemList_Cell_01_C");
static_assert(sizeof(UTalkMenu_ItemList_Cell_01_C) == 0x000438, "Wrong size on UTalkMenu_ItemList_Cell_01_C");
static_assert(offsetof(UTalkMenu_ItemList_Cell_01_C, Status_3) == 0x0003C8, "Member 'UTalkMenu_ItemList_Cell_01_C::Status_3' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_01_C, Status_2) == 0x0003D0, "Member 'UTalkMenu_ItemList_Cell_01_C::Status_2' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_01_C, Status_1) == 0x0003D8, "Member 'UTalkMenu_ItemList_Cell_01_C::Status_1' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_01_C, Rank_Other) == 0x0003E0, "Member 'UTalkMenu_ItemList_Cell_01_C::Rank_Other' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_01_C, Rank_1) == 0x0003E8, "Member 'UTalkMenu_ItemList_Cell_01_C::Rank_1' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_01_C, BLACK) == 0x0003F0, "Member 'UTalkMenu_ItemList_Cell_01_C::BLACK' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_01_C, blue) == 0x0003F8, "Member 'UTalkMenu_ItemList_Cell_01_C::blue' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_01_C, Gradation) == 0x000400, "Member 'UTalkMenu_ItemList_Cell_01_C::Gradation' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_01_C, Icon_Comlete) == 0x000408, "Member 'UTalkMenu_ItemList_Cell_01_C::Icon_Comlete' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_01_C, Img_DecoLeft) == 0x000410, "Member 'UTalkMenu_ItemList_Cell_01_C::Img_DecoLeft' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_01_C, Img_DecoLeft_2) == 0x000418, "Member 'UTalkMenu_ItemList_Cell_01_C::Img_DecoLeft_2' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_01_C, Img_DecoRight) == 0x000420, "Member 'UTalkMenu_ItemList_Cell_01_C::Img_DecoRight' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_01_C, Img_DecoRight_2) == 0x000428, "Member 'UTalkMenu_ItemList_Cell_01_C::Img_DecoRight_2' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_01_C, ModeIcon) == 0x000430, "Member 'UTalkMenu_ItemList_Cell_01_C::ModeIcon' has a wrong offset!");

}

