#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TalkMenu_Center_Btn

#include "Basic.hpp"


namespace SDK::Params
{

// Function TalkMenu_Center_Btn.TalkMenu_Center_Btn_C.ExecuteUbergraph_TalkMenu_Center_Btn
// 0x0008 (0x0008 - 0x0000)
struct TalkMenu_Center_Btn_C_ExecuteUbergraph_TalkMenu_Center_Btn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_2;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_3;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TalkMenu_Center_Btn_C_ExecuteUbergraph_TalkMenu_Center_Btn) == 0x000004, "Wrong alignment on TalkMenu_Center_Btn_C_ExecuteUbergraph_TalkMenu_Center_Btn");
static_assert(sizeof(TalkMenu_Center_Btn_C_ExecuteUbergraph_TalkMenu_Center_Btn) == 0x000008, "Wrong size on TalkMenu_Center_Btn_C_ExecuteUbergraph_TalkMenu_Center_Btn");
static_assert(offsetof(TalkMenu_Center_Btn_C_ExecuteUbergraph_TalkMenu_Center_Btn, EntryPoint) == 0x000000, "Member 'TalkMenu_Center_Btn_C_ExecuteUbergraph_TalkMenu_Center_Btn::EntryPoint' has a wrong offset!");
static_assert(offsetof(TalkMenu_Center_Btn_C_ExecuteUbergraph_TalkMenu_Center_Btn, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'TalkMenu_Center_Btn_C_ExecuteUbergraph_TalkMenu_Center_Btn::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TalkMenu_Center_Btn_C_ExecuteUbergraph_TalkMenu_Center_Btn, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000005, "Member 'TalkMenu_Center_Btn_C_ExecuteUbergraph_TalkMenu_Center_Btn::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TalkMenu_Center_Btn_C_ExecuteUbergraph_TalkMenu_Center_Btn, CallFunc_PlayAnimationByName_ReturnValue_2) == 0x000006, "Member 'TalkMenu_Center_Btn_C_ExecuteUbergraph_TalkMenu_Center_Btn::CallFunc_PlayAnimationByName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TalkMenu_Center_Btn_C_ExecuteUbergraph_TalkMenu_Center_Btn, CallFunc_PlayAnimationByName_ReturnValue_3) == 0x000007, "Member 'TalkMenu_Center_Btn_C_ExecuteUbergraph_TalkMenu_Center_Btn::CallFunc_PlayAnimationByName_ReturnValue_3' has a wrong offset!");

}

