#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TalkMenu_ItemList_Cell_02

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TalkMenu_ItemList_Cell_02.TalkMenu_ItemList_Cell_02_C
// 0x0040 (0x0408 - 0x03C8)
class UTalkMenu_ItemList_Cell_02_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Status_4;                                          // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Status_3;                                          // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Status_2;                                          // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Status_1;                                          // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Icon_X_1;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_00;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Frame;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Light;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TalkMenu_ItemList_Cell_02_C">();
	}
	static class UTalkMenu_ItemList_Cell_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTalkMenu_ItemList_Cell_02_C>();
	}
};
static_assert(alignof(UTalkMenu_ItemList_Cell_02_C) == 0x000008, "Wrong alignment on UTalkMenu_ItemList_Cell_02_C");
static_assert(sizeof(UTalkMenu_ItemList_Cell_02_C) == 0x000408, "Wrong size on UTalkMenu_ItemList_Cell_02_C");
static_assert(offsetof(UTalkMenu_ItemList_Cell_02_C, Status_4) == 0x0003C8, "Member 'UTalkMenu_ItemList_Cell_02_C::Status_4' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_02_C, Status_3) == 0x0003D0, "Member 'UTalkMenu_ItemList_Cell_02_C::Status_3' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_02_C, Status_2) == 0x0003D8, "Member 'UTalkMenu_ItemList_Cell_02_C::Status_2' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_02_C, Status_1) == 0x0003E0, "Member 'UTalkMenu_ItemList_Cell_02_C::Status_1' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_02_C, Icon_X_1) == 0x0003E8, "Member 'UTalkMenu_ItemList_Cell_02_C::Icon_X_1' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_02_C, Img_Base_00) == 0x0003F0, "Member 'UTalkMenu_ItemList_Cell_02_C::Img_Base_00' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_02_C, Img_Frame) == 0x0003F8, "Member 'UTalkMenu_ItemList_Cell_02_C::Img_Frame' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_Cell_02_C, Img_Light) == 0x000400, "Member 'UTalkMenu_ItemList_Cell_02_C::Img_Light' has a wrong offset!");

}

