#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TalkMenu_Cell_00

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TalkMenu_Cell_00.TalkMenu_Cell_00_C
// 0x0058 (0x0420 - 0x03C8)
class UTalkMenu_Cell_00_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       NotSelected;                                       // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pressed;                                           // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_00;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Button_00;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_00;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_01;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_02;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_03;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_04;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TalkMenu_Cell_00_C">();
	}
	static class UTalkMenu_Cell_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTalkMenu_Cell_00_C>();
	}
};
static_assert(alignof(UTalkMenu_Cell_00_C) == 0x000008, "Wrong alignment on UTalkMenu_Cell_00_C");
static_assert(sizeof(UTalkMenu_Cell_00_C) == 0x000420, "Wrong size on UTalkMenu_Cell_00_C");
static_assert(offsetof(UTalkMenu_Cell_00_C, NotSelected) == 0x0003C8, "Member 'UTalkMenu_Cell_00_C::NotSelected' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Cell_00_C, Pressed) == 0x0003D0, "Member 'UTalkMenu_Cell_00_C::Pressed' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Cell_00_C, Hovered) == 0x0003D8, "Member 'UTalkMenu_Cell_00_C::Hovered' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Cell_00_C, Normal) == 0x0003E0, "Member 'UTalkMenu_Cell_00_C::Normal' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Cell_00_C, Base_00) == 0x0003E8, "Member 'UTalkMenu_Cell_00_C::Base_00' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Cell_00_C, Button_00) == 0x0003F0, "Member 'UTalkMenu_Cell_00_C::Button_00' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Cell_00_C, Effect_00) == 0x0003F8, "Member 'UTalkMenu_Cell_00_C::Effect_00' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Cell_00_C, Effect_01) == 0x000400, "Member 'UTalkMenu_Cell_00_C::Effect_01' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Cell_00_C, Effect_02) == 0x000408, "Member 'UTalkMenu_Cell_00_C::Effect_02' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Cell_00_C, Effect_03) == 0x000410, "Member 'UTalkMenu_Cell_00_C::Effect_03' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Cell_00_C, Effect_04) == 0x000418, "Member 'UTalkMenu_Cell_00_C::Effect_04' has a wrong offset!");

}

