#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TalkMenu_Center

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TalkMenu_Center.TalkMenu_Center_C
// 0x0068 (0x0430 - 0x03C8)
class UTalkMenu_Center_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndBorder*                             All_Nut_TalkMenu;                                  // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_TalkMenu;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BG;                                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Nut_List;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_TalkMenu;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTalkMenu_Center_Btn_C*                 Talk_Menu_Btn_00;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTalkMenu_Center_Btn_C*                 Talk_Menu_Btn_01;                                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTalkMenu_Center_Btn_C*                 Talk_Menu_Btn_02;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTalkMenu_Center_Btn_C*                 Talk_Menu_Btn_03;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TalkMenu_Center_C">();
	}
	static class UTalkMenu_Center_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTalkMenu_Center_C>();
	}
};
static_assert(alignof(UTalkMenu_Center_C) == 0x000008, "Wrong alignment on UTalkMenu_Center_C");
static_assert(sizeof(UTalkMenu_Center_C) == 0x000430, "Wrong size on UTalkMenu_Center_C");
static_assert(offsetof(UTalkMenu_Center_C, Out) == 0x0003C8, "Member 'UTalkMenu_Center_C::Out' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_C, Loop) == 0x0003D0, "Member 'UTalkMenu_Center_C::Loop' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_C, In) == 0x0003D8, "Member 'UTalkMenu_Center_C::In' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_C, All_Nut_TalkMenu) == 0x0003E0, "Member 'UTalkMenu_Center_C::All_Nut_TalkMenu' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_C, All_TalkMenu) == 0x0003E8, "Member 'UTalkMenu_Center_C::All_TalkMenu' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_C, Img_BG) == 0x0003F0, "Member 'UTalkMenu_Center_C::Img_BG' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_C, Nut_List) == 0x0003F8, "Member 'UTalkMenu_Center_C::Nut_List' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_C, Pnl_TalkMenu) == 0x000400, "Member 'UTalkMenu_Center_C::Pnl_TalkMenu' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_C, Talk_Menu_Btn_00) == 0x000408, "Member 'UTalkMenu_Center_C::Talk_Menu_Btn_00' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_C, Talk_Menu_Btn_01) == 0x000410, "Member 'UTalkMenu_Center_C::Talk_Menu_Btn_01' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_C, Talk_Menu_Btn_02) == 0x000418, "Member 'UTalkMenu_Center_C::Talk_Menu_Btn_02' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_C, Talk_Menu_Btn_03) == 0x000420, "Member 'UTalkMenu_Center_C::Talk_Menu_Btn_03' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_C, Txt_Title) == 0x000428, "Member 'UTalkMenu_Center_C::Txt_Title' has a wrong offset!");

}

