#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TalkMenu_ItemList_01

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TalkMenu_ItemList_01.TalkMenu_ItemList_01_C
// 0x0040 (0x0458 - 0x0418)
class UTalkMenu_ItemList_01_C final : public UEndMenuTalkItemRankList
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Star_01;                                           // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Star_02;                                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Star_03;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Star_04;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Star_05;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Star_06;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TalkMenu_ItemList_01_C">();
	}
	static class UTalkMenu_ItemList_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTalkMenu_ItemList_01_C>();
	}
};
static_assert(alignof(UTalkMenu_ItemList_01_C) == 0x000008, "Wrong alignment on UTalkMenu_ItemList_01_C");
static_assert(sizeof(UTalkMenu_ItemList_01_C) == 0x000458, "Wrong size on UTalkMenu_ItemList_01_C");
static_assert(offsetof(UTalkMenu_ItemList_01_C, Out) == 0x000418, "Member 'UTalkMenu_ItemList_01_C::Out' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_01_C, In) == 0x000420, "Member 'UTalkMenu_ItemList_01_C::In' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_01_C, Star_01) == 0x000428, "Member 'UTalkMenu_ItemList_01_C::Star_01' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_01_C, Star_02) == 0x000430, "Member 'UTalkMenu_ItemList_01_C::Star_02' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_01_C, Star_03) == 0x000438, "Member 'UTalkMenu_ItemList_01_C::Star_03' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_01_C, Star_04) == 0x000440, "Member 'UTalkMenu_ItemList_01_C::Star_04' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_01_C, Star_05) == 0x000448, "Member 'UTalkMenu_ItemList_01_C::Star_05' has a wrong offset!");
static_assert(offsetof(UTalkMenu_ItemList_01_C, Star_06) == 0x000450, "Member 'UTalkMenu_ItemList_01_C::Star_06' has a wrong offset!");

}

