#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Timer

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Timer.Timer_C
// 0x0168 (0x0530 - 0x03C8)
class UTimer_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Beat_Out;                                          // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Beat_Loop;                                         // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FailedOut;                                         // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CompletedOut;                                      // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTimer_Colon_C*                         Colon_M_S;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Colon_M_S_Eff;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTimer_Colon_C*                         Colon_S_ms;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Colon_S_ms_Eff;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Base;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Colon_M_S;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Colon_S_ms;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Num_010ms;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Num_01M;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Num_01S;                                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Num_100ms;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Num_10M;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Num_10S;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Hzbx_Number;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Hzbx_Number_Eff;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_00;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Blue;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Red;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Eff_Blue;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Eff_Red;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Mesh_Blue;                                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Mesh_Red;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTimer_Num_C*                           Num_010ms;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Num_010ms_Eff;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTimer_Num_C*                           Num_01M;                                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Num_01M_Eff;                                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTimer_Num_C*                           Num_01S;                                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Num_01S_Eff;                                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTimer_Num_C*                           Num_100ms;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Num_100ms_Eff;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTimer_Num_C*                           Num_10M;                                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Num_10M_Eff;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTimer_Num_C*                           Num_10S;                                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Num_10S_Eff;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Blue;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             Nut_Number;                                        // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             Nut_Number_Eff;                                    // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              Scbx_Number;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              Scbx_Number_Eff;                                   // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Timer_C">();
	}
	static class UTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTimer_C>();
	}
};
static_assert(alignof(UTimer_C) == 0x000008, "Wrong alignment on UTimer_C");
static_assert(sizeof(UTimer_C) == 0x000530, "Wrong size on UTimer_C");
static_assert(offsetof(UTimer_C, Beat_Out) == 0x0003C8, "Member 'UTimer_C::Beat_Out' has a wrong offset!");
static_assert(offsetof(UTimer_C, Beat_Loop) == 0x0003D0, "Member 'UTimer_C::Beat_Loop' has a wrong offset!");
static_assert(offsetof(UTimer_C, FailedOut) == 0x0003D8, "Member 'UTimer_C::FailedOut' has a wrong offset!");
static_assert(offsetof(UTimer_C, CompletedOut) == 0x0003E0, "Member 'UTimer_C::CompletedOut' has a wrong offset!");
static_assert(offsetof(UTimer_C, Loop) == 0x0003E8, "Member 'UTimer_C::Loop' has a wrong offset!");
static_assert(offsetof(UTimer_C, In) == 0x0003F0, "Member 'UTimer_C::In' has a wrong offset!");
static_assert(offsetof(UTimer_C, Colon_M_S) == 0x0003F8, "Member 'UTimer_C::Colon_M_S' has a wrong offset!");
static_assert(offsetof(UTimer_C, Colon_M_S_Eff) == 0x000400, "Member 'UTimer_C::Colon_M_S_Eff' has a wrong offset!");
static_assert(offsetof(UTimer_C, Colon_S_ms) == 0x000408, "Member 'UTimer_C::Colon_S_ms' has a wrong offset!");
static_assert(offsetof(UTimer_C, Colon_S_ms_Eff) == 0x000410, "Member 'UTimer_C::Colon_S_ms_Eff' has a wrong offset!");
static_assert(offsetof(UTimer_C, Glow_Base) == 0x000418, "Member 'UTimer_C::Glow_Base' has a wrong offset!");
static_assert(offsetof(UTimer_C, Glow_Colon_M_S) == 0x000420, "Member 'UTimer_C::Glow_Colon_M_S' has a wrong offset!");
static_assert(offsetof(UTimer_C, Glow_Colon_S_ms) == 0x000428, "Member 'UTimer_C::Glow_Colon_S_ms' has a wrong offset!");
static_assert(offsetof(UTimer_C, Glow_Num_010ms) == 0x000430, "Member 'UTimer_C::Glow_Num_010ms' has a wrong offset!");
static_assert(offsetof(UTimer_C, Glow_Num_01M) == 0x000438, "Member 'UTimer_C::Glow_Num_01M' has a wrong offset!");
static_assert(offsetof(UTimer_C, Glow_Num_01S) == 0x000440, "Member 'UTimer_C::Glow_Num_01S' has a wrong offset!");
static_assert(offsetof(UTimer_C, Glow_Num_100ms) == 0x000448, "Member 'UTimer_C::Glow_Num_100ms' has a wrong offset!");
static_assert(offsetof(UTimer_C, Glow_Num_10M) == 0x000450, "Member 'UTimer_C::Glow_Num_10M' has a wrong offset!");
static_assert(offsetof(UTimer_C, Glow_Num_10S) == 0x000458, "Member 'UTimer_C::Glow_Num_10S' has a wrong offset!");
static_assert(offsetof(UTimer_C, Hzbx_Number) == 0x000460, "Member 'UTimer_C::Hzbx_Number' has a wrong offset!");
static_assert(offsetof(UTimer_C, Hzbx_Number_Eff) == 0x000468, "Member 'UTimer_C::Hzbx_Number_Eff' has a wrong offset!");
static_assert(offsetof(UTimer_C, Img_Base_00) == 0x000470, "Member 'UTimer_C::Img_Base_00' has a wrong offset!");
static_assert(offsetof(UTimer_C, Img_Base_Blue) == 0x000478, "Member 'UTimer_C::Img_Base_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_C, Img_Base_Red) == 0x000480, "Member 'UTimer_C::Img_Base_Red' has a wrong offset!");
static_assert(offsetof(UTimer_C, Img_Eff_Blue) == 0x000488, "Member 'UTimer_C::Img_Eff_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_C, Img_Eff_Red) == 0x000490, "Member 'UTimer_C::Img_Eff_Red' has a wrong offset!");
static_assert(offsetof(UTimer_C, Img_Mesh_Blue) == 0x000498, "Member 'UTimer_C::Img_Mesh_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_C, Img_Mesh_Red) == 0x0004A0, "Member 'UTimer_C::Img_Mesh_Red' has a wrong offset!");
static_assert(offsetof(UTimer_C, Num_010ms) == 0x0004A8, "Member 'UTimer_C::Num_010ms' has a wrong offset!");
static_assert(offsetof(UTimer_C, Num_010ms_Eff) == 0x0004B0, "Member 'UTimer_C::Num_010ms_Eff' has a wrong offset!");
static_assert(offsetof(UTimer_C, Num_01M) == 0x0004B8, "Member 'UTimer_C::Num_01M' has a wrong offset!");
static_assert(offsetof(UTimer_C, Num_01M_Eff) == 0x0004C0, "Member 'UTimer_C::Num_01M_Eff' has a wrong offset!");
static_assert(offsetof(UTimer_C, Num_01S) == 0x0004C8, "Member 'UTimer_C::Num_01S' has a wrong offset!");
static_assert(offsetof(UTimer_C, Num_01S_Eff) == 0x0004D0, "Member 'UTimer_C::Num_01S_Eff' has a wrong offset!");
static_assert(offsetof(UTimer_C, Num_100ms) == 0x0004D8, "Member 'UTimer_C::Num_100ms' has a wrong offset!");
static_assert(offsetof(UTimer_C, Num_100ms_Eff) == 0x0004E0, "Member 'UTimer_C::Num_100ms_Eff' has a wrong offset!");
static_assert(offsetof(UTimer_C, Num_10M) == 0x0004E8, "Member 'UTimer_C::Num_10M' has a wrong offset!");
static_assert(offsetof(UTimer_C, Num_10M_Eff) == 0x0004F0, "Member 'UTimer_C::Num_10M_Eff' has a wrong offset!");
static_assert(offsetof(UTimer_C, Num_10S) == 0x0004F8, "Member 'UTimer_C::Num_10S' has a wrong offset!");
static_assert(offsetof(UTimer_C, Num_10S_Eff) == 0x000500, "Member 'UTimer_C::Num_10S_Eff' has a wrong offset!");
static_assert(offsetof(UTimer_C, Nut_Blue) == 0x000508, "Member 'UTimer_C::Nut_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_C, Nut_Number) == 0x000510, "Member 'UTimer_C::Nut_Number' has a wrong offset!");
static_assert(offsetof(UTimer_C, Nut_Number_Eff) == 0x000518, "Member 'UTimer_C::Nut_Number_Eff' has a wrong offset!");
static_assert(offsetof(UTimer_C, Scbx_Number) == 0x000520, "Member 'UTimer_C::Scbx_Number' has a wrong offset!");
static_assert(offsetof(UTimer_C, Scbx_Number_Eff) == 0x000528, "Member 'UTimer_C::Scbx_Number_Eff' has a wrong offset!");

}

