#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Timer_Colon

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Timer_Colon.Timer_Colon_C
// 0x0028 (0x03F0 - 0x03C8)
class UTimer_Colon_C final : public UEndUserWidget
{
public:
	class UEndCanvasPanel*                        All_Timer_Colon;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Colon_Blue;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Colon_Red;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Blue;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Red;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Timer_Colon_C">();
	}
	static class UTimer_Colon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTimer_Colon_C>();
	}
};
static_assert(alignof(UTimer_Colon_C) == 0x000008, "Wrong alignment on UTimer_Colon_C");
static_assert(sizeof(UTimer_Colon_C) == 0x0003F0, "Wrong size on UTimer_Colon_C");
static_assert(offsetof(UTimer_Colon_C, All_Timer_Colon) == 0x0003C8, "Member 'UTimer_Colon_C::All_Timer_Colon' has a wrong offset!");
static_assert(offsetof(UTimer_Colon_C, Img_Colon_Blue) == 0x0003D0, "Member 'UTimer_Colon_C::Img_Colon_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_Colon_C, Img_Colon_Red) == 0x0003D8, "Member 'UTimer_Colon_C::Img_Colon_Red' has a wrong offset!");
static_assert(offsetof(UTimer_Colon_C, Nut_Blue) == 0x0003E0, "Member 'UTimer_Colon_C::Nut_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_Colon_C, Nut_Red) == 0x0003E8, "Member 'UTimer_Colon_C::Nut_Red' has a wrong offset!");

}

