#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopList_Cell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TopList_Cell.TopList_Cell_C
// 0x0078 (0x0440 - 0x03C8)
class UTopList_Cell_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       BtnHover;                                          // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_107;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_301;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gradation2_1;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Item_C*                           Icon_Item;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_TgsGuide;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_TgsGuide2_C*                      Icon_TgsGuide2;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconPoint;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_1;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_2;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TopList_Cell(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TopList_Cell_C">();
	}
	static class UTopList_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTopList_Cell_C>();
	}
};
static_assert(alignof(UTopList_Cell_C) == 0x000008, "Wrong alignment on UTopList_Cell_C");
static_assert(sizeof(UTopList_Cell_C) == 0x000440, "Wrong size on UTopList_Cell_C");
static_assert(offsetof(UTopList_Cell_C, UberGraphFrame) == 0x0003C8, "Member 'UTopList_Cell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTopList_Cell_C, BtnHover) == 0x0003D0, "Member 'UTopList_Cell_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UTopList_Cell_C, EndImage) == 0x0003D8, "Member 'UTopList_Cell_C::EndImage' has a wrong offset!");
static_assert(offsetof(UTopList_Cell_C, EndImage_107) == 0x0003E0, "Member 'UTopList_Cell_C::EndImage_107' has a wrong offset!");
static_assert(offsetof(UTopList_Cell_C, EndImage_301) == 0x0003E8, "Member 'UTopList_Cell_C::EndImage_301' has a wrong offset!");
static_assert(offsetof(UTopList_Cell_C, Gradation2_1) == 0x0003F0, "Member 'UTopList_Cell_C::Gradation2_1' has a wrong offset!");
static_assert(offsetof(UTopList_Cell_C, Icon_Item) == 0x0003F8, "Member 'UTopList_Cell_C::Icon_Item' has a wrong offset!");
static_assert(offsetof(UTopList_Cell_C, Icon_TgsGuide) == 0x000400, "Member 'UTopList_Cell_C::Icon_TgsGuide' has a wrong offset!");
static_assert(offsetof(UTopList_Cell_C, Icon_TgsGuide2) == 0x000408, "Member 'UTopList_Cell_C::Icon_TgsGuide2' has a wrong offset!");
static_assert(offsetof(UTopList_Cell_C, IconPoint) == 0x000410, "Member 'UTopList_Cell_C::IconPoint' has a wrong offset!");
static_assert(offsetof(UTopList_Cell_C, Img_BtnLight) == 0x000418, "Member 'UTopList_Cell_C::Img_BtnLight' has a wrong offset!");
static_assert(offsetof(UTopList_Cell_C, ListPoint_1) == 0x000420, "Member 'UTopList_Cell_C::ListPoint_1' has a wrong offset!");
static_assert(offsetof(UTopList_Cell_C, ListPoint_2) == 0x000428, "Member 'UTopList_Cell_C::ListPoint_2' has a wrong offset!");
static_assert(offsetof(UTopList_Cell_C, MainMenu_Btn) == 0x000430, "Member 'UTopList_Cell_C::MainMenu_Btn' has a wrong offset!");
static_assert(offsetof(UTopList_Cell_C, Txt_Title) == 0x000438, "Member 'UTopList_Cell_C::Txt_Title' has a wrong offset!");

}

