#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Torocco_Guide

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Torocco_Guide.Torocco_Guide_C
// 0x0018 (0x03E0 - 0x03C8)
class UTorocco_Guide_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Normal;                                            // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gray;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Torocco_Guide_C">();
	}
	static class UTorocco_Guide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTorocco_Guide_C>();
	}
};
static_assert(alignof(UTorocco_Guide_C) == 0x000008, "Wrong alignment on UTorocco_Guide_C");
static_assert(sizeof(UTorocco_Guide_C) == 0x0003E0, "Wrong size on UTorocco_Guide_C");
static_assert(offsetof(UTorocco_Guide_C, Normal) == 0x0003C8, "Member 'UTorocco_Guide_C::Normal' has a wrong offset!");
static_assert(offsetof(UTorocco_Guide_C, Gray) == 0x0003D0, "Member 'UTorocco_Guide_C::Gray' has a wrong offset!");
static_assert(offsetof(UTorocco_Guide_C, In) == 0x0003D8, "Member 'UTorocco_Guide_C::In' has a wrong offset!");

}

