#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Torocco_FieldTarget_Barret

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Torocco_FieldTarget_Barret.Torocco_FieldTarget_Barret_C
// 0x0038 (0x0400 - 0x03C8)
class UTorocco_FieldTarget_Barret_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Normal;                                            // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Shooting_Out;                                      // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Shooting_Loop;                                     // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Shooting_In;                                       // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Img_Shooting_00;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Shooting_01;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Shooting_02;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Torocco_FieldTarget_Barret_C">();
	}
	static class UTorocco_FieldTarget_Barret_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTorocco_FieldTarget_Barret_C>();
	}
};
static_assert(alignof(UTorocco_FieldTarget_Barret_C) == 0x000008, "Wrong alignment on UTorocco_FieldTarget_Barret_C");
static_assert(sizeof(UTorocco_FieldTarget_Barret_C) == 0x000400, "Wrong size on UTorocco_FieldTarget_Barret_C");
static_assert(offsetof(UTorocco_FieldTarget_Barret_C, Normal) == 0x0003C8, "Member 'UTorocco_FieldTarget_Barret_C::Normal' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Barret_C, Shooting_Out) == 0x0003D0, "Member 'UTorocco_FieldTarget_Barret_C::Shooting_Out' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Barret_C, Shooting_Loop) == 0x0003D8, "Member 'UTorocco_FieldTarget_Barret_C::Shooting_Loop' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Barret_C, Shooting_In) == 0x0003E0, "Member 'UTorocco_FieldTarget_Barret_C::Shooting_In' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Barret_C, Img_Shooting_00) == 0x0003E8, "Member 'UTorocco_FieldTarget_Barret_C::Img_Shooting_00' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Barret_C, Img_Shooting_01) == 0x0003F0, "Member 'UTorocco_FieldTarget_Barret_C::Img_Shooting_01' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Barret_C, Img_Shooting_02) == 0x0003F8, "Member 'UTorocco_FieldTarget_Barret_C::Img_Shooting_02' has a wrong offset!");

}

