#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Torocco_FieldTarget_Yuffie_Ring

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Torocco_FieldTarget_Yuffie_Ring.Torocco_FieldTarget_Yuffie_Ring_C
// 0x0018 (0x03F0 - 0x03D8)
class UTorocco_FieldTarget_Yuffie_Ring_C final : public UEndFieldTargetIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UEndImage*                              Img_05;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ring;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Torocco_FieldTarget_Yuffie_Ring(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Torocco_FieldTarget_Yuffie_Ring_C">();
	}
	static class UTorocco_FieldTarget_Yuffie_Ring_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTorocco_FieldTarget_Yuffie_Ring_C>();
	}
};
static_assert(alignof(UTorocco_FieldTarget_Yuffie_Ring_C) == 0x000008, "Wrong alignment on UTorocco_FieldTarget_Yuffie_Ring_C");
static_assert(sizeof(UTorocco_FieldTarget_Yuffie_Ring_C) == 0x0003F0, "Wrong size on UTorocco_FieldTarget_Yuffie_Ring_C");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_Ring_C, UberGraphFrame) == 0x0003D8, "Member 'UTorocco_FieldTarget_Yuffie_Ring_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_Ring_C, Img_05) == 0x0003E0, "Member 'UTorocco_FieldTarget_Yuffie_Ring_C::Img_05' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_Ring_C, Ring) == 0x0003E8, "Member 'UTorocco_FieldTarget_Yuffie_Ring_C::Ring' has a wrong offset!");

}

