#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Torocco_FieldTarget_Yuffie

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Torocco_FieldTarget_Yuffie.Torocco_FieldTarget_Yuffie_C
// 0x0070 (0x0448 - 0x03D8)
class UTorocco_FieldTarget_Yuffie_C final : public UEndFieldTargetIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       CorrectTiming;                                     // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Success;                                           // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gauge_01;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Btn;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_05;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_06;                                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_07;                                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ring;                                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Torocco_FieldTarget_Yuffie(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Torocco_FieldTarget_Yuffie_C">();
	}
	static class UTorocco_FieldTarget_Yuffie_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTorocco_FieldTarget_Yuffie_C>();
	}
};
static_assert(alignof(UTorocco_FieldTarget_Yuffie_C) == 0x000008, "Wrong alignment on UTorocco_FieldTarget_Yuffie_C");
static_assert(sizeof(UTorocco_FieldTarget_Yuffie_C) == 0x000448, "Wrong size on UTorocco_FieldTarget_Yuffie_C");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_C, UberGraphFrame) == 0x0003D8, "Member 'UTorocco_FieldTarget_Yuffie_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_C, CorrectTiming) == 0x0003E0, "Member 'UTorocco_FieldTarget_Yuffie_C::CorrectTiming' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_C, Success) == 0x0003E8, "Member 'UTorocco_FieldTarget_Yuffie_C::Success' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_C, Loop) == 0x0003F0, "Member 'UTorocco_FieldTarget_Yuffie_C::Loop' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_C, Out) == 0x0003F8, "Member 'UTorocco_FieldTarget_Yuffie_C::Out' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_C, In) == 0x000400, "Member 'UTorocco_FieldTarget_Yuffie_C::In' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_C, Base) == 0x000408, "Member 'UTorocco_FieldTarget_Yuffie_C::Base' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_C, Bg) == 0x000410, "Member 'UTorocco_FieldTarget_Yuffie_C::Bg' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_C, Gauge_01) == 0x000418, "Member 'UTorocco_FieldTarget_Yuffie_C::Gauge_01' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_C, Icon_Btn) == 0x000420, "Member 'UTorocco_FieldTarget_Yuffie_C::Icon_Btn' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_C, Img_05) == 0x000428, "Member 'UTorocco_FieldTarget_Yuffie_C::Img_05' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_C, Img_06) == 0x000430, "Member 'UTorocco_FieldTarget_Yuffie_C::Img_06' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_C, Img_07) == 0x000438, "Member 'UTorocco_FieldTarget_Yuffie_C::Img_07' has a wrong offset!");
static_assert(offsetof(UTorocco_FieldTarget_Yuffie_C, Ring) == 0x000440, "Member 'UTorocco_FieldTarget_Yuffie_C::Ring' has a wrong offset!");

}

