#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Two200_CORLA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 2200-CORLA.2200-CORLA_C
// 0x0020 (0x0250 - 0x0230)
class ATwo200_CORLA_C final : public AEndLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	int32                                         Progress;                                          // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndStreamingSwitchVolume*              Two200_StrmSwitchVolume_TimeSet_ExecuteUbergraph_2200_CORLA_RefProperty; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingSwitchVolume*              Two200_StrmSwitchVolume_TimeSet2_ExecuteUbergraph_2200_CORLA_RefProperty; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_2200_CORLA(int32 EntryPoint);
	void OnSetChapterProgress(int32 Value);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"2200-CORLA_C">();
	}
	static class ATwo200_CORLA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATwo200_CORLA_C>();
	}
};
static_assert(alignof(ATwo200_CORLA_C) == 0x000008, "Wrong alignment on ATwo200_CORLA_C");
static_assert(sizeof(ATwo200_CORLA_C) == 0x000250, "Wrong size on ATwo200_CORLA_C");
static_assert(offsetof(ATwo200_CORLA_C, UberGraphFrame) == 0x000230, "Member 'ATwo200_CORLA_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATwo200_CORLA_C, Progress) == 0x000238, "Member 'ATwo200_CORLA_C::Progress' has a wrong offset!");
static_assert(offsetof(ATwo200_CORLA_C, Two200_StrmSwitchVolume_TimeSet_ExecuteUbergraph_2200_CORLA_RefProperty) == 0x000240, "Member 'ATwo200_CORLA_C::Two200_StrmSwitchVolume_TimeSet_ExecuteUbergraph_2200_CORLA_RefProperty' has a wrong offset!");
static_assert(offsetof(ATwo200_CORLA_C, Two200_StrmSwitchVolume_TimeSet2_ExecuteUbergraph_2200_CORLA_RefProperty) == 0x000248, "Member 'ATwo200_CORLA_C::Two200_StrmSwitchVolume_TimeSet2_ExecuteUbergraph_2200_CORLA_RefProperty' has a wrong offset!");

}

