#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Two250_CORLM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 2250-CORLM.2250-CORLM_C
// 0x0018 (0x0248 - 0x0230)
class ATwo250_CORLM_C final : public AEndLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	int32                                         Progress;                                          // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndStreamingSwitchVolume*              Two250_StrmSwitchVolume_TimeSet_ExecuteUbergraph_2250_CORLM_RefProperty; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_2250_CORLM(int32 EntryPoint);
	void OnSetChapterProgress(int32 Value);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"2250-CORLM_C">();
	}
	static class ATwo250_CORLM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATwo250_CORLM_C>();
	}
};
static_assert(alignof(ATwo250_CORLM_C) == 0x000008, "Wrong alignment on ATwo250_CORLM_C");
static_assert(sizeof(ATwo250_CORLM_C) == 0x000248, "Wrong size on ATwo250_CORLM_C");
static_assert(offsetof(ATwo250_CORLM_C, UberGraphFrame) == 0x000230, "Member 'ATwo250_CORLM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATwo250_CORLM_C, Progress) == 0x000238, "Member 'ATwo250_CORLM_C::Progress' has a wrong offset!");
static_assert(offsetof(ATwo250_CORLM_C, Two250_StrmSwitchVolume_TimeSet_ExecuteUbergraph_2250_CORLM_RefProperty) == 0x000240, "Member 'ATwo250_CORLM_C::Two250_StrmSwitchVolume_TimeSet_ExecuteUbergraph_2250_CORLM_RefProperty' has a wrong offset!");

}

