#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Two250_CORLM

#include "Basic.hpp"


namespace SDK::Params
{

// Function 2250-CORLM.2250-CORLM_C.ExecuteUbergraph_2250-CORLM
// 0x0014 (0x0014 - 0x0000)
struct Two250_CORLM_C_ExecuteUbergraph_2250_CORLM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChapterProgress_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_value;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Two250_CORLM_C_ExecuteUbergraph_2250_CORLM) == 0x000004, "Wrong alignment on Two250_CORLM_C_ExecuteUbergraph_2250_CORLM");
static_assert(sizeof(Two250_CORLM_C_ExecuteUbergraph_2250_CORLM) == 0x000014, "Wrong size on Two250_CORLM_C_ExecuteUbergraph_2250_CORLM");
static_assert(offsetof(Two250_CORLM_C_ExecuteUbergraph_2250_CORLM, EntryPoint) == 0x000000, "Member 'Two250_CORLM_C_ExecuteUbergraph_2250_CORLM::EntryPoint' has a wrong offset!");
static_assert(offsetof(Two250_CORLM_C_ExecuteUbergraph_2250_CORLM, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'Two250_CORLM_C_ExecuteUbergraph_2250_CORLM::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Two250_CORLM_C_ExecuteUbergraph_2250_CORLM, CallFunc_GetChapterProgress_ReturnValue) == 0x000008, "Member 'Two250_CORLM_C_ExecuteUbergraph_2250_CORLM::CallFunc_GetChapterProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(Two250_CORLM_C_ExecuteUbergraph_2250_CORLM, K2Node_Event_value) == 0x00000C, "Member 'Two250_CORLM_C_ExecuteUbergraph_2250_CORLM::K2Node_Event_value' has a wrong offset!");
static_assert(offsetof(Two250_CORLM_C_ExecuteUbergraph_2250_CORLM, CallFunc_Less_IntInt_ReturnValue_1) == 0x000010, "Member 'Two250_CORLM_C_ExecuteUbergraph_2250_CORLM::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Two250_CORLM_C_ExecuteUbergraph_2250_CORLM, CallFunc_Less_IntInt_ReturnValue_2) == 0x000011, "Member 'Two250_CORLM_C_ExecuteUbergraph_2250_CORLM::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Two250_CORLM_C_ExecuteUbergraph_2250_CORLM, CallFunc_Less_IntInt_ReturnValue_3) == 0x000012, "Member 'Two250_CORLM_C_ExecuteUbergraph_2250_CORLM::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Two250_CORLM_C_ExecuteUbergraph_2250_CORLM, CallFunc_Less_IntInt_ReturnValue_4) == 0x000013, "Member 'Two250_CORLM_C_ExecuteUbergraph_2250_CORLM::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");

// Function 2250-CORLM.2250-CORLM_C.OnSetChapterProgress
// 0x0004 (0x0004 - 0x0000)
struct Two250_CORLM_C_OnSetChapterProgress final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Two250_CORLM_C_OnSetChapterProgress) == 0x000004, "Wrong alignment on Two250_CORLM_C_OnSetChapterProgress");
static_assert(sizeof(Two250_CORLM_C_OnSetChapterProgress) == 0x000004, "Wrong size on Two250_CORLM_C_OnSetChapterProgress");
static_assert(offsetof(Two250_CORLM_C_OnSetChapterProgress, Value) == 0x000000, "Member 'Two250_CORLM_C_OnSetChapterProgress::Value' has a wrong offset!");

}

