#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Two610_NIBLT_Before

#include "Basic.hpp"


namespace SDK::Params
{

// Function 2610-NIBLT_Before.2610-NIBLT_Before_C.ExecuteUbergraph_2610-NIBLT_Before
// 0x0038 (0x0038 - 0x0000)
struct Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStoryFlag_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChapterProgress_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_storyFlagId;                          // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_value_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_value;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_9;                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_10;               // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStoryFlag_ReturnValue_1;                // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStoryFlag_ReturnValue_2;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_11;               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_12;               // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_13;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChapterProgress_ReturnValue_1;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChapterProgress_ReturnValue_2;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before) == 0x000004, "Wrong alignment on Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before");
static_assert(sizeof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before) == 0x000038, "Wrong size on Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, EntryPoint) == 0x000000, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::EntryPoint' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_IsStoryFlag_ReturnValue) == 0x000004, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_IsStoryFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_GetChapterProgress_ReturnValue) == 0x000008, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_GetChapterProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, K2Node_Event_storyFlagId) == 0x00000C, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::K2Node_Event_storyFlagId' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, K2Node_Event_value_1) == 0x000014, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::K2Node_Event_value_1' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000015, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, K2Node_Event_value) == 0x000018, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::K2Node_Event_value' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_Less_IntInt_ReturnValue_1) == 0x00001D, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_Less_IntInt_ReturnValue_2) == 0x00001E, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_Less_IntInt_ReturnValue_3) == 0x00001F, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_Less_IntInt_ReturnValue_4) == 0x000020, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_Less_IntInt_ReturnValue_5) == 0x000021, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_Less_IntInt_ReturnValue_6) == 0x000022, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_Less_IntInt_ReturnValue_7) == 0x000023, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_Less_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_Less_IntInt_ReturnValue_8) == 0x000024, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_Less_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_Less_IntInt_ReturnValue_9) == 0x000025, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_Less_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_Less_IntInt_ReturnValue_10) == 0x000026, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_Less_IntInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_IsStoryFlag_ReturnValue_1) == 0x000027, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_IsStoryFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000028, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_IsStoryFlag_ReturnValue_2) == 0x000029, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_IsStoryFlag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_Less_IntInt_ReturnValue_11) == 0x00002A, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_Less_IntInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_Less_IntInt_ReturnValue_12) == 0x00002B, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_Less_IntInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_Less_IntInt_ReturnValue_13) == 0x00002C, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_Less_IntInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_GetChapterProgress_ReturnValue_1) == 0x000030, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_GetChapterProgress_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before, CallFunc_GetChapterProgress_ReturnValue_2) == 0x000034, "Member 'Two610_NIBLT_Before_C_ExecuteUbergraph_2610_NIBLT_Before::CallFunc_GetChapterProgress_ReturnValue_2' has a wrong offset!");

// Function 2610-NIBLT_Before.2610-NIBLT_Before_C.OnSetChapterProgress
// 0x0004 (0x0004 - 0x0000)
struct Two610_NIBLT_Before_C_OnSetChapterProgress final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Two610_NIBLT_Before_C_OnSetChapterProgress) == 0x000004, "Wrong alignment on Two610_NIBLT_Before_C_OnSetChapterProgress");
static_assert(sizeof(Two610_NIBLT_Before_C_OnSetChapterProgress) == 0x000004, "Wrong size on Two610_NIBLT_Before_C_OnSetChapterProgress");
static_assert(offsetof(Two610_NIBLT_Before_C_OnSetChapterProgress, Value) == 0x000000, "Member 'Two610_NIBLT_Before_C_OnSetChapterProgress::Value' has a wrong offset!");

// Function 2610-NIBLT_Before.2610-NIBLT_Before_C.OnSetStoryFlag
// 0x000C (0x000C - 0x0000)
struct Two610_NIBLT_Before_C_OnSetStoryFlag final
{
public:
	class FName                                   StoryFlagId;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Two610_NIBLT_Before_C_OnSetStoryFlag) == 0x000004, "Wrong alignment on Two610_NIBLT_Before_C_OnSetStoryFlag");
static_assert(sizeof(Two610_NIBLT_Before_C_OnSetStoryFlag) == 0x00000C, "Wrong size on Two610_NIBLT_Before_C_OnSetStoryFlag");
static_assert(offsetof(Two610_NIBLT_Before_C_OnSetStoryFlag, StoryFlagId) == 0x000000, "Member 'Two610_NIBLT_Before_C_OnSetStoryFlag::StoryFlagId' has a wrong offset!");
static_assert(offsetof(Two610_NIBLT_Before_C_OnSetStoryFlag, Value) == 0x000008, "Member 'Two610_NIBLT_Before_C_OnSetStoryFlag::Value' has a wrong offset!");

}

