#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Two660_NIBLM_Before

#include "Basic.hpp"


namespace SDK::Params
{

// Function 2660-NIBLM_Before.2660-NIBLM_Before_C.ExecuteUbergraph_2660-NIBLM_Before
// 0x002C (0x002C - 0x0000)
struct Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChapterProgress_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_value_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_9;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_10;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_11;               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_storyFlagId;                          // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_value;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStoryFlag_ReturnValue;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_12;               // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_13;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_14;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_15;               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before) == 0x000004, "Wrong alignment on Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before");
static_assert(sizeof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before) == 0x00002C, "Wrong size on Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, EntryPoint) == 0x000000, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::EntryPoint' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_GetChapterProgress_ReturnValue) == 0x000008, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_GetChapterProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, K2Node_Event_value_1) == 0x00000C, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::K2Node_Event_value_1' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue_1) == 0x000010, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue_2) == 0x000011, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue_3) == 0x000012, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue_4) == 0x000013, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue_5) == 0x000014, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue_6) == 0x000015, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue_7) == 0x000016, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue_8) == 0x000017, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue_9) == 0x000018, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue_10) == 0x000019, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue_11) == 0x00001A, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, K2Node_Event_storyFlagId) == 0x00001C, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::K2Node_Event_storyFlagId' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, K2Node_Event_value) == 0x000024, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::K2Node_Event_value' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000025, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_IsStoryFlag_ReturnValue) == 0x000026, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_IsStoryFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue_12) == 0x000027, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue_13) == 0x000028, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue_14) == 0x000029, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before, CallFunc_Less_IntInt_ReturnValue_15) == 0x00002A, "Member 'Two660_NIBLM_Before_C_ExecuteUbergraph_2660_NIBLM_Before::CallFunc_Less_IntInt_ReturnValue_15' has a wrong offset!");

// Function 2660-NIBLM_Before.2660-NIBLM_Before_C.OnSetStoryFlag
// 0x000C (0x000C - 0x0000)
struct Two660_NIBLM_Before_C_OnSetStoryFlag final
{
public:
	class FName                                   StoryFlagId;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Two660_NIBLM_Before_C_OnSetStoryFlag) == 0x000004, "Wrong alignment on Two660_NIBLM_Before_C_OnSetStoryFlag");
static_assert(sizeof(Two660_NIBLM_Before_C_OnSetStoryFlag) == 0x00000C, "Wrong size on Two660_NIBLM_Before_C_OnSetStoryFlag");
static_assert(offsetof(Two660_NIBLM_Before_C_OnSetStoryFlag, StoryFlagId) == 0x000000, "Member 'Two660_NIBLM_Before_C_OnSetStoryFlag::StoryFlagId' has a wrong offset!");
static_assert(offsetof(Two660_NIBLM_Before_C_OnSetStoryFlag, Value) == 0x000008, "Member 'Two660_NIBLM_Before_C_OnSetStoryFlag::Value' has a wrong offset!");

// Function 2660-NIBLM_Before.2660-NIBLM_Before_C.OnSetChapterProgress
// 0x0004 (0x0004 - 0x0000)
struct Two660_NIBLM_Before_C_OnSetChapterProgress final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Two660_NIBLM_Before_C_OnSetChapterProgress) == 0x000004, "Wrong alignment on Two660_NIBLM_Before_C_OnSetChapterProgress");
static_assert(sizeof(Two660_NIBLM_Before_C_OnSetChapterProgress) == 0x000004, "Wrong size on Two660_NIBLM_Before_C_OnSetChapterProgress");
static_assert(offsetof(Two660_NIBLM_Before_C_OnSetChapterProgress, Value) == 0x000000, "Member 'Two660_NIBLM_Before_C_OnSetChapterProgress::Value' has a wrong offset!");

}

