#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Two610_NIBLT_Before

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 2610-NIBLT_Before.2610-NIBLT_Before_C
// 0x0060 (0x0290 - 0x0230)
class ATwo610_NIBLT_Before_C final : public AEndLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class FName                                   Story_Flag_Id;                                     // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Story_Flag_Id_0;                                   // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Progress;                                          // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StoryFlagTimeSet;                                  // 0x024C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndStreamingVolume*                    Two610_StreamingVolume_NIBLT_Before_Terrain_HighSpec_ExecuteUbergraph_2610_NIBLT_Before_RefProperty; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingVolume*                    Two610_StreamingVolume_NIBLT_Before_Terrain_ExecuteUbergraph_2610_NIBLT_Before_RefProperty; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingVolume*                    Two610_StreamingVolume_NIBLT_BeforeFire_Terrain_ExecuteUbergraph_2610_NIBLT_Before_RefProperty; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndStreamingSwitchVolume*              Two610_StreamingSwitchVolume_TimeSet_ExecuteUbergraph_2610_NIBLT_Before_RefProperty; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingVolume*                    EndStrmVolume_Physics_AutoGenBefore_ExecuteUbergraph_2610_NIBLT_Before_RefProperty; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingGrid*                      Two610_NIBLT_Before_StreamVolume_GridPhys_ExecuteUbergraph_2610_NIBLT_Before_RefProperty; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingVolume*                    Two610_StreamingVolume_NIBLT_BeforeFire_Terrain_HighSpec_ExecuteUbergraph_2610_NIBLT_Before_RefProperty; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_2610_NIBLT_Before(int32 EntryPoint);
	void OnSetChapterProgress(int32 Value);
	void OnSetStoryFlag(class FName StoryFlagId, bool Value);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"2610-NIBLT_Before_C">();
	}
	static class ATwo610_NIBLT_Before_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATwo610_NIBLT_Before_C>();
	}
};
static_assert(alignof(ATwo610_NIBLT_Before_C) == 0x000008, "Wrong alignment on ATwo610_NIBLT_Before_C");
static_assert(sizeof(ATwo610_NIBLT_Before_C) == 0x000290, "Wrong size on ATwo610_NIBLT_Before_C");
static_assert(offsetof(ATwo610_NIBLT_Before_C, UberGraphFrame) == 0x000230, "Member 'ATwo610_NIBLT_Before_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATwo610_NIBLT_Before_C, Story_Flag_Id) == 0x000238, "Member 'ATwo610_NIBLT_Before_C::Story_Flag_Id' has a wrong offset!");
static_assert(offsetof(ATwo610_NIBLT_Before_C, Story_Flag_Id_0) == 0x000240, "Member 'ATwo610_NIBLT_Before_C::Story_Flag_Id_0' has a wrong offset!");
static_assert(offsetof(ATwo610_NIBLT_Before_C, Progress) == 0x000248, "Member 'ATwo610_NIBLT_Before_C::Progress' has a wrong offset!");
static_assert(offsetof(ATwo610_NIBLT_Before_C, StoryFlagTimeSet) == 0x00024C, "Member 'ATwo610_NIBLT_Before_C::StoryFlagTimeSet' has a wrong offset!");
static_assert(offsetof(ATwo610_NIBLT_Before_C, Two610_StreamingVolume_NIBLT_Before_Terrain_HighSpec_ExecuteUbergraph_2610_NIBLT_Before_RefProperty) == 0x000258, "Member 'ATwo610_NIBLT_Before_C::Two610_StreamingVolume_NIBLT_Before_Terrain_HighSpec_ExecuteUbergraph_2610_NIBLT_Before_RefProperty' has a wrong offset!");
static_assert(offsetof(ATwo610_NIBLT_Before_C, Two610_StreamingVolume_NIBLT_Before_Terrain_ExecuteUbergraph_2610_NIBLT_Before_RefProperty) == 0x000260, "Member 'ATwo610_NIBLT_Before_C::Two610_StreamingVolume_NIBLT_Before_Terrain_ExecuteUbergraph_2610_NIBLT_Before_RefProperty' has a wrong offset!");
static_assert(offsetof(ATwo610_NIBLT_Before_C, Two610_StreamingVolume_NIBLT_BeforeFire_Terrain_ExecuteUbergraph_2610_NIBLT_Before_RefProperty) == 0x000268, "Member 'ATwo610_NIBLT_Before_C::Two610_StreamingVolume_NIBLT_BeforeFire_Terrain_ExecuteUbergraph_2610_NIBLT_Before_RefProperty' has a wrong offset!");
static_assert(offsetof(ATwo610_NIBLT_Before_C, Two610_StreamingSwitchVolume_TimeSet_ExecuteUbergraph_2610_NIBLT_Before_RefProperty) == 0x000270, "Member 'ATwo610_NIBLT_Before_C::Two610_StreamingSwitchVolume_TimeSet_ExecuteUbergraph_2610_NIBLT_Before_RefProperty' has a wrong offset!");
static_assert(offsetof(ATwo610_NIBLT_Before_C, EndStrmVolume_Physics_AutoGenBefore_ExecuteUbergraph_2610_NIBLT_Before_RefProperty) == 0x000278, "Member 'ATwo610_NIBLT_Before_C::EndStrmVolume_Physics_AutoGenBefore_ExecuteUbergraph_2610_NIBLT_Before_RefProperty' has a wrong offset!");
static_assert(offsetof(ATwo610_NIBLT_Before_C, Two610_NIBLT_Before_StreamVolume_GridPhys_ExecuteUbergraph_2610_NIBLT_Before_RefProperty) == 0x000280, "Member 'ATwo610_NIBLT_Before_C::Two610_NIBLT_Before_StreamVolume_GridPhys_ExecuteUbergraph_2610_NIBLT_Before_RefProperty' has a wrong offset!");
static_assert(offsetof(ATwo610_NIBLT_Before_C, Two610_StreamingVolume_NIBLT_BeforeFire_Terrain_HighSpec_ExecuteUbergraph_2610_NIBLT_Before_RefProperty) == 0x000288, "Member 'ATwo610_NIBLT_Before_C::Two610_StreamingVolume_NIBLT_BeforeFire_Terrain_HighSpec_ExecuteUbergraph_2610_NIBLT_Before_RefProperty' has a wrong offset!");

}

