#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: U_Gyro_Top

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass U_Gyro_Top.U_Gyro_Top_C
// 0x0018 (0x03F0 - 0x03D8)
class UU_Gyro_Top_C final : public UEndMotionSensorIcon
{
public:
	class UWidgetAnimation*                       InOut2;                                            // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InOut;                                             // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UU_Gyro_Icon_C*                         U_Gyro_Icon;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"U_Gyro_Top_C">();
	}
	static class UU_Gyro_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UU_Gyro_Top_C>();
	}
};
static_assert(alignof(UU_Gyro_Top_C) == 0x000008, "Wrong alignment on UU_Gyro_Top_C");
static_assert(sizeof(UU_Gyro_Top_C) == 0x0003F0, "Wrong size on UU_Gyro_Top_C");
static_assert(offsetof(UU_Gyro_Top_C, InOut2) == 0x0003D8, "Member 'UU_Gyro_Top_C::InOut2' has a wrong offset!");
static_assert(offsetof(UU_Gyro_Top_C, InOut) == 0x0003E0, "Member 'UU_Gyro_Top_C::InOut' has a wrong offset!");
static_assert(offsetof(UU_Gyro_Top_C, U_Gyro_Icon) == 0x0003E8, "Member 'UU_Gyro_Top_C::U_Gyro_Icon' has a wrong offset!");

}

