#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VE0009_00_Chocobo_Standard

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass VE0009_00_Chocobo_Standard.VE0009_00_Chocobo_Standard_C
// 0x0020 (0x1A60 - 0x1A40)
class AVE0009_00_Chocobo_Standard_C : public AEndChocoboCharacter
{
public:
	class UEndBodySubCollisionSettingComponent*   EndBodySubCollisionSetting;                        // 0x1A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             EndBodyCollisionPrimitive1;                        // 0x1A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             EndBodyCollisionPrimitive;                         // 0x1A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VE0009_00_Chocobo_Standard_C">();
	}
	static class AVE0009_00_Chocobo_Standard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVE0009_00_Chocobo_Standard_C>();
	}
};
static_assert(alignof(AVE0009_00_Chocobo_Standard_C) == 0x000010, "Wrong alignment on AVE0009_00_Chocobo_Standard_C");
static_assert(sizeof(AVE0009_00_Chocobo_Standard_C) == 0x001A60, "Wrong size on AVE0009_00_Chocobo_Standard_C");
static_assert(offsetof(AVE0009_00_Chocobo_Standard_C, EndBodySubCollisionSetting) == 0x001A40, "Member 'AVE0009_00_Chocobo_Standard_C::EndBodySubCollisionSetting' has a wrong offset!");
static_assert(offsetof(AVE0009_00_Chocobo_Standard_C, EndBodyCollisionPrimitive1) == 0x001A48, "Member 'AVE0009_00_Chocobo_Standard_C::EndBodyCollisionPrimitive1' has a wrong offset!");
static_assert(offsetof(AVE0009_00_Chocobo_Standard_C, EndBodyCollisionPrimitive) == 0x001A50, "Member 'AVE0009_00_Chocobo_Standard_C::EndBodyCollisionPrimitive' has a wrong offset!");

}

