#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VE0027_00_ChocoboWagon_Standard

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass VE0027_00_ChocoboWagon_Standard.VE0027_00_ChocoboWagon_Standard_C
// 0x0020 (0x14F0 - 0x14D0)
class AVE0027_00_ChocoboWagon_Standard_C final : public AEndCharacterBase
{
public:
	uint8                                         Pad_14C8[0x8];                                     // 0x14C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UEndBodyCollisionPrimitive*             EndBodyCollisionPrimitive1;                        // 0x14D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBodyCollisionPrimitive*             EndBodyCollisionPrimitive;                         // 0x14D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBoneAttachComponent*                EndBoneAttachR;                                    // 0x14E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEndBoneAttachComponent*                EndBoneAttachL;                                    // 0x14E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VE0027_00_ChocoboWagon_Standard_C">();
	}
	static class AVE0027_00_ChocoboWagon_Standard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVE0027_00_ChocoboWagon_Standard_C>();
	}
};
static_assert(alignof(AVE0027_00_ChocoboWagon_Standard_C) == 0x000010, "Wrong alignment on AVE0027_00_ChocoboWagon_Standard_C");
static_assert(sizeof(AVE0027_00_ChocoboWagon_Standard_C) == 0x0014F0, "Wrong size on AVE0027_00_ChocoboWagon_Standard_C");
static_assert(offsetof(AVE0027_00_ChocoboWagon_Standard_C, EndBodyCollisionPrimitive1) == 0x0014D0, "Member 'AVE0027_00_ChocoboWagon_Standard_C::EndBodyCollisionPrimitive1' has a wrong offset!");
static_assert(offsetof(AVE0027_00_ChocoboWagon_Standard_C, EndBodyCollisionPrimitive) == 0x0014D8, "Member 'AVE0027_00_ChocoboWagon_Standard_C::EndBodyCollisionPrimitive' has a wrong offset!");
static_assert(offsetof(AVE0027_00_ChocoboWagon_Standard_C, EndBoneAttachR) == 0x0014E0, "Member 'AVE0027_00_ChocoboWagon_Standard_C::EndBoneAttachR' has a wrong offset!");
static_assert(offsetof(AVE0027_00_ChocoboWagon_Standard_C, EndBoneAttachL) == 0x0014E8, "Member 'AVE0027_00_ChocoboWagon_Standard_C::EndBoneAttachL' has a wrong offset!");

}

