#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VFXNiagara

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "Niagara_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "VFXNiagara_structs.hpp"


namespace SDK
{

// Class VFXNiagara.AnimNotifyState_VFXTimedNiagaraEffect
// 0x0050 (0x0080 - 0x0030)
class UAnimNotifyState_VFXTimedNiagaraEffect : public UAnimNotifyState
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_VFXTimedNiagaraEffect">();
	}
	static class UAnimNotifyState_VFXTimedNiagaraEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_VFXTimedNiagaraEffect>();
	}
};
static_assert(alignof(UAnimNotifyState_VFXTimedNiagaraEffect) == 0x000008, "Wrong alignment on UAnimNotifyState_VFXTimedNiagaraEffect");
static_assert(sizeof(UAnimNotifyState_VFXTimedNiagaraEffect) == 0x000080, "Wrong size on UAnimNotifyState_VFXTimedNiagaraEffect");

// Class VFXNiagara.VFXNiagaraActor
// 0x0000 (0x0238 - 0x0238)
class AVFXNiagaraActor : public ANiagaraActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VFXNiagaraActor">();
	}
	static class AVFXNiagaraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVFXNiagaraActor>();
	}
};
static_assert(alignof(AVFXNiagaraActor) == 0x000008, "Wrong alignment on AVFXNiagaraActor");
static_assert(sizeof(AVFXNiagaraActor) == 0x000238, "Wrong size on AVFXNiagaraActor");

// Class VFXNiagara.VFXNiagaraSubsystem
// 0x0008 (0x0038 - 0x0030)
class UVFXNiagaraSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VFXNiagaraSubsystem">();
	}
	static class UVFXNiagaraSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVFXNiagaraSubsystem>();
	}
};
static_assert(alignof(UVFXNiagaraSubsystem) == 0x000008, "Wrong alignment on UVFXNiagaraSubsystem");
static_assert(sizeof(UVFXNiagaraSubsystem) == 0x000038, "Wrong size on UVFXNiagaraSubsystem");

// Class VFXNiagara.VFXNiagaraDataInterfaceFunctionLibrary
// 0x0008 (0x0040 - 0x0038)
class UVFXNiagaraDataInterfaceFunctionLibrary final : public UNiagaraDataInterface
{
public:
	int32                                         m_Dummy;                                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VFXNiagaraDataInterfaceFunctionLibrary">();
	}
	static class UVFXNiagaraDataInterfaceFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVFXNiagaraDataInterfaceFunctionLibrary>();
	}
};
static_assert(alignof(UVFXNiagaraDataInterfaceFunctionLibrary) == 0x000008, "Wrong alignment on UVFXNiagaraDataInterfaceFunctionLibrary");
static_assert(sizeof(UVFXNiagaraDataInterfaceFunctionLibrary) == 0x000040, "Wrong size on UVFXNiagaraDataInterfaceFunctionLibrary");
static_assert(offsetof(UVFXNiagaraDataInterfaceFunctionLibrary, m_Dummy) == 0x000038, "Member 'UVFXNiagaraDataInterfaceFunctionLibrary::m_Dummy' has a wrong offset!");

// Class VFXNiagara.VFXNiagaraDataInterfaceMaterial
// 0x0020 (0x0058 - 0x0038)
class UVFXNiagaraDataInterfaceMaterial final : public UNiagaraDataInterface
{
public:
	struct FSoftObjectPath                        m_MaterialInstance;                                // 0x0038(0x0018)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_Dummy;                                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VFXNiagaraDataInterfaceMaterial">();
	}
	static class UVFXNiagaraDataInterfaceMaterial* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVFXNiagaraDataInterfaceMaterial>();
	}
};
static_assert(alignof(UVFXNiagaraDataInterfaceMaterial) == 0x000008, "Wrong alignment on UVFXNiagaraDataInterfaceMaterial");
static_assert(sizeof(UVFXNiagaraDataInterfaceMaterial) == 0x000058, "Wrong size on UVFXNiagaraDataInterfaceMaterial");
static_assert(offsetof(UVFXNiagaraDataInterfaceMaterial, m_MaterialInstance) == 0x000038, "Member 'UVFXNiagaraDataInterfaceMaterial::m_MaterialInstance' has a wrong offset!");
static_assert(offsetof(UVFXNiagaraDataInterfaceMaterial, m_Dummy) == 0x000050, "Member 'UVFXNiagaraDataInterfaceMaterial::m_Dummy' has a wrong offset!");

// Class VFXNiagara.VFXNiagaraDataInterfaceMaterialParameter
// 0x0058 (0x0090 - 0x0038)
class UVFXNiagaraDataInterfaceMaterialParameter final : public UNiagaraDataInterface
{
public:
	class FName                                   m_EmitterName;                                     // 0x0038(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   m_ModuleName;                                      // 0x0040(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   m_OverrideParameterName;                           // 0x0048(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      m_MaterialInstance;                                // 0x0050(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVFXMaterialScalarParameter>    m_ScalarParameters;                                // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FVFXMaterialVectorParameter>    m_VectorParameters;                                // 0x0068(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FVFXMaterialTextureParameter>   m_TextureParameters;                               // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VFXNiagaraDataInterfaceMaterialParameter">();
	}
	static class UVFXNiagaraDataInterfaceMaterialParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVFXNiagaraDataInterfaceMaterialParameter>();
	}
};
static_assert(alignof(UVFXNiagaraDataInterfaceMaterialParameter) == 0x000008, "Wrong alignment on UVFXNiagaraDataInterfaceMaterialParameter");
static_assert(sizeof(UVFXNiagaraDataInterfaceMaterialParameter) == 0x000090, "Wrong size on UVFXNiagaraDataInterfaceMaterialParameter");
static_assert(offsetof(UVFXNiagaraDataInterfaceMaterialParameter, m_EmitterName) == 0x000038, "Member 'UVFXNiagaraDataInterfaceMaterialParameter::m_EmitterName' has a wrong offset!");
static_assert(offsetof(UVFXNiagaraDataInterfaceMaterialParameter, m_ModuleName) == 0x000040, "Member 'UVFXNiagaraDataInterfaceMaterialParameter::m_ModuleName' has a wrong offset!");
static_assert(offsetof(UVFXNiagaraDataInterfaceMaterialParameter, m_OverrideParameterName) == 0x000048, "Member 'UVFXNiagaraDataInterfaceMaterialParameter::m_OverrideParameterName' has a wrong offset!");
static_assert(offsetof(UVFXNiagaraDataInterfaceMaterialParameter, m_MaterialInstance) == 0x000050, "Member 'UVFXNiagaraDataInterfaceMaterialParameter::m_MaterialInstance' has a wrong offset!");
static_assert(offsetof(UVFXNiagaraDataInterfaceMaterialParameter, m_ScalarParameters) == 0x000058, "Member 'UVFXNiagaraDataInterfaceMaterialParameter::m_ScalarParameters' has a wrong offset!");
static_assert(offsetof(UVFXNiagaraDataInterfaceMaterialParameter, m_VectorParameters) == 0x000068, "Member 'UVFXNiagaraDataInterfaceMaterialParameter::m_VectorParameters' has a wrong offset!");
static_assert(offsetof(UVFXNiagaraDataInterfaceMaterialParameter, m_TextureParameters) == 0x000078, "Member 'UVFXNiagaraDataInterfaceMaterialParameter::m_TextureParameters' has a wrong offset!");

// Class VFXNiagara.VFXNiagaraDataInterfaceNoiseCurve
// 0x0008 (0x0040 - 0x0038)
class UVFXNiagaraDataInterfaceNoiseCurve final : public UNiagaraDataInterface
{
public:
	float                                         m_fCycleTime;                                      // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VFXNiagaraDataInterfaceNoiseCurve">();
	}
	static class UVFXNiagaraDataInterfaceNoiseCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVFXNiagaraDataInterfaceNoiseCurve>();
	}
};
static_assert(alignof(UVFXNiagaraDataInterfaceNoiseCurve) == 0x000008, "Wrong alignment on UVFXNiagaraDataInterfaceNoiseCurve");
static_assert(sizeof(UVFXNiagaraDataInterfaceNoiseCurve) == 0x000040, "Wrong size on UVFXNiagaraDataInterfaceNoiseCurve");
static_assert(offsetof(UVFXNiagaraDataInterfaceNoiseCurve, m_fCycleTime) == 0x000038, "Member 'UVFXNiagaraDataInterfaceNoiseCurve::m_fCycleTime' has a wrong offset!");

// Class VFXNiagara.VFXNiagaraDataInterfaceSpawnEmitter
// 0x0000 (0x0038 - 0x0038)
class UVFXNiagaraDataInterfaceSpawnEmitter final : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VFXNiagaraDataInterfaceSpawnEmitter">();
	}
	static class UVFXNiagaraDataInterfaceSpawnEmitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVFXNiagaraDataInterfaceSpawnEmitter>();
	}
};
static_assert(alignof(UVFXNiagaraDataInterfaceSpawnEmitter) == 0x000008, "Wrong alignment on UVFXNiagaraDataInterfaceSpawnEmitter");
static_assert(sizeof(UVFXNiagaraDataInterfaceSpawnEmitter) == 0x000038, "Wrong size on UVFXNiagaraDataInterfaceSpawnEmitter");

}

