#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Vigilance_01

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Vigilance_01.Vigilance_01_C
// 0x0040 (0x0408 - 0x03C8)
class UVigilance_01_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Battle_In;                                         // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Arrow_00;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BG_00;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Effect_00;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_01;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Gauge_00;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Vigilance_01_C">();
	}
	static class UVigilance_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVigilance_01_C>();
	}
};
static_assert(alignof(UVigilance_01_C) == 0x000008, "Wrong alignment on UVigilance_01_C");
static_assert(sizeof(UVigilance_01_C) == 0x000408, "Wrong size on UVigilance_01_C");
static_assert(offsetof(UVigilance_01_C, Out) == 0x0003C8, "Member 'UVigilance_01_C::Out' has a wrong offset!");
static_assert(offsetof(UVigilance_01_C, Battle_In) == 0x0003D0, "Member 'UVigilance_01_C::Battle_In' has a wrong offset!");
static_assert(offsetof(UVigilance_01_C, In) == 0x0003D8, "Member 'UVigilance_01_C::In' has a wrong offset!");
static_assert(offsetof(UVigilance_01_C, Arrow_00) == 0x0003E0, "Member 'UVigilance_01_C::Arrow_00' has a wrong offset!");
static_assert(offsetof(UVigilance_01_C, BG_00) == 0x0003E8, "Member 'UVigilance_01_C::BG_00' has a wrong offset!");
static_assert(offsetof(UVigilance_01_C, Effect_00) == 0x0003F0, "Member 'UVigilance_01_C::Effect_00' has a wrong offset!");
static_assert(offsetof(UVigilance_01_C, Effect_01) == 0x0003F8, "Member 'UVigilance_01_C::Effect_01' has a wrong offset!");
static_assert(offsetof(UVigilance_01_C, Gauge_00) == 0x000400, "Member 'UVigilance_01_C::Gauge_00' has a wrong offset!");

}

