#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VR_ConfirmWindow

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VR_ConfirmWindow.VR_ConfirmWindow_C
// 0x0110 (0x0578 - 0x0468)
class UVR_ConfirmWindow_C final : public UEndColosseumConfirmWindow
{
public:
	class UWidgetAnimation*                       UnderShinraMansion;                                // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnderColiseumForQuest;                             // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnderColiseum;                                     // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GoldSaucerArena;                                   // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       VR;                                                // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Confirm_Continue;                                  // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Confirm_Retire;                                    // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Confirm_Retry;                                     // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Confirm_Start;                                     // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              BaseC1;                                            // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseC2;                                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseC3;                                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_3;                                        // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FrameC1;                                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FrameC2;                                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FrameC3;                                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconBase;                                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconFrame;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLineLeft;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLineRight;                                     // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LEFT;                                              // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           ListBgSet;                                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              RIGHT;                                             // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow;                                            // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Icon;                                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num1;                                          // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num2;                                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num3;                                          // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VR_ConfirmWindow_C">();
	}
	static class UVR_ConfirmWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVR_ConfirmWindow_C>();
	}
};
static_assert(alignof(UVR_ConfirmWindow_C) == 0x000008, "Wrong alignment on UVR_ConfirmWindow_C");
static_assert(sizeof(UVR_ConfirmWindow_C) == 0x000578, "Wrong size on UVR_ConfirmWindow_C");
static_assert(offsetof(UVR_ConfirmWindow_C, UnderShinraMansion) == 0x000468, "Member 'UVR_ConfirmWindow_C::UnderShinraMansion' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, UnderColiseumForQuest) == 0x000470, "Member 'UVR_ConfirmWindow_C::UnderColiseumForQuest' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, UnderColiseum) == 0x000478, "Member 'UVR_ConfirmWindow_C::UnderColiseum' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, GoldSaucerArena) == 0x000480, "Member 'UVR_ConfirmWindow_C::GoldSaucerArena' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, VR) == 0x000488, "Member 'UVR_ConfirmWindow_C::VR' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, Confirm_Continue) == 0x000490, "Member 'UVR_ConfirmWindow_C::Confirm_Continue' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, Confirm_Retire) == 0x000498, "Member 'UVR_ConfirmWindow_C::Confirm_Retire' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, Confirm_Retry) == 0x0004A0, "Member 'UVR_ConfirmWindow_C::Confirm_Retry' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, Confirm_Start) == 0x0004A8, "Member 'UVR_ConfirmWindow_C::Confirm_Start' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, Out) == 0x0004B0, "Member 'UVR_ConfirmWindow_C::Out' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, In) == 0x0004B8, "Member 'UVR_ConfirmWindow_C::In' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, BaseC1) == 0x0004C0, "Member 'UVR_ConfirmWindow_C::BaseC1' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, BaseC2) == 0x0004C8, "Member 'UVR_ConfirmWindow_C::BaseC2' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, BaseC3) == 0x0004D0, "Member 'UVR_ConfirmWindow_C::BaseC3' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, EndImage) == 0x0004D8, "Member 'UVR_ConfirmWindow_C::EndImage' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, EndImage_1) == 0x0004E0, "Member 'UVR_ConfirmWindow_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, EndImage_2) == 0x0004E8, "Member 'UVR_ConfirmWindow_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, EndImage_3) == 0x0004F0, "Member 'UVR_ConfirmWindow_C::EndImage_3' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, FrameC1) == 0x0004F8, "Member 'UVR_ConfirmWindow_C::FrameC1' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, FrameC2) == 0x000500, "Member 'UVR_ConfirmWindow_C::FrameC2' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, FrameC3) == 0x000508, "Member 'UVR_ConfirmWindow_C::FrameC3' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, IconBase) == 0x000510, "Member 'UVR_ConfirmWindow_C::IconBase' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, IconFrame) == 0x000518, "Member 'UVR_ConfirmWindow_C::IconFrame' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, IconLineLeft) == 0x000520, "Member 'UVR_ConfirmWindow_C::IconLineLeft' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, IconLineRight) == 0x000528, "Member 'UVR_ConfirmWindow_C::IconLineRight' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, LEFT) == 0x000530, "Member 'UVR_ConfirmWindow_C::LEFT' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, Light) == 0x000538, "Member 'UVR_ConfirmWindow_C::Light' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, ListBgSet) == 0x000540, "Member 'UVR_ConfirmWindow_C::ListBgSet' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, RIGHT) == 0x000548, "Member 'UVR_ConfirmWindow_C::RIGHT' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, Shadow) == 0x000550, "Member 'UVR_ConfirmWindow_C::Shadow' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, Title_Icon) == 0x000558, "Member 'UVR_ConfirmWindow_C::Title_Icon' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, Txt_Num1) == 0x000560, "Member 'UVR_ConfirmWindow_C::Txt_Num1' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, Txt_Num2) == 0x000568, "Member 'UVR_ConfirmWindow_C::Txt_Num2' has a wrong offset!");
static_assert(offsetof(UVR_ConfirmWindow_C, Txt_Num3) == 0x000570, "Member 'UVR_ConfirmWindow_C::Txt_Num3' has a wrong offset!");

}

