#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VR_Result

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VR_Result.VR_Result_C
// 0x0138 (0x05C0 - 0x0488)
class UVR_Result_C final : public UEndColosseumResultMenu
{
public:
	class UWidgetAnimation*                       UnderShinraMansion;                                // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnderColiseumForQuest;                             // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnderColiseum;                                     // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GoldSaucerArena;                                   // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       VR;                                                // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       New_Loop;                                          // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_Out;                                          // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Failed_In;                                         // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Clear_In;                                          // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BlackBase;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_3;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          EndTextBlock_11;                                   // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              G1_Base1;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Item_C*                           Icon_Item_1;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Item_C*                           Icon_Item_2;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Item_C*                           Icon_Item_3;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_X_G1_;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_X_G2_;                                        // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_X_G3_;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light1;                                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light2;                                            // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light3;                                            // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           ListBgSet;                                         // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           LogoSet;                                           // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              RankBase;                                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TitleLight;                                        // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TtileLine;                                         // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn;                                           // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn2;                                          // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_FailedInfo;                                    // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Rank;                                          // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TitleColiseum;                                 // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TitleFailedTime;                               // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TitlePrize;                                    // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TitleTime;                                     // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VR_Result_C">();
	}
	static class UVR_Result_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVR_Result_C>();
	}
};
static_assert(alignof(UVR_Result_C) == 0x000008, "Wrong alignment on UVR_Result_C");
static_assert(sizeof(UVR_Result_C) == 0x0005C0, "Wrong size on UVR_Result_C");
static_assert(offsetof(UVR_Result_C, UnderShinraMansion) == 0x000488, "Member 'UVR_Result_C::UnderShinraMansion' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, UnderColiseumForQuest) == 0x000490, "Member 'UVR_Result_C::UnderColiseumForQuest' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, UnderColiseum) == 0x000498, "Member 'UVR_Result_C::UnderColiseum' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, GoldSaucerArena) == 0x0004A0, "Member 'UVR_Result_C::GoldSaucerArena' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, VR) == 0x0004A8, "Member 'UVR_Result_C::VR' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, New_Loop) == 0x0004B0, "Member 'UVR_Result_C::New_Loop' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Menu_Out) == 0x0004B8, "Member 'UVR_Result_C::Menu_Out' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Failed_In) == 0x0004C0, "Member 'UVR_Result_C::Failed_In' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Clear_In) == 0x0004C8, "Member 'UVR_Result_C::Clear_In' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Billboard_Bg) == 0x0004D0, "Member 'UVR_Result_C::Billboard_Bg' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, BlackBase) == 0x0004D8, "Member 'UVR_Result_C::BlackBase' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, EndImage) == 0x0004E0, "Member 'UVR_Result_C::EndImage' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, EndImage_1) == 0x0004E8, "Member 'UVR_Result_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, EndImage_2) == 0x0004F0, "Member 'UVR_Result_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, EndImage_3) == 0x0004F8, "Member 'UVR_Result_C::EndImage_3' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, EndTextBlock_11) == 0x000500, "Member 'UVR_Result_C::EndTextBlock_11' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, G1_Base1) == 0x000508, "Member 'UVR_Result_C::G1_Base1' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Icon_Item_1) == 0x000510, "Member 'UVR_Result_C::Icon_Item_1' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Icon_Item_2) == 0x000518, "Member 'UVR_Result_C::Icon_Item_2' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Icon_Item_3) == 0x000520, "Member 'UVR_Result_C::Icon_Item_3' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Icon_X_G1_) == 0x000528, "Member 'UVR_Result_C::Icon_X_G1_' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Icon_X_G2_) == 0x000530, "Member 'UVR_Result_C::Icon_X_G2_' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Icon_X_G3_) == 0x000538, "Member 'UVR_Result_C::Icon_X_G3_' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Light1) == 0x000540, "Member 'UVR_Result_C::Light1' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Light2) == 0x000548, "Member 'UVR_Result_C::Light2' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Light3) == 0x000550, "Member 'UVR_Result_C::Light3' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, ListBgSet) == 0x000558, "Member 'UVR_Result_C::ListBgSet' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, LogoSet) == 0x000560, "Member 'UVR_Result_C::LogoSet' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, RankBase) == 0x000568, "Member 'UVR_Result_C::RankBase' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, TitleLight) == 0x000570, "Member 'UVR_Result_C::TitleLight' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, TtileLine) == 0x000578, "Member 'UVR_Result_C::TtileLine' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Txt_Btn) == 0x000580, "Member 'UVR_Result_C::Txt_Btn' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Txt_Btn2) == 0x000588, "Member 'UVR_Result_C::Txt_Btn2' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Txt_FailedInfo) == 0x000590, "Member 'UVR_Result_C::Txt_FailedInfo' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Txt_Rank) == 0x000598, "Member 'UVR_Result_C::Txt_Rank' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Txt_TitleColiseum) == 0x0005A0, "Member 'UVR_Result_C::Txt_TitleColiseum' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Txt_TitleFailedTime) == 0x0005A8, "Member 'UVR_Result_C::Txt_TitleFailedTime' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Txt_TitlePrize) == 0x0005B0, "Member 'UVR_Result_C::Txt_TitlePrize' has a wrong offset!");
static_assert(offsetof(UVR_Result_C, Txt_TitleTime) == 0x0005B8, "Member 'UVR_Result_C::Txt_TitleTime' has a wrong offset!");

}

