#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VR_SelectCell2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VR_SelectCell2.VR_SelectCell2_C
// 0x0098 (0x0460 - 0x03C8)
class UVR_SelectCell2_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Gray_BtnHover;                                     // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gray;                                              // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Selected;                                 // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Hover;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseC;                                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FrameC;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              GrayOut;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Lock;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              WeakIcon_1;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              WeakIcon_2;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              WeakIcon_3;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_VR_SelectCell2(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VR_SelectCell2_C">();
	}
	static class UVR_SelectCell2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVR_SelectCell2_C>();
	}
};
static_assert(alignof(UVR_SelectCell2_C) == 0x000008, "Wrong alignment on UVR_SelectCell2_C");
static_assert(sizeof(UVR_SelectCell2_C) == 0x000460, "Wrong size on UVR_SelectCell2_C");
static_assert(offsetof(UVR_SelectCell2_C, UberGraphFrame) == 0x0003C8, "Member 'UVR_SelectCell2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, Gray_BtnHover) == 0x0003D0, "Member 'UVR_SelectCell2_C::Gray_BtnHover' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, Gray) == 0x0003D8, "Member 'UVR_SelectCell2_C::Gray' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, Normal) == 0x0003E0, "Member 'UVR_SelectCell2_C::Normal' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, BtnHover_Selected) == 0x0003E8, "Member 'UVR_SelectCell2_C::BtnHover_Selected' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, Selected) == 0x0003F0, "Member 'UVR_SelectCell2_C::Selected' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, BtnHover) == 0x0003F8, "Member 'UVR_SelectCell2_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, Base) == 0x000400, "Member 'UVR_SelectCell2_C::Base' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, Base_Hover) == 0x000408, "Member 'UVR_SelectCell2_C::Base_Hover' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, BaseC) == 0x000410, "Member 'UVR_SelectCell2_C::BaseC' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, FrameC) == 0x000418, "Member 'UVR_SelectCell2_C::FrameC' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, GrayOut) == 0x000420, "Member 'UVR_SelectCell2_C::GrayOut' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, Icon_Lock) == 0x000428, "Member 'UVR_SelectCell2_C::Icon_Lock' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, MainMenu_Btn) == 0x000430, "Member 'UVR_SelectCell2_C::MainMenu_Btn' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, Txt_Num) == 0x000438, "Member 'UVR_SelectCell2_C::Txt_Num' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, Txt_Title) == 0x000440, "Member 'UVR_SelectCell2_C::Txt_Title' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, WeakIcon_1) == 0x000448, "Member 'UVR_SelectCell2_C::WeakIcon_1' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, WeakIcon_2) == 0x000450, "Member 'UVR_SelectCell2_C::WeakIcon_2' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell2_C, WeakIcon_3) == 0x000458, "Member 'UVR_SelectCell2_C::WeakIcon_3' has a wrong offset!");

}

