#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VR_StartScreen

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VR_StartScreen.VR_StartScreen_C
// 0x0018 (0x03E0 - 0x03C8)
class UVR_StartScreen_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Version;                                       // 0x03D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FString Get_Txt_Version_Text_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VR_StartScreen_C">();
	}
	static class UVR_StartScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVR_StartScreen_C>();
	}
};
static_assert(alignof(UVR_StartScreen_C) == 0x000008, "Wrong alignment on UVR_StartScreen_C");
static_assert(sizeof(UVR_StartScreen_C) == 0x0003E0, "Wrong size on UVR_StartScreen_C");
static_assert(offsetof(UVR_StartScreen_C, Out) == 0x0003C8, "Member 'UVR_StartScreen_C::Out' has a wrong offset!");
static_assert(offsetof(UVR_StartScreen_C, In) == 0x0003D0, "Member 'UVR_StartScreen_C::In' has a wrong offset!");
static_assert(offsetof(UVR_StartScreen_C, Txt_Version) == 0x0003D8, "Member 'UVR_StartScreen_C::Txt_Version' has a wrong offset!");

}

