#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VR_SelectCell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VR_SelectCell.VR_SelectCell_C
// 0x0078 (0x0440 - 0x03C8)
class UVR_SelectCell_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Normal;                                            // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Selected;                                 // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Hover;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseC;                                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVR_CharaNum_C*                         CharaNum_New;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FrameC;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              GrayOut;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Member_C*                         Icon_Member;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num;                                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_VR_SelectCell(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VR_SelectCell_C">();
	}
	static class UVR_SelectCell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVR_SelectCell_C>();
	}
};
static_assert(alignof(UVR_SelectCell_C) == 0x000008, "Wrong alignment on UVR_SelectCell_C");
static_assert(sizeof(UVR_SelectCell_C) == 0x000440, "Wrong size on UVR_SelectCell_C");
static_assert(offsetof(UVR_SelectCell_C, UberGraphFrame) == 0x0003C8, "Member 'UVR_SelectCell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, Normal) == 0x0003D0, "Member 'UVR_SelectCell_C::Normal' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, BtnHover_Selected) == 0x0003D8, "Member 'UVR_SelectCell_C::BtnHover_Selected' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, Selected) == 0x0003E0, "Member 'UVR_SelectCell_C::Selected' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, BtnHover) == 0x0003E8, "Member 'UVR_SelectCell_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, Base) == 0x0003F0, "Member 'UVR_SelectCell_C::Base' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, Base_Hover) == 0x0003F8, "Member 'UVR_SelectCell_C::Base_Hover' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, BaseC) == 0x000400, "Member 'UVR_SelectCell_C::BaseC' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, CharaNum_New) == 0x000408, "Member 'UVR_SelectCell_C::CharaNum_New' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, FrameC) == 0x000410, "Member 'UVR_SelectCell_C::FrameC' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, GrayOut) == 0x000418, "Member 'UVR_SelectCell_C::GrayOut' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, Icon_Member) == 0x000420, "Member 'UVR_SelectCell_C::Icon_Member' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, MainMenu_Btn) == 0x000428, "Member 'UVR_SelectCell_C::MainMenu_Btn' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, Txt_Num) == 0x000430, "Member 'UVR_SelectCell_C::Txt_Num' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, Txt_Title) == 0x000438, "Member 'UVR_SelectCell_C::Txt_Title' has a wrong offset!");

}

