#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VR_SummonLevelWindow

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VR_SummonLevelWindow.VR_SummonLevelWindow_C
// 0x0030 (0x03F8 - 0x03C8)
class UVR_SummonLevelWindow_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Base1_3;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Summon;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           ListBgSet2;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   SelectList;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Alarm;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_SelectInfo1;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VR_SummonLevelWindow_C">();
	}
	static class UVR_SummonLevelWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVR_SummonLevelWindow_C>();
	}
};
static_assert(alignof(UVR_SummonLevelWindow_C) == 0x000008, "Wrong alignment on UVR_SummonLevelWindow_C");
static_assert(sizeof(UVR_SummonLevelWindow_C) == 0x0003F8, "Wrong size on UVR_SummonLevelWindow_C");
static_assert(offsetof(UVR_SummonLevelWindow_C, Base1_3) == 0x0003C8, "Member 'UVR_SummonLevelWindow_C::Base1_3' has a wrong offset!");
static_assert(offsetof(UVR_SummonLevelWindow_C, Icon_Summon) == 0x0003D0, "Member 'UVR_SummonLevelWindow_C::Icon_Summon' has a wrong offset!");
static_assert(offsetof(UVR_SummonLevelWindow_C, ListBgSet2) == 0x0003D8, "Member 'UVR_SummonLevelWindow_C::ListBgSet2' has a wrong offset!");
static_assert(offsetof(UVR_SummonLevelWindow_C, SelectList) == 0x0003E0, "Member 'UVR_SummonLevelWindow_C::SelectList' has a wrong offset!");
static_assert(offsetof(UVR_SummonLevelWindow_C, Txt_Alarm) == 0x0003E8, "Member 'UVR_SummonLevelWindow_C::Txt_Alarm' has a wrong offset!");
static_assert(offsetof(UVR_SummonLevelWindow_C, Txt_SelectInfo1) == 0x0003F0, "Member 'UVR_SummonLevelWindow_C::Txt_SelectInfo1' has a wrong offset!");

}

