#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VR_SelectCell

#include "Basic.hpp"


namespace SDK::Params
{

// Function VR_SelectCell.VR_SelectCell_C.ExecuteUbergraph_VR_SelectCell
// 0x0008 (0x0008 - 0x0000)
struct VR_SelectCell_C_ExecuteUbergraph_VR_SelectCell final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VR_SelectCell_C_ExecuteUbergraph_VR_SelectCell) == 0x000004, "Wrong alignment on VR_SelectCell_C_ExecuteUbergraph_VR_SelectCell");
static_assert(sizeof(VR_SelectCell_C_ExecuteUbergraph_VR_SelectCell) == 0x000008, "Wrong size on VR_SelectCell_C_ExecuteUbergraph_VR_SelectCell");
static_assert(offsetof(VR_SelectCell_C_ExecuteUbergraph_VR_SelectCell, EntryPoint) == 0x000000, "Member 'VR_SelectCell_C_ExecuteUbergraph_VR_SelectCell::EntryPoint' has a wrong offset!");
static_assert(offsetof(VR_SelectCell_C_ExecuteUbergraph_VR_SelectCell, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'VR_SelectCell_C_ExecuteUbergraph_VR_SelectCell::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(VR_SelectCell_C_ExecuteUbergraph_VR_SelectCell, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000005, "Member 'VR_SelectCell_C_ExecuteUbergraph_VR_SelectCell::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");

}

