#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponStatus

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WeaponStatus.WeaponStatus_C
// 0x00A8 (0x0890 - 0x07E8)
class UWeaponStatus_C final : public UEndWeaponStatusWindow
{
public:
	class UWidgetAnimation*                       CoreSelectList_In;                                 // 0x07E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CoreSelect_In;                                     // 0x07F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AutoSettingList_In;                                // 0x07F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Detail_Change;                                     // 0x0800(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WeaponSelect_In;                                   // 0x0808(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0810(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              BtnBase1;                                          // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase1_1;                                        // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase2;                                          // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase3;                                          // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnFrame2;                                         // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnFrame3;                                         // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            CategoryTitle_Member_Bg;                           // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line3;                                             // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListTitle_C*                           ListTitle_Category;                                // 0x0858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListTitle_C*                           ListTitle_Category_1;                              // 0x0860(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              SpGaugeLight;                                      // 0x0868(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_System_BgLeft_C*              System_BgLeft;                                     // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_AutoSetting;                                   // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ListTitle_Category;                            // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_SpTitle;                                       // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponStatus_C">();
	}
	static class UWeaponStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponStatus_C>();
	}
};
static_assert(alignof(UWeaponStatus_C) == 0x000008, "Wrong alignment on UWeaponStatus_C");
static_assert(sizeof(UWeaponStatus_C) == 0x000890, "Wrong size on UWeaponStatus_C");
static_assert(offsetof(UWeaponStatus_C, CoreSelectList_In) == 0x0007E8, "Member 'UWeaponStatus_C::CoreSelectList_In' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, CoreSelect_In) == 0x0007F0, "Member 'UWeaponStatus_C::CoreSelect_In' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, AutoSettingList_In) == 0x0007F8, "Member 'UWeaponStatus_C::AutoSettingList_In' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, Detail_Change) == 0x000800, "Member 'UWeaponStatus_C::Detail_Change' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, WeaponSelect_In) == 0x000808, "Member 'UWeaponStatus_C::WeaponSelect_In' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, In) == 0x000810, "Member 'UWeaponStatus_C::In' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, BtnBase1) == 0x000818, "Member 'UWeaponStatus_C::BtnBase1' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, BtnBase1_1) == 0x000820, "Member 'UWeaponStatus_C::BtnBase1_1' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, BtnBase2) == 0x000828, "Member 'UWeaponStatus_C::BtnBase2' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, BtnBase3) == 0x000830, "Member 'UWeaponStatus_C::BtnBase3' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, BtnFrame2) == 0x000838, "Member 'UWeaponStatus_C::BtnFrame2' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, BtnFrame3) == 0x000840, "Member 'UWeaponStatus_C::BtnFrame3' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, CategoryTitle_Member_Bg) == 0x000848, "Member 'UWeaponStatus_C::CategoryTitle_Member_Bg' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, Line3) == 0x000850, "Member 'UWeaponStatus_C::Line3' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, ListTitle_Category) == 0x000858, "Member 'UWeaponStatus_C::ListTitle_Category' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, ListTitle_Category_1) == 0x000860, "Member 'UWeaponStatus_C::ListTitle_Category_1' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, SpGaugeLight) == 0x000868, "Member 'UWeaponStatus_C::SpGaugeLight' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, System_BgLeft) == 0x000870, "Member 'UWeaponStatus_C::System_BgLeft' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, Txt_AutoSetting) == 0x000878, "Member 'UWeaponStatus_C::Txt_AutoSetting' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, Txt_ListTitle_Category) == 0x000880, "Member 'UWeaponStatus_C::Txt_ListTitle_Category' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_C, Txt_SpTitle) == 0x000888, "Member 'UWeaponStatus_C::Txt_SpTitle' has a wrong offset!");

}

