#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponStatus_AutoSetting_Cell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WeaponStatus_AutoSetting_Cell.WeaponStatus_AutoSetting_Cell_C
// 0x0070 (0x0450 - 0x03E0)
class UWeaponStatus_AutoSetting_Cell_C final : public UEndAutoSettingCell
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       BtnHover_Auto3;                                    // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Auto2;                                    // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Auto1;                                    // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Auto3;                                             // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Auto2;                                             // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Auto1;                                             // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base_Btn;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Hover;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_74;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WeaponStatus_AutoSetting_Cell(int32 EntryPoint);
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_16_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponStatus_AutoSetting_Cell_C">();
	}
	static class UWeaponStatus_AutoSetting_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponStatus_AutoSetting_Cell_C>();
	}
};
static_assert(alignof(UWeaponStatus_AutoSetting_Cell_C) == 0x000008, "Wrong alignment on UWeaponStatus_AutoSetting_Cell_C");
static_assert(sizeof(UWeaponStatus_AutoSetting_Cell_C) == 0x000450, "Wrong size on UWeaponStatus_AutoSetting_Cell_C");
static_assert(offsetof(UWeaponStatus_AutoSetting_Cell_C, UberGraphFrame) == 0x0003E0, "Member 'UWeaponStatus_AutoSetting_Cell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_AutoSetting_Cell_C, BtnHover_Auto3) == 0x0003E8, "Member 'UWeaponStatus_AutoSetting_Cell_C::BtnHover_Auto3' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_AutoSetting_Cell_C, BtnHover_Auto2) == 0x0003F0, "Member 'UWeaponStatus_AutoSetting_Cell_C::BtnHover_Auto2' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_AutoSetting_Cell_C, BtnHover_Auto1) == 0x0003F8, "Member 'UWeaponStatus_AutoSetting_Cell_C::BtnHover_Auto1' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_AutoSetting_Cell_C, Normal) == 0x000400, "Member 'UWeaponStatus_AutoSetting_Cell_C::Normal' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_AutoSetting_Cell_C, Auto3) == 0x000408, "Member 'UWeaponStatus_AutoSetting_Cell_C::Auto3' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_AutoSetting_Cell_C, Auto2) == 0x000410, "Member 'UWeaponStatus_AutoSetting_Cell_C::Auto2' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_AutoSetting_Cell_C, Auto1) == 0x000418, "Member 'UWeaponStatus_AutoSetting_Cell_C::Auto1' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_AutoSetting_Cell_C, BtnHover) == 0x000420, "Member 'UWeaponStatus_AutoSetting_Cell_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_AutoSetting_Cell_C, Base_Btn) == 0x000428, "Member 'UWeaponStatus_AutoSetting_Cell_C::Base_Btn' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_AutoSetting_Cell_C, Base_Hover) == 0x000430, "Member 'UWeaponStatus_AutoSetting_Cell_C::Base_Hover' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_AutoSetting_Cell_C, EndImage) == 0x000438, "Member 'UWeaponStatus_AutoSetting_Cell_C::EndImage' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_AutoSetting_Cell_C, EndImage_74) == 0x000440, "Member 'UWeaponStatus_AutoSetting_Cell_C::EndImage_74' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_AutoSetting_Cell_C, MainMenu_Btn) == 0x000448, "Member 'UWeaponStatus_AutoSetting_Cell_C::MainMenu_Btn' has a wrong offset!");

}

