#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponStatus_CircleGauge3

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WeaponStatus_CircleGauge3.WeaponStatus_CircleGauge3_C
// 0x0070 (0x0498 - 0x0428)
class UWeaponStatus_CircleGauge3_C final : public UEndWeaponStatusCircleGauge3
{
public:
	class UEndImage*                              Base;                                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterBase;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterBase_1;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Frame;                                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Frame_1;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Frame_2;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Frame_3;                                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Frame_4;                                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Gauge_Frame;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point1;                                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point1_1;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point2;                                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point2_1;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponStatus_CircleGauge3_C">();
	}
	static class UWeaponStatus_CircleGauge3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponStatus_CircleGauge3_C>();
	}
};
static_assert(alignof(UWeaponStatus_CircleGauge3_C) == 0x000008, "Wrong alignment on UWeaponStatus_CircleGauge3_C");
static_assert(sizeof(UWeaponStatus_CircleGauge3_C) == 0x000498, "Wrong size on UWeaponStatus_CircleGauge3_C");
static_assert(offsetof(UWeaponStatus_CircleGauge3_C, Base) == 0x000428, "Member 'UWeaponStatus_CircleGauge3_C::Base' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge3_C, CenterBase) == 0x000430, "Member 'UWeaponStatus_CircleGauge3_C::CenterBase' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge3_C, CenterBase_1) == 0x000438, "Member 'UWeaponStatus_CircleGauge3_C::CenterBase_1' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge3_C, Frame) == 0x000440, "Member 'UWeaponStatus_CircleGauge3_C::Frame' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge3_C, Frame_1) == 0x000448, "Member 'UWeaponStatus_CircleGauge3_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge3_C, Frame_2) == 0x000450, "Member 'UWeaponStatus_CircleGauge3_C::Frame_2' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge3_C, Frame_3) == 0x000458, "Member 'UWeaponStatus_CircleGauge3_C::Frame_3' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge3_C, Frame_4) == 0x000460, "Member 'UWeaponStatus_CircleGauge3_C::Frame_4' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge3_C, Gauge_Frame) == 0x000468, "Member 'UWeaponStatus_CircleGauge3_C::Gauge_Frame' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge3_C, Img_Slash) == 0x000470, "Member 'UWeaponStatus_CircleGauge3_C::Img_Slash' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge3_C, Point1) == 0x000478, "Member 'UWeaponStatus_CircleGauge3_C::Point1' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge3_C, Point1_1) == 0x000480, "Member 'UWeaponStatus_CircleGauge3_C::Point1_1' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge3_C, Point2) == 0x000488, "Member 'UWeaponStatus_CircleGauge3_C::Point2' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge3_C, Point2_1) == 0x000490, "Member 'UWeaponStatus_CircleGauge3_C::Point2_1' has a wrong offset!");

}

