#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponStatus_CircleGauge

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WeaponStatus_CircleGauge.WeaponStatus_CircleGauge_C
// 0x0038 (0x0458 - 0x0420)
class UWeaponStatus_CircleGauge_C final : public UEndWeaponStatusCircleGauge
{
public:
	class UWidgetAnimation*                       Normal;                                            // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Max;                                               // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_56;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_SpTitle_1;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponStatus_CircleGauge_C">();
	}
	static class UWeaponStatus_CircleGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponStatus_CircleGauge_C>();
	}
};
static_assert(alignof(UWeaponStatus_CircleGauge_C) == 0x000008, "Wrong alignment on UWeaponStatus_CircleGauge_C");
static_assert(sizeof(UWeaponStatus_CircleGauge_C) == 0x000458, "Wrong size on UWeaponStatus_CircleGauge_C");
static_assert(offsetof(UWeaponStatus_CircleGauge_C, Normal) == 0x000420, "Member 'UWeaponStatus_CircleGauge_C::Normal' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge_C, Max) == 0x000428, "Member 'UWeaponStatus_CircleGauge_C::Max' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge_C, Base) == 0x000430, "Member 'UWeaponStatus_CircleGauge_C::Base' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge_C, Base1) == 0x000438, "Member 'UWeaponStatus_CircleGauge_C::Base1' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge_C, EndImage) == 0x000440, "Member 'UWeaponStatus_CircleGauge_C::EndImage' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge_C, EndImage_56) == 0x000448, "Member 'UWeaponStatus_CircleGauge_C::EndImage_56' has a wrong offset!");
static_assert(offsetof(UWeaponStatus_CircleGauge_C, Txt_SpTitle_1) == 0x000450, "Member 'UWeaponStatus_CircleGauge_C::Txt_SpTitle_1' has a wrong offset!");

}

