#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorldMap_Cell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WorldMap_Cell.WorldMap_Cell_C
// 0x00E8 (0x04B0 - 0x03C8)
class UWorldMap_Cell_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Loop;                                              // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndProgressBar*                        AreaProgressBar;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_1;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_5;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_301;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gradation;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_CardGame;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Location_Story;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_NaviMap_C*                        Icon_NaviMap;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Quest;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_QuestNotice;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconBase;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Down;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Up;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_1;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListPoint_2;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              QuestBase;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_CardGame_Num;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_CardGame_Scenario;                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Location_Story_Num;                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Quest_All;                                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Quest_Num;                                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Quest_Num_All;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WorldMap_Cell(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WorldMap_Cell_C">();
	}
	static class UWorldMap_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldMap_Cell_C>();
	}
};
static_assert(alignof(UWorldMap_Cell_C) == 0x000008, "Wrong alignment on UWorldMap_Cell_C");
static_assert(sizeof(UWorldMap_Cell_C) == 0x0004B0, "Wrong size on UWorldMap_Cell_C");
static_assert(offsetof(UWorldMap_Cell_C, UberGraphFrame) == 0x0003C8, "Member 'UWorldMap_Cell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Loop) == 0x0003D0, "Member 'UWorldMap_Cell_C::Loop' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, BtnHover) == 0x0003D8, "Member 'UWorldMap_Cell_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, AreaProgressBar) == 0x0003E0, "Member 'UWorldMap_Cell_C::AreaProgressBar' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Base1) == 0x0003E8, "Member 'UWorldMap_Cell_C::Base1' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Base1_1) == 0x0003F0, "Member 'UWorldMap_Cell_C::Base1_1' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Base1_5) == 0x0003F8, "Member 'UWorldMap_Cell_C::Base1_5' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, EndImage) == 0x000400, "Member 'UWorldMap_Cell_C::EndImage' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, EndImage_301) == 0x000408, "Member 'UWorldMap_Cell_C::EndImage_301' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Gradation) == 0x000410, "Member 'UWorldMap_Cell_C::Gradation' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Icon_CardGame) == 0x000418, "Member 'UWorldMap_Cell_C::Icon_CardGame' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Icon_Location_Story) == 0x000420, "Member 'UWorldMap_Cell_C::Icon_Location_Story' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Icon_NaviMap) == 0x000428, "Member 'UWorldMap_Cell_C::Icon_NaviMap' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Icon_Quest) == 0x000430, "Member 'UWorldMap_Cell_C::Icon_Quest' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Icon_QuestNotice) == 0x000438, "Member 'UWorldMap_Cell_C::Icon_QuestNotice' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, IconBase) == 0x000440, "Member 'UWorldMap_Cell_C::IconBase' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Line_Down) == 0x000448, "Member 'UWorldMap_Cell_C::Line_Down' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Line_Up) == 0x000450, "Member 'UWorldMap_Cell_C::Line_Up' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, ListPoint_1) == 0x000458, "Member 'UWorldMap_Cell_C::ListPoint_1' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, ListPoint_2) == 0x000460, "Member 'UWorldMap_Cell_C::ListPoint_2' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, MainMenu_Btn) == 0x000468, "Member 'UWorldMap_Cell_C::MainMenu_Btn' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, QuestBase) == 0x000470, "Member 'UWorldMap_Cell_C::QuestBase' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Txt_CardGame_Num) == 0x000478, "Member 'UWorldMap_Cell_C::Txt_CardGame_Num' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Txt_CardGame_Scenario) == 0x000480, "Member 'UWorldMap_Cell_C::Txt_CardGame_Scenario' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Txt_Location_Story_Num) == 0x000488, "Member 'UWorldMap_Cell_C::Txt_Location_Story_Num' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Txt_Quest_All) == 0x000490, "Member 'UWorldMap_Cell_C::Txt_Quest_All' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Txt_Quest_Num) == 0x000498, "Member 'UWorldMap_Cell_C::Txt_Quest_Num' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Txt_Quest_Num_All) == 0x0004A0, "Member 'UWorldMap_Cell_C::Txt_Quest_Num_All' has a wrong offset!");
static_assert(offsetof(UWorldMap_Cell_C, Txt_Title) == 0x0004A8, "Member 'UWorldMap_Cell_C::Txt_Title' has a wrong offset!");

}

