#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorldMap

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WorldMap.WorldMap_C
// 0x00E0 (0x0618 - 0x0538)
class UWorldMap_C final : public UEndWorldMapMenu
{
public:
	class UWidgetAnimation*                       Grassland;                                         // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Junon;                                             // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Corel;                                             // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gongaga;                                           // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CosmoCanyon;                                       // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Nibelheim;                                         // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Sea;                                               // 0x0568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NorthWood;                                         // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UReport_AreaChangeBtn_C*                AreaChangeBtn;                                     // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWorldMap_AreaPlate_C*                  AreaPlate_1;                                       // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWorldMap_AreaPlate_C*                  AreaPlate_2;                                       // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWorldMap_AreaPlate_C*                  AreaPlate_3;                                       // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWorldMap_AreaPlate_C*                  AreaPlate_4;                                       // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWorldMap_AreaPlate_C*                  AreaPlate_5;                                       // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWorldMap_AreaPlate_C*                  AreaPlate_6;                                       // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWorldMap_AreaPlate_C*                  AreaPlate_7;                                       // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWorldMap_AreaPlate_C*                  AreaPlate_8;                                       // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bg;                                                // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Bg3_C*                            Bg3;                                               // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Area;                                    // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Map;                                     // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage;                                          // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_170;                                      // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame_Top;                                         // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              InfoBg;                                            // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   LeftMenu_ScrollBox;                                // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Right;                                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMap_BtnGuide_C*                        Map_BtnGuide;                                      // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WorldMap_C">();
	}
	static class UWorldMap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldMap_C>();
	}
};
static_assert(alignof(UWorldMap_C) == 0x000008, "Wrong alignment on UWorldMap_C");
static_assert(sizeof(UWorldMap_C) == 0x000618, "Wrong size on UWorldMap_C");
static_assert(offsetof(UWorldMap_C, Grassland) == 0x000538, "Member 'UWorldMap_C::Grassland' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, Junon) == 0x000540, "Member 'UWorldMap_C::Junon' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, Corel) == 0x000548, "Member 'UWorldMap_C::Corel' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, Gongaga) == 0x000550, "Member 'UWorldMap_C::Gongaga' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, CosmoCanyon) == 0x000558, "Member 'UWorldMap_C::CosmoCanyon' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, Nibelheim) == 0x000560, "Member 'UWorldMap_C::Nibelheim' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, Sea) == 0x000568, "Member 'UWorldMap_C::Sea' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, NorthWood) == 0x000570, "Member 'UWorldMap_C::NorthWood' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, AreaChangeBtn) == 0x000578, "Member 'UWorldMap_C::AreaChangeBtn' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, AreaPlate_1) == 0x000580, "Member 'UWorldMap_C::AreaPlate_1' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, AreaPlate_2) == 0x000588, "Member 'UWorldMap_C::AreaPlate_2' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, AreaPlate_3) == 0x000590, "Member 'UWorldMap_C::AreaPlate_3' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, AreaPlate_4) == 0x000598, "Member 'UWorldMap_C::AreaPlate_4' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, AreaPlate_5) == 0x0005A0, "Member 'UWorldMap_C::AreaPlate_5' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, AreaPlate_6) == 0x0005A8, "Member 'UWorldMap_C::AreaPlate_6' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, AreaPlate_7) == 0x0005B0, "Member 'UWorldMap_C::AreaPlate_7' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, AreaPlate_8) == 0x0005B8, "Member 'UWorldMap_C::AreaPlate_8' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, Bg) == 0x0005C0, "Member 'UWorldMap_C::Bg' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, Bg3) == 0x0005C8, "Member 'UWorldMap_C::Bg3' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, Billboard_Area) == 0x0005D0, "Member 'UWorldMap_C::Billboard_Area' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, Billboard_Map) == 0x0005D8, "Member 'UWorldMap_C::Billboard_Map' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, EndImage) == 0x0005E0, "Member 'UWorldMap_C::EndImage' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, EndImage_170) == 0x0005E8, "Member 'UWorldMap_C::EndImage_170' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, Frame_Top) == 0x0005F0, "Member 'UWorldMap_C::Frame_Top' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, InfoBg) == 0x0005F8, "Member 'UWorldMap_C::InfoBg' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, LeftMenu_ScrollBox) == 0x000600, "Member 'UWorldMap_C::LeftMenu_ScrollBox' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, Line_Right) == 0x000608, "Member 'UWorldMap_C::Line_Right' has a wrong offset!");
static_assert(offsetof(UWorldMap_C, Map_BtnGuide) == 0x000610, "Member 'UWorldMap_C::Map_BtnGuide' has a wrong offset!");

}

