#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorldMap_AreaPlate

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WorldMap_AreaPlate.WorldMap_AreaPlate_C
// 0x00D8 (0x04A0 - 0x03C8)
class UWorldMap_AreaPlate_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Loop;                                              // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus;                                             // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEndProgressBar*                        AreaProgressBar;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_1;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1_5;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gradation;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_CardGame;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Location_Story;                               // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_NaviMap_C*                        Icon_NaviMap;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Quest;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_QuestNotice;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconBase;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Pin;                                               // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Pin2;                                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Pin2_Loop;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Pin3;                                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Pin3_2;                                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              QuestBase;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_CardGame_Num;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_CardGame_Scenario;                             // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Location_Story_Num;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Quest_All;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Quest_Num;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Quest_Num_All;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WorldMap_AreaPlate_C">();
	}
	static class UWorldMap_AreaPlate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldMap_AreaPlate_C>();
	}
};
static_assert(alignof(UWorldMap_AreaPlate_C) == 0x000008, "Wrong alignment on UWorldMap_AreaPlate_C");
static_assert(sizeof(UWorldMap_AreaPlate_C) == 0x0004A0, "Wrong size on UWorldMap_AreaPlate_C");
static_assert(offsetof(UWorldMap_AreaPlate_C, Loop) == 0x0003C8, "Member 'UWorldMap_AreaPlate_C::Loop' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Focus) == 0x0003D0, "Member 'UWorldMap_AreaPlate_C::Focus' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Normal) == 0x0003D8, "Member 'UWorldMap_AreaPlate_C::Normal' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, AreaProgressBar) == 0x0003E0, "Member 'UWorldMap_AreaPlate_C::AreaProgressBar' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Base1) == 0x0003E8, "Member 'UWorldMap_AreaPlate_C::Base1' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Base1_1) == 0x0003F0, "Member 'UWorldMap_AreaPlate_C::Base1_1' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Base1_5) == 0x0003F8, "Member 'UWorldMap_AreaPlate_C::Base1_5' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Gradation) == 0x000400, "Member 'UWorldMap_AreaPlate_C::Gradation' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Icon_CardGame) == 0x000408, "Member 'UWorldMap_AreaPlate_C::Icon_CardGame' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Icon_Location_Story) == 0x000410, "Member 'UWorldMap_AreaPlate_C::Icon_Location_Story' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Icon_NaviMap) == 0x000418, "Member 'UWorldMap_AreaPlate_C::Icon_NaviMap' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Icon_Quest) == 0x000420, "Member 'UWorldMap_AreaPlate_C::Icon_Quest' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Icon_QuestNotice) == 0x000428, "Member 'UWorldMap_AreaPlate_C::Icon_QuestNotice' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, IconBase) == 0x000430, "Member 'UWorldMap_AreaPlate_C::IconBase' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Pin) == 0x000438, "Member 'UWorldMap_AreaPlate_C::Pin' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Pin2) == 0x000440, "Member 'UWorldMap_AreaPlate_C::Pin2' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Pin2_Loop) == 0x000448, "Member 'UWorldMap_AreaPlate_C::Pin2_Loop' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Pin3) == 0x000450, "Member 'UWorldMap_AreaPlate_C::Pin3' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Pin3_2) == 0x000458, "Member 'UWorldMap_AreaPlate_C::Pin3_2' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, QuestBase) == 0x000460, "Member 'UWorldMap_AreaPlate_C::QuestBase' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Txt_CardGame_Num) == 0x000468, "Member 'UWorldMap_AreaPlate_C::Txt_CardGame_Num' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Txt_CardGame_Scenario) == 0x000470, "Member 'UWorldMap_AreaPlate_C::Txt_CardGame_Scenario' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Txt_Location_Story_Num) == 0x000478, "Member 'UWorldMap_AreaPlate_C::Txt_Location_Story_Num' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Txt_Quest_All) == 0x000480, "Member 'UWorldMap_AreaPlate_C::Txt_Quest_All' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Txt_Quest_Num) == 0x000488, "Member 'UWorldMap_AreaPlate_C::Txt_Quest_Num' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Txt_Quest_Num_All) == 0x000490, "Member 'UWorldMap_AreaPlate_C::Txt_Quest_Num_All' has a wrong offset!");
static_assert(offsetof(UWorldMap_AreaPlate_C, Txt_Title) == 0x000498, "Member 'UWorldMap_AreaPlate_C::Txt_Title' has a wrong offset!");

}

