#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero000_COMON_Layout_000_MenuTop

#include "Basic.hpp"


namespace SDK::Params
{

// Function 0000-COMON_Layout_000-MenuTop.0000-COMON_Layout_000-MenuTop_C.ExecuteUbergraph_0000-COMON_Layout_000-MenuTop
// 0x0008 (0x0008 - 0x0000)
struct Zero000_COMON_Layout_000_MenuTop_C_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStoryFlag_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStoryFlag_ReturnValue_1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStoryFlag_ReturnValue_2;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStoryFlag_ReturnValue_3;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Zero000_COMON_Layout_000_MenuTop_C_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop) == 0x000004, "Wrong alignment on Zero000_COMON_Layout_000_MenuTop_C_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop");
static_assert(sizeof(Zero000_COMON_Layout_000_MenuTop_C_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop) == 0x000008, "Wrong size on Zero000_COMON_Layout_000_MenuTop_C_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop");
static_assert(offsetof(Zero000_COMON_Layout_000_MenuTop_C_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop, EntryPoint) == 0x000000, "Member 'Zero000_COMON_Layout_000_MenuTop_C_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop::EntryPoint' has a wrong offset!");
static_assert(offsetof(Zero000_COMON_Layout_000_MenuTop_C_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop, CallFunc_IsStoryFlag_ReturnValue) == 0x000004, "Member 'Zero000_COMON_Layout_000_MenuTop_C_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop::CallFunc_IsStoryFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero000_COMON_Layout_000_MenuTop_C_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop, CallFunc_IsStoryFlag_ReturnValue_1) == 0x000005, "Member 'Zero000_COMON_Layout_000_MenuTop_C_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop::CallFunc_IsStoryFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zero000_COMON_Layout_000_MenuTop_C_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop, CallFunc_IsStoryFlag_ReturnValue_2) == 0x000006, "Member 'Zero000_COMON_Layout_000_MenuTop_C_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop::CallFunc_IsStoryFlag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Zero000_COMON_Layout_000_MenuTop_C_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop, CallFunc_IsStoryFlag_ReturnValue_3) == 0x000007, "Member 'Zero000_COMON_Layout_000_MenuTop_C_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop::CallFunc_IsStoryFlag_ReturnValue_3' has a wrong offset!");

}

