#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero000_COMON_Layout_MainMenu_SceneTest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 0000-COMON_Layout_MainMenu_SceneTest.0000-COMON_Layout_MainMenu_SceneTest_C
// 0x0038 (0x0268 - 0x0230)
class AZero000_COMON_Layout_MainMenu_SceneTest_C final : public AEndLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	int32                                         Progress;                                          // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FlagDay;                                           // 0x023C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FlagSunset;                                        // 0x0244(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FlagNight;                                         // 0x024C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FlagCloud;                                         // 0x0254(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndStreamingSwitchVolume*              EndStreamingSwitchVolume_MenuSky_ExecuteUbergraph_0000_COMON_Layout_MainMenu_SceneTest_RefProperty; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void Night();
	void Sunset();
	void Cloud();
	void Day();
	void ExecuteUbergraph_0000_COMON_Layout_MainMenu_SceneTest(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"0000-COMON_Layout_MainMenu_SceneTest_C">();
	}
	static class AZero000_COMON_Layout_MainMenu_SceneTest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZero000_COMON_Layout_MainMenu_SceneTest_C>();
	}
};
static_assert(alignof(AZero000_COMON_Layout_MainMenu_SceneTest_C) == 0x000008, "Wrong alignment on AZero000_COMON_Layout_MainMenu_SceneTest_C");
static_assert(sizeof(AZero000_COMON_Layout_MainMenu_SceneTest_C) == 0x000268, "Wrong size on AZero000_COMON_Layout_MainMenu_SceneTest_C");
static_assert(offsetof(AZero000_COMON_Layout_MainMenu_SceneTest_C, UberGraphFrame) == 0x000230, "Member 'AZero000_COMON_Layout_MainMenu_SceneTest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AZero000_COMON_Layout_MainMenu_SceneTest_C, Progress) == 0x000238, "Member 'AZero000_COMON_Layout_MainMenu_SceneTest_C::Progress' has a wrong offset!");
static_assert(offsetof(AZero000_COMON_Layout_MainMenu_SceneTest_C, FlagDay) == 0x00023C, "Member 'AZero000_COMON_Layout_MainMenu_SceneTest_C::FlagDay' has a wrong offset!");
static_assert(offsetof(AZero000_COMON_Layout_MainMenu_SceneTest_C, FlagSunset) == 0x000244, "Member 'AZero000_COMON_Layout_MainMenu_SceneTest_C::FlagSunset' has a wrong offset!");
static_assert(offsetof(AZero000_COMON_Layout_MainMenu_SceneTest_C, FlagNight) == 0x00024C, "Member 'AZero000_COMON_Layout_MainMenu_SceneTest_C::FlagNight' has a wrong offset!");
static_assert(offsetof(AZero000_COMON_Layout_MainMenu_SceneTest_C, FlagCloud) == 0x000254, "Member 'AZero000_COMON_Layout_MainMenu_SceneTest_C::FlagCloud' has a wrong offset!");
static_assert(offsetof(AZero000_COMON_Layout_MainMenu_SceneTest_C, EndStreamingSwitchVolume_MenuSky_ExecuteUbergraph_0000_COMON_Layout_MainMenu_SceneTest_RefProperty) == 0x000260, "Member 'AZero000_COMON_Layout_MainMenu_SceneTest_C::EndStreamingSwitchVolume_MenuSky_ExecuteUbergraph_0000_COMON_Layout_MainMenu_SceneTest_RefProperty' has a wrong offset!");

}

