#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero001_WORLD_WorldPlan

#include "Basic.hpp"


namespace SDK::Params
{

// Function 0001-WORLD_WorldPlan.0001-WORLD_WorldPlan_C.OnSetChapterProgress
// 0x0004 (0x0004 - 0x0000)
struct Zero001_WORLD_WorldPlan_C_OnSetChapterProgress final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_WORLD_WorldPlan_C_OnSetChapterProgress) == 0x000004, "Wrong alignment on Zero001_WORLD_WorldPlan_C_OnSetChapterProgress");
static_assert(sizeof(Zero001_WORLD_WorldPlan_C_OnSetChapterProgress) == 0x000004, "Wrong size on Zero001_WORLD_WorldPlan_C_OnSetChapterProgress");
static_assert(offsetof(Zero001_WORLD_WorldPlan_C_OnSetChapterProgress, Value) == 0x000000, "Member 'Zero001_WORLD_WorldPlan_C_OnSetChapterProgress::Value' has a wrong offset!");

// Function 0001-WORLD_WorldPlan.0001-WORLD_WorldPlan_C.ExecuteUbergraph_0001-WORLD_WorldPlan
// 0x0018 (0x0018 - 0x0000)
struct Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChapterProgress_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_value;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan) == 0x000004, "Wrong alignment on Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan");
static_assert(sizeof(Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan) == 0x000018, "Wrong size on Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan");
static_assert(offsetof(Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan, EntryPoint) == 0x000000, "Member 'Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan::EntryPoint' has a wrong offset!");
static_assert(offsetof(Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan, CallFunc_Less_IntInt_ReturnValue_1) == 0x000005, "Member 'Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan, CallFunc_GetChapterProgress_ReturnValue) == 0x000008, "Member 'Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan::CallFunc_GetChapterProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan, K2Node_Event_value) == 0x000010, "Member 'Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan::K2Node_Event_value' has a wrong offset!");
static_assert(offsetof(Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan, CallFunc_Less_IntInt_ReturnValue_2) == 0x000014, "Member 'Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan, CallFunc_Less_IntInt_ReturnValue_3) == 0x000015, "Member 'Zero001_WORLD_WorldPlan_C_ExecuteUbergraph_0001_WORLD_WorldPlan::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");

}

