#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero001_WORLD_SkySetting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 0001-WORLD_SkySetting.0001-WORLD_SkySetting_C
// 0x00B0 (0x02E0 - 0x0230)
class AZero001_WORLD_SkySetting_C final : public AEndLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	int32                                         Value;                                             // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Three110_TEMPL_IslandSky_Day;                      // 0x023C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Three110_TEMPL_IslandSky_DayMaze;                  // 0x0244(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Three110_TEMPL_IslandSky_DayStorm;                 // 0x024C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Three110_TEMPL_IslandSky_Sunset;                   // 0x0254(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UpdatedStoryFlag;                                  // 0x025C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpdatedStoryFlagValue;                             // 0x0264(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   VREastFlag;                                        // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   VRWestFlag;                                        // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NIBLS_UnderFlag;                                   // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndStreamingSwitchVolume*              EndStreamingSwitchVolume_Sky_Sea_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingSwitchVolume*              EndStreamingSwitchVolume_Sky_Grass_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingSwitchVolume*              EndStreamingSwitchVolume_Sky_Nibel_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingSwitchVolume*              EndStreamingSwitchVolume_Sky_SouthSea_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingSwitchVolume*              EndStreamingSwitchVolume_Sky_Mount_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty; // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingSwitchVolume*              EndStreamingSwitchVolume_Sky_Island_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingSwitchVolume*              EndStreamingSwitchVolume_Sky_MountUnder_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingSwitchVolume*              EndStreamingSwitchVolume_Sky_MountUnderEsc_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingSwitchVolume*              EndStreamingSwitchVolume_Sky_Junon_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty; // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingSwitchVolume*              EndStreamingSwitchVolume_Sky_Gilgamesh_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty; // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingSwitchVolume*              EndStreamingSwitchVolume_Sky_NIBLS_Ele_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty; // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AEndStreamingSwitchVolume*              EndStreamingSwitchVolume_Sky_MythmTmp_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void OnSetStoryFlag(class FName StoryFlagId, bool Value_0);
	void OnStoryFlagCustom();
	void NIBLS_UnderFlag_Clear();
	void OnSetChapterProgress(int32 Value_0);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_0001_WORLD_SkySetting(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"0001-WORLD_SkySetting_C">();
	}
	static class AZero001_WORLD_SkySetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZero001_WORLD_SkySetting_C>();
	}
};
static_assert(alignof(AZero001_WORLD_SkySetting_C) == 0x000008, "Wrong alignment on AZero001_WORLD_SkySetting_C");
static_assert(sizeof(AZero001_WORLD_SkySetting_C) == 0x0002E0, "Wrong size on AZero001_WORLD_SkySetting_C");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, UberGraphFrame) == 0x000230, "Member 'AZero001_WORLD_SkySetting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, Value) == 0x000238, "Member 'AZero001_WORLD_SkySetting_C::Value' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, Three110_TEMPL_IslandSky_Day) == 0x00023C, "Member 'AZero001_WORLD_SkySetting_C::Three110_TEMPL_IslandSky_Day' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, Three110_TEMPL_IslandSky_DayMaze) == 0x000244, "Member 'AZero001_WORLD_SkySetting_C::Three110_TEMPL_IslandSky_DayMaze' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, Three110_TEMPL_IslandSky_DayStorm) == 0x00024C, "Member 'AZero001_WORLD_SkySetting_C::Three110_TEMPL_IslandSky_DayStorm' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, Three110_TEMPL_IslandSky_Sunset) == 0x000254, "Member 'AZero001_WORLD_SkySetting_C::Three110_TEMPL_IslandSky_Sunset' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, UpdatedStoryFlag) == 0x00025C, "Member 'AZero001_WORLD_SkySetting_C::UpdatedStoryFlag' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, UpdatedStoryFlagValue) == 0x000264, "Member 'AZero001_WORLD_SkySetting_C::UpdatedStoryFlagValue' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, VREastFlag) == 0x000268, "Member 'AZero001_WORLD_SkySetting_C::VREastFlag' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, VRWestFlag) == 0x000270, "Member 'AZero001_WORLD_SkySetting_C::VRWestFlag' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, NIBLS_UnderFlag) == 0x000278, "Member 'AZero001_WORLD_SkySetting_C::NIBLS_UnderFlag' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, EndStreamingSwitchVolume_Sky_Sea_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty) == 0x000280, "Member 'AZero001_WORLD_SkySetting_C::EndStreamingSwitchVolume_Sky_Sea_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, EndStreamingSwitchVolume_Sky_Grass_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty) == 0x000288, "Member 'AZero001_WORLD_SkySetting_C::EndStreamingSwitchVolume_Sky_Grass_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, EndStreamingSwitchVolume_Sky_Nibel_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty) == 0x000290, "Member 'AZero001_WORLD_SkySetting_C::EndStreamingSwitchVolume_Sky_Nibel_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, EndStreamingSwitchVolume_Sky_SouthSea_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty) == 0x000298, "Member 'AZero001_WORLD_SkySetting_C::EndStreamingSwitchVolume_Sky_SouthSea_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, EndStreamingSwitchVolume_Sky_Mount_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty) == 0x0002A0, "Member 'AZero001_WORLD_SkySetting_C::EndStreamingSwitchVolume_Sky_Mount_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, EndStreamingSwitchVolume_Sky_Island_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty) == 0x0002A8, "Member 'AZero001_WORLD_SkySetting_C::EndStreamingSwitchVolume_Sky_Island_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, EndStreamingSwitchVolume_Sky_MountUnder_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty) == 0x0002B0, "Member 'AZero001_WORLD_SkySetting_C::EndStreamingSwitchVolume_Sky_MountUnder_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, EndStreamingSwitchVolume_Sky_MountUnderEsc_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty) == 0x0002B8, "Member 'AZero001_WORLD_SkySetting_C::EndStreamingSwitchVolume_Sky_MountUnderEsc_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, EndStreamingSwitchVolume_Sky_Junon_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty) == 0x0002C0, "Member 'AZero001_WORLD_SkySetting_C::EndStreamingSwitchVolume_Sky_Junon_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, EndStreamingSwitchVolume_Sky_Gilgamesh_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty) == 0x0002C8, "Member 'AZero001_WORLD_SkySetting_C::EndStreamingSwitchVolume_Sky_Gilgamesh_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, EndStreamingSwitchVolume_Sky_NIBLS_Ele_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty) == 0x0002D0, "Member 'AZero001_WORLD_SkySetting_C::EndStreamingSwitchVolume_Sky_NIBLS_Ele_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_WORLD_SkySetting_C, EndStreamingSwitchVolume_Sky_MythmTmp_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty) == 0x0002D8, "Member 'AZero001_WORLD_SkySetting_C::EndStreamingSwitchVolume_Sky_MythmTmp_ExecuteUbergraph_0001_WORLD_SkySetting_RefProperty' has a wrong offset!");

}

