#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero000_COMON_Layout_000_MenuTop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 0000-COMON_Layout_000-MenuTop.0000-COMON_Layout_000-MenuTop_C
// 0x0030 (0x0260 - 0x0230)
class AZero000_COMON_Layout_000_MenuTop_C final : public AEndLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class FName                                   FlagDay;                                           // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FlagSunset;                                        // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FlagNight;                                         // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FlagCloud;                                         // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndStreamingSwitchVolume*              EndStreamingSwitchVolume_TimeSet2_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop_RefProperty; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_0000_COMON_Layout_000_MenuTop(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"0000-COMON_Layout_000-MenuTop_C">();
	}
	static class AZero000_COMON_Layout_000_MenuTop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZero000_COMON_Layout_000_MenuTop_C>();
	}
};
static_assert(alignof(AZero000_COMON_Layout_000_MenuTop_C) == 0x000008, "Wrong alignment on AZero000_COMON_Layout_000_MenuTop_C");
static_assert(sizeof(AZero000_COMON_Layout_000_MenuTop_C) == 0x000260, "Wrong size on AZero000_COMON_Layout_000_MenuTop_C");
static_assert(offsetof(AZero000_COMON_Layout_000_MenuTop_C, UberGraphFrame) == 0x000230, "Member 'AZero000_COMON_Layout_000_MenuTop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AZero000_COMON_Layout_000_MenuTop_C, FlagDay) == 0x000238, "Member 'AZero000_COMON_Layout_000_MenuTop_C::FlagDay' has a wrong offset!");
static_assert(offsetof(AZero000_COMON_Layout_000_MenuTop_C, FlagSunset) == 0x000240, "Member 'AZero000_COMON_Layout_000_MenuTop_C::FlagSunset' has a wrong offset!");
static_assert(offsetof(AZero000_COMON_Layout_000_MenuTop_C, FlagNight) == 0x000248, "Member 'AZero000_COMON_Layout_000_MenuTop_C::FlagNight' has a wrong offset!");
static_assert(offsetof(AZero000_COMON_Layout_000_MenuTop_C, FlagCloud) == 0x000250, "Member 'AZero000_COMON_Layout_000_MenuTop_C::FlagCloud' has a wrong offset!");
static_assert(offsetof(AZero000_COMON_Layout_000_MenuTop_C, EndStreamingSwitchVolume_TimeSet2_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop_RefProperty) == 0x000258, "Member 'AZero000_COMON_Layout_000_MenuTop_C::EndStreamingSwitchVolume_TimeSet2_ExecuteUbergraph_0000_COMON_Layout_000_MenuTop_RefProperty' has a wrong offset!");

}

